{
    "docno": "RJP182",
    "url": "https://guides.lib.ucr.edu/c.php?g=1019747&p=7386832",
    "text": "\n \n \n \n History of UCR - Guide to University Archives at UCR - Research Guides at University of California, Riverside Libraries \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Skip to main content \n \n    It looks like you're using Internet Explorer 11 or older. This website works best with modern browsers such as the latest versions of Chrome, Firefox, Safari, and Edge. If you continue with this browser, you may see unexpected results.\n \n \n \n \n \n \n \n \n \n \n \n UCR Library\n\t\t\t\t\t\t \n \n \n Research Guides\n\t\t\t\t\t\t \n \n \n Guide to University Archives at UCR\n\t\t\t\t\t\t \n \n History of UCR\n\t\t\t\t\t \n   \n \n \n \n \n \n \n Search this Guide \n \n Search \n \n \n \n   \n \n \n Guide to University Archives at UCR: History of UCR \n \n This guide will describe the general history of UCR and the resources available in University Archives. \n \n \n \n \n \n \n \n \n \n Overview \n \n \n \n \n History of UCR \n \n \n \n \n Campus \n \n \n \n \n Chancellors \n \n \n \n \n Colleges and Schools \n \n \n \n \n Faculty \n \n \n \n \n Students \n \n \n \n \n Searching \n \n   \n \n \n \n \n \n \n \n \n \n \n \n HISTORY OF THE UNIVERSITY OF CALIFORNIA, RIVERSIDE\n                                 \n \n \n \n The UC Citrus Experiment Station opened on February 14, 1907. It was a research station affiliated with the UC system where botanists, plant pathologists and other plant scientists conducted research on citrus and other types of plants.  H.J. Webber was the first Director or the CES. \n UCR was initially conceived of as a small liberal arts college. An official dedication ceremony was held in October 1954. At the dedication of the College of Letters and Science, Provost Gordon S. Watkins stated \"...we hope the new college will strive to safeguard and enhance the great traditions which are quite generally identified with a liberal education, namely freedom of enquiry, discovery of new truth, enthronement of reason, expansion of the empire of the mind, and the dignity of human personality.\" \n The first day of class was held on February 14, 1954. The original student body consisted of 127 students and 65 faculty. The first class of 20 students graduated from UCR on June 20, 1955. \n On April 18, 1959, the UC Regents voted to make UCR a “general campus\" that included graduate programs and professional schools. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n UC CITRUS EXPERIMENT STATION\n                                 \n \n \n \n \n UC Citrus Experiment Station \n \n \n \n \n \n \n \n \n \n \n \n \n \n DEDICATION OF THE UNIVERSITY OF CALIFORNIA, RIVERSIDE\n                                 \n \n \n \n \n \n Video showing the dedication ceremony of UCR held on October 22, 1954. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n RESOURCES\n                                 \n \n \n \n Citrus Research Center and Agricultural Experiment Station records (University of California, Riverside) (UA 042) \n The Citrus Research Center and Agricultural Experiment Station (CRC-AES) records collection contains administrative records, correspondence, faculty papers, publications, scrapbooks, clippings, photographs, reports, project files, and other material relating to CRC-AES. Formerly known as the Citrus Experiment Station (CES), the bulk of materials precede the establishment of UC Riverside's College of Letters and Sciences in 1954. The majority of topics document the history, events, faculty, staff, facilities, research, and experiments of CES. Materials related to CES research and experiments pertain to the physiology and morphology of citrus, fig, date palm, avocado, and other subtropical crops, soil management, smog studies, pest control, and diseases. A majority of citrus related publications and faculty papers were originally part of the former University of California Graduate School of Tropical Agriculture and Citrus Experiment Station Library. Project files pertain to research and experiments conducted by CES staff, faculty, and associated members. In addition, other subjects include the history of the citrus and avocado industry in Southern California, the introduction of the first Washington navel orange tree, and global production and marketing of citrus and subtropical agriculture. \n   \n Link to digital collection:  https://calisphere.org/collections/27141/ \n   \n \n   \n \n \n College of Humanities, Arts, and Social Sciences ( CHASS) records ( University of California, Riverside)  (UA 380) \n This collection contains reports, correspondence, minutes and other material which originated with or were transmitted to the University of California Riverside College of Letters & Science in the early years of UCR (1954-1969). Annual Reports of the various departments as well as minutes of Faculty meetings and of the Executive Committee are featured. The collection also includes a later accrual from the College of Humanities, Arts, and Social Sciences (CHASS) Dean's Office, which consists of trophies, plaques and medals commemorating UCR's participation in the City of Riverisde's Corporate Games. \n   \n   \n \n   \n \n \n Loda Mae Davis papers (UA 082) \n This collection includes correspondence, publications, fiction and non-fiction manuscripts, speech transcripts, photographs, videos, video logs, audio cassettes, and other material. Loda Mae Davis (1898-1989) was the first Dean of Women at the University of California, Riverside when it opened in 1954. The entire collection was for the Loda Mae Davis Women's Archive. The first part of the collection describes Davis' papers and the rest of the collection documents the life and work of female faculty members who contributed to the UCR academic community. Each file includes an oral history interview and supporting material. \n   \n   \n   \n   \n   \n   \n   \n \n   \n \n \n Jan Erickson collection of oral history interviews (UA 144) \n \nThis collection includes typed transcripts, audiocassettes, and videocassettes from an oral history project conducted betweeen 1992 and 2002 by Jan Erickson, former Administrative Assistant to Chancellor Raymond L. Orbach. The interviews include facts and historical details pertaining to key individuals associated with the campus in an aim to depict the evolution of the University of California, Riverside. \n   \n   \n \n   \n \n \n Historical records (University of California, Riverside) (UA 128) \n \nThis collection contains programs, publications, reports, minutes, correspondence, booklets, pamphlets, flyers, newspaper clippings, maps, and other material on the University of California, Riverside, which was opened in 1954 and is one of 10 other UC campuses. Mostly contains information on events, courses, and other material relating to UCR. \n   \n   \n \n   \n \n \n Memor abilia (University of California, Riverside) (UA 256) \n \nThis collection contains a bell, folders, a mouse pad, ribbons, and other material regarding memorabilia from the University of California, Riverside. Mostly contains items which belonged to former vice chancellor as well as other material. \n   \n   \n \n   \n \n \n Sound and video recordings (University of California, Riverside) (UA 373) \n The collection consists of audio and video recordings of various events held on the UC Riverside campus, as well as interviews with faculty and administrators. \n Select items from this collection have been digitized and are available online. \n   \n Link to digital collection:  https://calisphere.org/collections/27299/ \n   \n   \n   \n \n \n \n \n \n \n \n \n   <<  Previous:  Overview Next:  Campus >> \n \n \n \n \n \n \n Last Updated:   Sep 4, 2020 5:32 PM   \n \n URL:   https://guides.lib.ucr.edu/c.php?g=1019747   \n \n  Print Page   \n \n \n Login to LibApps   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n"
}