{
    "docno": "RJP143",
    "url": "https://merritt.cdlib.org/",
    "text": "\n \n \n \n \n \n \n \n \n \n \n   UC3 Merritt Home\n \n \n \n \n Skip to main content \n \n \n \n \n \n \n \n \n \n \n \n Login \n \n \n \n \n \n \n \n \n Merritt: A trusted, cost-effective digital preservation repository \n \n          Merritt is an open-source digital preservation repository maintained by the University of\n          California Curation Center (UC3) at the California Digital Library (CDL).\n         \n \n          Merritt is designed for both restricted access (also known as “dark archive”) and open public access to\n          digital content. Merritt provides multiple methods for deposit, supports multiple metadata formats, and\n          provides preservation functions and reporting.\n         \n \n          Merritt is available to all members of the University of California community to assist in\n          managing, archiving, and/or sharing digital content.\n         \n \n \n \n          Merritt’s preservation repository ensures:\n         \n \n \n            Long-term preservation assurance for your digital content\n           \n \n            Trusted repository support for both dark archives and retrieval copies\n           \n \n            Low-cost, high-quality option for meeting data sharing and preservation requirements of\n            grant-funded projects\n           \n \n \n \n \n Learn More \n \n        Merritt can help you manage, preserve, and provide access to your digital content. Read more\n        information about how Merritt works:\n       \n User Documentation \n Technical\n          Documentation \n \n \n Request Account \n \n        Merritt is available for use by libraries, archives, museums, academic departments,\n        laboratories, and other organizational units of the University of California.\n       \n \n Contact us for an account \n \n \n \n Trusted Repository \n \n \n \n Merritt is a CoreTrustSeal-certified digital repository. \n \n Learn more about Merritt’s\n        CoreTrustSeal certification \n \n \n \n Related CDL Services \n \n        Merritt serves as the preservation repository for many library and archival projects across the University of\n        California. This includes a number of products and services offered by California Digital Library (CDL) and\n        University of California Curation Center (UC3).\n       \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Login \n Help \n Contact \n \n \n \n \n      Merritt is a collaborative project between your UC campus and the\n       California Digital Library .\n     \n \n Version:  \n v1.0.16 \n ;  \n      Copyright © 2021 The Regents of the University of California\n     \n \n \n \n Terms of Use \n Privacy Policy \n Accessibility Policy \n \n \n \n \n \n"
}