{
    "docno": "RJP184",
    "url": "https://aeon.library.ucr.edu/logon",
    "text": ">\r\n\r\n \n \n Aeon Registration and Request system \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Welcome! \n All requests for Special Collections & University Archives materials are made through our electronic Special Collections Request system, which replaces all paper registration and request forms. With the Special Collections Request system you can:\r\n\t\t\t \n Submit requests using a form for books, journals/newspapers, and/or archival material; \n Submit requests automatically via links in our online catalog, Scotty; Submit requests automatically via links in our finding aids on the Online Archive of California (OAC); \n Submit requests in advance of a visit to the library;  \n Submit requests for reproductions including digital scans, of Special Collections & University Archives special collections materials; \n Track the status of each request; \n Access detailed information about past requests. \n Please review our  guidelines  for using materials to prepare for your visit. \n Please review our  reproduction policies and fees  prior to submitting a request for reproductions. \n *** Researchers are strongly advised to request materials at least 24 hours in advance in order to avoid delays in accessing materials. *** \n \n \n \n \n \n UCR Affiliate Researchers \n UCR Affiliate Researchers include current students, faculty, officers, and staff with an active UCR NetID. \n You will be required to authenticate using your UCR NetID and password. \n \n \n \n \n \n First-time users will be directed to a registration form to create a research account. \n \n \n Non-UCR Affiliate Researchers \n Non-UCR affiliate researchers include everyone not actively affiliated with the University of California, Riverside. \n \n \n \n \n \n Please select “First Time Users” on the next page to create a research account. \n \n \n \n Special Collections & University Archives \r\n\t\t\t\t\tTomás Rivera Library, 4th floor \r\n\t\t\t\t\tMonday-Friday, 10am-4pm \n Holiday Hours \r\n\t\t\t\t\tph. 951-827-3233 \r\n\t\t\t\t\tfax 951-827-4673 \n specialcollections@ucr.edu \n \n \n \n"
}