{
    "docno": "RJP194",
    "url": "https://guides.lib.ucr.edu/extracovidaccess/textbooks",
    "text": "\n \n \n \n Textbooks - Expanded/Free Access during COVID-19 Closure - Research Guides at University of California, Riverside Libraries \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Skip to main content \n \n    It looks like you're using Internet Explorer 11 or older. This website works best with modern browsers such as the latest versions of Chrome, Firefox, Safari, and Edge. If you continue with this browser, you may see unexpected results.\n \n \n \n \n \n \n \n \n \n \n \n UCR Library\n\t\t\t\t\t\t \n \n \n Research Guides\n\t\t\t\t\t\t \n \n \n Expanded/Free Access during COVID-19 Closure\n\t\t\t\t\t\t \n \n Textbooks\n\t\t\t\t\t \n   \n \n \n \n \n \n \n Search this Guide \n \n Search \n \n \n \n   \n \n \n Expanded/Free Access during COVID-19 Closure: Textbooks \n \n \n \n \n \n \n \n \n \n \n \n Overview \n \n \n \n \n Textbooks \n \n \n \n \n Other Ebooks \n \n \n \n \n Journals \n \n \n \n \n Video and Music \n \n   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Textbook Access Info\n                                 \n \n \n \n The first place to look for your textbook is in the  Library Catalog . However, this quarter we may have access to your textbook even if it is not in the catalog. \n Why wouldn't your textbook be in the catalog? \n Typically, the Library would purchase books for reserves at the request of faculty, add them to the catalog and designate them as course reserves.  However, this quarter we are getting access to many textbooks that we have not purchased and we have not added these to our catalog. \n So, how can you get to these textbooks?  \n \n Your instructor may have included a link in your iLearn. \n One of the links on this page may lead to your textbook \n You might be able to Google your book title \n If you need help,  ask a librarian . \n \n If your publisher is not listed, it is possible, they are not offering free access.  However, if you find that they are, please do let us know.  Things are changing very quickly. \n \n \n \n \n \n \n \n \n \n Open Textbooks\n                                 \n \n \n \n Open textbooks are freely available on the Web for classroom or personal use.  For more information see our guide.  The guide also includes information about textbooks that have already been purchased for unlimited classroom use at UCR. \n \n \n Open Textbooks and other Open Education Resources \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Hathitrust Emergency Temporary Access Service\n                                 \n \n \n \n \n HathiTrust \n\tUCR faculty and students can access a significant portion of materials owned by UC Libraries through the  HathiTrust Emergency Temporary Access Service .  Log in before searching, and search catalog or the \"Temporary Access\" titles will not show up in the results.  It is not possible to download temporary access titles. \n \n Books that are in the ETAS are unfortunately not eligible for curbside pickup. \n \n \n \n \n \n \n \n \n \n JSTOR\n                                 \n \n \n \n \n JSTOR   Because we already license content through JSTOR, they are making the rest of their journal content available to UCR users through June 2021. \n \r\nEnable VPN to access \n \n \n \n \n \n \n \n \n \n \n \n Known non-options\n                                 \n \n \n \n Unfortunately sources listed below will not work for UCR students. \n \n Vitalsource and RedShelf.  \n\tA lot of publishers make their books available through Vitalsource and RedShelf.  It is not possible for libraries to license these books unfortunately. \n Kindle  \n\tKindle ebooks are available for purchase by individuals only and not by libraries. \n OverDrive \n\tThe library does not have a relationship with OverDrive at this time and they would be complicated for textbooks in that books tend to circulate to a single individual for 2-4 weeks, making them inaccessible to others. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Need Help?\n                                 \n \n \n \n \n For questions about course reserves, contact:  libresv@ucr.edu \n To get assistance with books for classes that are not available through reserves, contact:  colldev@ucr.edu \n To get general library assistance:  Ask a Librarian \n \n \n \n UCR Library Course Reserves \n \n \n \n Suggest a purchase \n \n \n \n \n \n \n \n \n \n \n \n \n How to Connect from off Campus\n                                 \n \n \n \n Before you begin your research, connect to the Library. \n \n Install the  GlobalProtect VPN \n URL: campusvpn.ucr.edu  \n Sign in: NetID and Password \n Verify: Using  Multi-factor Authentication (MFA)   \n Use: Open any browser and access library resources \n Pin GlobalProtect somewhere easy to access \n \n \n \n Connecting from Off Campus \n Our LibGuide for in-depth instructions on remote access \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n   <<  Previous:  Overview Next:  Other Ebooks >> \n \n \n \n \n \n \n Last Updated:   Feb 24, 2021 10:00 AM   \n \n URL:   https://guides.lib.ucr.edu/extracovidaccess   \n \n  Print Page   \n \n \n Login to LibApps   \n \n \n \n \n \n Subjects:  \n General and Multidisciplinary Research \n \n \n Tags:  \n Coronavirus \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n"
}