{
    "docno": "RJP129",
    "url": "https://guides.lib.ucr.edu/connecting",
    "text": "\n \n \n \n Overview - Connecting to the Library with the VPN - Research Guides at University of California, Riverside Libraries \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Skip to main content \n \n    It looks like you're using Internet Explorer 11 or older. This website works best with modern browsers such as the latest versions of Chrome, Firefox, Safari, and Edge. If you continue with this browser, you may see unexpected results.\n \n \n \n \n \n \n \n \n \n \n \n UCR Library\n\t\t\t\t\t\t \n \n \n Research Guides\n\t\t\t\t\t\t \n \n \n Tutorials\n\t\t\t\t\t\t \n \n \n Connecting to the Library with the VPN\n\t\t\t\t\t\t \n \n Overview\n\t\t\t\t\t \n   \n \n \n \n \n \n \n Search this Guide \n \n Search \n \n \n \n   \n \n \n Connecting to the Library with the VPN: Overview \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n What's in this Guide?\n                                 \n \n \n \n This is a guide to help UCR students, staff and faculty understand the different methods of accessing UCR Library resources from off-campus.   \n Login via any of these requires a  UCR NetID and Password  (UCR email login and password). If you have challenges installing or using the VPN, please check  our FAQ . \n \n \n \n \n \n \n \n \n \n Ways to Connect\n                                 \n \n \n \n \n GlobalProtect \n Mobile \n \n \n \n \n PaloAlto Network's  GlobalProtect  VPN client is the preferred method of accessing UCR resources remotely. GlobalProtect is a program you install on your computer or device to establish a VPN connection with UC Riverside. This allows you to remotely access campus resources (example: Library services) that are restricted to on-campus use.  \n \n Download and Install  the appropriate version of the GlobalProtect VPN from the  ITS VPN GlobalProtect Connection Installation Instructions  page.  \n Need more assistance?  Watch one of these  installation videos .  \n \n Connect : \n \n Find the application on your computer and start it up. \n URL: campusvpn.ucr.edu \n Sign in: NetID and password \n Verify: Using Multi-factor Authentication (MFA) (The  DUO Mobile App  is recommended) \n \n \nOnce you are connected, open any browser to access library resources as if you were on campus.  If you are using applications that connect to UCR Library resources, such as EndNote or Zotero, use them as you would on campus as well. \n \nYou will stay connected until you disconnect or until the server restarts. If you have challenges installing or using the VPN, please check  our FAQ . \n \n \n \n \n To access materials through your mobile device, download the GlobalProtect VPN mobile application, available through app stores for Apple and Android.  \n \n Open the app and enter the portal address of ‘campusvpn.ucr.edu’ and select Connect. \n\tAllow the GlobalProtect VPN to Send You Notifications and Add VPN Configurations  \n URL: campusvpn.ucr.edu \n Sign in: NetID and password \n Verify: Using Multi-factor Authentication (MFA) \n Open your browser to search library resources \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Video Guides\n                                 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n How to tell if you are connected\n                                 \n \n \n \n \n You can get to UCR Library resources (some are included at the bottom of this box to make a quick check) \n If you go to Google and type  what is my IP , the address will begin with 169.235 \n If you open the GlobalProtect application, you will see \"Connected\" under the world icon \n \n \n \n Web of Science (WOS) from Clarivate \n \n \n Academic Search Complete \n \n \n \n \n \n \n \n \n \n \n \n When you are connected...\n                                 \n \n \n \n When you are connected to the VPN, you have access to all of the Library's online resources. \n From the Library home page, You can use any of our databases to find articles, you can access tens of thousands of ebooks and you the vast majority of our current (and much of our archival) journals. \n \n \n UCR Library Website \n \n \n \n \n \n UCR Library Catalog \n \n \n \n \n \n \n \n \n \n \n \n Troubleshooting / Questions?\n                                 \n \n \n \n Tips for  Troubleshooting   \n If you need additional assistance please use the contact information listed below: \n Staff and Faculty Help Desk \nTelephone:  951-827-3555  (8-5 M-F, Leave a message if they do not answer) \nEmail:  helpdesk@ucr.edu \n Student Help Desk \nTelephone:  951-827-6495  (8-Midnight M-TH, 8-5 Fri, and 1pm-Midnight Sun) \nEmail:  helpdesk@student.ucr.edu \n \n \n \n \n \n \n \n \n \n Disconnecting\n                                 \n \n \n \n To protect your privacy, consider disconnecting the VPN when you are not accessing UCR Library resources. \n To disconnect, open the GlobalProtect window, and click on Disconnect \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n   \n \n \n \n \n \n \n Last Updated:   Feb 12, 2021 2:21 PM   \n \n URL:   https://guides.lib.ucr.edu/connecting   \n \n  Print Page   \n \n \n Login to LibApps   \n \n \n \n \n \n Subjects:  \n General and Multidisciplinary Research ,  Technology Assistance \n \n \n Tags:  \n connect ,  home ,  remote ,  vpn \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n"
}