{
    "docno": "RJP18",
    "url": "https://guides.lib.ucr.edu/az.php",
    "text": "\n \n A-Z Databases \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Skip to main content \n \n \n    It looks like you're using Internet Explorer 11 or older. This website works best with modern browsers such as the latest versions of Chrome, Firefox, Safari, and Edge. If you continue with this browser, you may see unexpected results.\n \n \n \n \n \n \n \n \n \n \n \n \n UCR Library\n\t\t\t\t\t\t \n \n \n Research Guides\n\t\t\t\t\t\t \n \n A-Z Databases\n\t\t\t\t\t \n \n \n A-Z Databases \n Find the best library databases for your research. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Toggle search filters navigation \n \n \n \n \n \n \n \n \n \n \n \n Database Subject Filter \n \n All Subjects \n \n African American Studies \n Agriculture \n Anthropology \n Art & Art History \n Asian American Studies \n Biochemistry \n Bioengineering \n Biology \n Botany and Plant Sciences \n Business \n Chemical Engineering \n Chemistry \n Chicanx Studies \n Chinese Studies \n Citation and Reference Management \n Classical Studies \n Comparative Literature and Foreign Languages \n Computer Science \n Creative Writing \n Dance \n Earth and Planetary Sciences \n Economics \n Education \n Electrical Engineering \n Engineering \n English \n Entomology \n Environmental Engineering \n Environmental Science \n Ethnic Studies \n Events \n French \n Gender and Sexuality Studies \n General and Multidisciplinary Research \n Geology \n Germanic Studies \n Global Studies \n Hispanic Studies \n History \n History - American \n Humanities \n Japanese Studies \n Latin American Studies \n Law \n Linguistics \n Maps and Geospatial Information \n Materials Science \n Mathematics \n Mechanical Engineering \n Media and Cultural Studies \n Medicine \n Microbiology \n Middle East and Islamic Studies \n Music \n Native American Studies \n Neuroscience \n Philosophy \n Physics and Astronomy \n Political Science \n Psychology \n Public Policy \n Religious Studies \n Sciences \n Sociology \n Southeast Asian Studies \n Spanish \n Statistics \n Sustainability Studies \n Technology Assistance \n Theatre, Film, and Digital Production \n University Honors \n \n \n \n Database Types Filter \n \n All Database Types Audio Archive Bibliographic Database Book and Document Archive Data Repository E-Book Collection Experimental Protocols Collection Image Archive Journal Collection Library Catalog / Discovery Service Literature Collection Multidisciplinary Database Newspaper Collections Paper Repository Publisher-Based Digital Library Reference Work Research Tool Streaming Media Video Archive \n \n \n \n Database Vendors Filter \n \n All Vendors / Providers Accessible Archives Adam Matthew Alexander Street Press American Psychological Association Bloomsbury Brill Cambridge Crystallographic Data Centre Chadwyck-Healey at ProQuest Chemical Abstract Service Clarivate East View EBSCO Ex Libris FIZ Karlsruhe Free / Open Access Gale Henry Stewart Talks JSTOR Library of Congress McGraw-Hill Newsbank Nexis Uni OCLC Oxford University Press ProQuest Readex Reed Elsevier SAGE Springer Nature Thieme Wiley Wolters Kluwer Yale \n \n \n \n \n \n DATABASES \n \n \n \n Go \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n All A B C D E F G H I J K L M N O P Q R S T U V W X Y Z # \n \n \n   Clear Filters/Browse All Databases \n \n \n Loading... \n \n \n \n \n \n General databases for all subjects\n                                 \n \n \n \n \n Web of Science (WOS) from Clarivate   Provides access to records from the top journals, conference proceedings, and books in the sciences, social sciences, and arts and humanities to find the high quality research most relevant to the area of interest. Using linked cited references, subject connections between articles that are established by the expert researchers can be explored. \n \n \n Academic Search Complete   A scholarly, multidisciplinary database providing indexing and abstracts for more than 10,000 publications, including monographs, reports, conference proceedings, and others. Also includes full-text access to 5,500+ journals, including more than 4,600 peer-reviewed journals. Coverage is 1984-present. \n \n \n \n \n \n \n \n Popular Databases \n Loading... \n The most frequently-used databases\n             \n \n Academic Search Complete  This link opens in a new window   \n \n Popular \n \n \n This opens a pop-up window to share the URL for this database \n \n A scholarly, multidisciplinary database providing indexing and abstracts for more than 10,000 publications, including monographs, reports, conference proceedings, and others. Also includes full-text access to 5,500+ journals, including more than 4,600 peer-reviewed journals. Coverage is 1984-present. \n \n \n \n PubMed@UCR  This link opens in a new window \n \n Popular \n \n \n This opens a pop-up window to share the URL for this database \n \n PubMed includes MEDLINE and other biomedical databases. This premier database contains over 11 million journal citations and abstracts. \n \n \n \n Web of Science (WOS) from Clarivate  This link opens in a new window \n \n Popular \n \n \n This opens a pop-up window to share the URL for this database \n \n Provides access to records from the top journals, conference proceedings, and books in the sciences, social sciences, and arts and humanities to find the high quality research most relevant to the area of interest. Using linked cited references, subject connections between articles that are established by the expert researchers can be explored. \n \n \n \n New / Trial Databases \n Loading... \n The following databases are newly acquired or being evaluated for a future subscription.\n             \n \n Bibliography of Asian Studies  This link opens in a new window \n \n Trial \n \n \n This opens a pop-up window to share the URL for this database \n \n Comprehensive Western-language bibliographical database for research on East, Southeast and South Asia. Published by the Association for Asian Studies, it covers all subjects with special focus on the humanities and social sciences. \n \n \n \n British Association for the Advancement of Science Archives: Collections on the History of Science (1830s-1970s)  This link opens in a new window \n \n New \n \n \n This opens a pop-up window to share the URL for this database \n \n The Archive of the British Association for the Advancement of Science (BAAS) and connected collections from UK universities covers astronomy, biology, technology, industrial design, chemistry, engineering, mathematics, agriculture, meteorology, physics, history of science and STEM, and government grants for scientific research. It contains administrative records, correspondence, illustrations, manuscripts, photographs, prototypes, clippings, personal papers, gray literature—all presented as fully searchable digital images that can be analyzed, downloaded, manipulated, and compared with content from other societies and universities in the Wiley Digital Archives platform. \n \n \n \n Digital Theatre +  This link opens in a new window \n \n New \n \n \n This opens a pop-up window to share the URL for this database \n \n Digital platform for performing arts featuring productions, theory & criticism, teaching resources, and videos of practitioners and their practice. \n \n \n \n OverDrive  This link opens in a new window \n \n New \n \n \n This opens a pop-up window to share the URL for this database \n \n OverDrive is an awesome new option for leisure reading, genre reading,  juvenile education and popular science titles.  Happy reading! \n \n \n \n Yewno Discover  This link opens in a new window \n \n New \n \n \n This opens a pop-up window to share the URL for this database \n \n Yewno is a discovery tool that provides a graphical display of the interrelationships between concepts.  Yewno uses computational semantics, graph theory, and machine learning to extract concepts from scholarly publications including journals, books, and theses, and displays search results in a graphical interface that displays the interrelationships between those concepts. Users can follow links in that display to find the underlying publications from which concepts and relationships are extracted, and the system integrates with library resource licenses allowing users to have direct access to the full text of underlying publications. \n \n \n \n \n Loading... \n \n \n \n \n \n \n \n \n \n \n            Powered by Springshare.\n         \n \n            All rights reserved.\n         \n \n Login to LibApps \n \n \n \n \n \n \n \n \n \n \n \n \n title \n × \n \n  Loading...\n                     Close \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n"
}