{
    "docno": "RJP19",
    "url": "https://guides.lib.ucr.edu/c.php?g=291771&p=1943880",
    "text": "\n \n \n \n at UC and UCR - Research Data Management - Research Guides at University of California, Riverside Libraries \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Skip to main content \n \n    It looks like you're using Internet Explorer 11 or older. This website works best with modern browsers such as the latest versions of Chrome, Firefox, Safari, and Edge. If you continue with this browser, you may see unexpected results.\n \n \n \n \n \n \n \n \n \n \n \n UCR Library\n\t\t\t\t\t\t \n \n \n Research Guides\n\t\t\t\t\t\t \n \n \n Research Data Management\n\t\t\t\t\t\t \n \n at UC and UCR\n\t\t\t\t\t \n   \n \n \n \n \n \n \n Search this Guide \n \n Search \n \n \n \n   \n \n \n Research Data Management: at UC and UCR \n \n Data management basics and tools provided by the UC-system. \n \n \n \n \n \n \n \n \n \n Home \n \n \n \n \n Data Management Plans \n \n \n \n \n Funder & Publisher Requirements \n \n \n \n \n Find/Deposit Data \n \n \n \n Toggle Dropdown \n \n \n \n General Repositories and Government Data\n                                    \n                                 \n \n \n at UC and UCR\n                                    \n                                 \n \n \n \n \n Working With Data \n \n \n \n \n Data Services \n \n   \n \n \n \n \n \n \n \n \n \n \n \n UC and UC Riverside Resources\n                                 \n \n \n \n The California Digital Library (CDL) provides a  suite of services  to support preservation of digital scholarship and data within the UCs.   \n   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Merritt: The UC Repository\n                                 \n \n \n \n \n Merritt  is a cost-effective repository service from the University of California Curation Center (UC3) that lets the UC community manage, archive, and share its valuable digital content. Use Merritt to provide long-term preservation of digital assets, share your research with others or meet the data preservation requirements of a grant-funded project. \n Data uploaded to Merritt is given a persistent URL.   Data stored in Merritt is not discoverable; it is only found if someone already knows the persistent URLs. \n \n CDL's Merritt FAQ \n \n \n \n \n \n \n \n \n \n \n EZID\n                                 \n \n \n \n ​ \n EZID (easy-eye-dee)  makes it easy to create & manage unique, long-term identifiers \n \n create identifiers for anything. \n store citation metadata for identifiers in a variety of formats  \n update current URL locations so citation links are never broken  \n choose from a variety of persistent identifiers, including ARKs and DataCite DOIs  \n Integrates with eScholarship to provide DOIs for journals published on that platform \n \n If your publication or dataset is already on a persistent and sustained publishing space, such as eScholarship or a permanent dedicated server in the case of very large datasets, EZID can create a persistent DOI for permanent citation and discovery.   Contact us  to to coordinate minting DOIs using EZID or set up EZID integrations. \n   \n \n \n \n \n \n \n \n \n \n \n \n \n \n Dryad | UCR\n                                 \n \n \n \n \n UC Riverside Library supports  Dryad , an open-source, research data curation and publication platform. UC Riverside is a proud partner of Dryad and offers Dryad as a free service for all UC Riverside researchers to publish and archive their data. It is designed to be a simple tool for researchers to archive and share their datasets, while fulfilling funder requirements. Datasets published in Dryad receive a citation and can be versioned at any time.  All records created in Dryad are searchable; indexed in Data Citation Index (SM), Scopus, and Google Dataset Search; and provided a unique Digital Object Identifier (DOI).  Dryad may be used as a permanent archive with stable URLs. \n Dryad provides \n \n Curation services for submitted datasets \n A persistent DOI for permanent citation and discovery \n Ability to make private or embargo datasets \n Discovery and retrieval of data through faceted search and browse \n \n \n \n Dryad Submission and Publication Process \n \n \n \n Dryad's Quickstart Guide to Data Sharing \n \n \n \n Dryad's Good Data Practices \n \n \n \n \n \n \n \n \n \n \n \n \n Dryad FAQs\n                                 \n \n \n \n FAQs \n Who can deposit data here? \n Any UCR affiliated researcher (faculty, postdoc, student, or staff) can use this resource to archive and share research data sets, provided they have appropriate permission. Data that are collected at research sites are under the stewardship of the Principal Investigator (PI) named on the resource provided to collect the data, and this PI may grant permission to deposit data. \n How can I start using Dryad? \n Dryad uses ORCID as its primary login method. Log into ORCID using your institutional account. This will redirect you to login through CAS using your NetID and password. \n What if I have a better repository?  Do I need to use Dryad? \n No.  We recommend using the most appropriate repository to share your data.  However, data may be uploaded in both places and cross-listed.  Using Dryad will ensure long-term storage with a persistent DOI. \n What if I have a Data Dictionary or Code Book? \n Data can't be used by others if they don't understand what the data describes.  A code book which describes the data may included with the upload. \n What if I have collaborators outside of UCR? \n You will need UCR credentials to log into the system and deposit data. You can, however, add your collaborators to the “data contributors” section of the metadata. Although only researchers logged in with UCR credentials can deposit data, anyone can search, view and download datasets in Dryad. \n Do you support data embargoes or restricted access? \n Dryad supports limited time embargoes, while providing a DOI for stable citation and retrieval of the data. \n Who can access these datasets? \n All data deposited into Dryad is CC0. This means anyone can access and download the datasets.  Although many researchers would prefer to maintain more control over who downloads and uses their data, we believe that having data that are fully open is the best way to enable academic advancement. Read  Panton Principles for Open Data in Science  for more information. \n How will someone find my data? \n Metadata will be indexed by the Data Citation Index SM , Scopus, and Google Dataset Search. \n Do the data have to be associated with a publication? \n No. Dryad accepts all data, regardless of whether it’s been used to publish a paper. \n Do I need to log into Dryad to get data? \n Persons requesting data are not required to sign-in in order to do so. Unless an embargo period is selected, data sets will be made available immediately. \n What if I have other questions about Dryad? \n Please  contact us   with any questions about Dryad. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n   <<  Previous:  General Repositories and Government Data Next:  Working With Data >> \n \n \n \n \n \n \n Last Updated:   Apr 21, 2021 10:01 AM   \n \n URL:   https://guides.lib.ucr.edu/datamanagement   \n \n  Print Page   \n \n \n Login to LibApps   \n \n \n \n \n \n Subjects:  \n General and Multidisciplinary Research \n \n \n Tags:  \n Data ,  Data management ,  reproducible research \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n"
}