{
    "docno": "RJP139",
    "url": "https://guides.lib.ucr.edu/c.php?g=291771&p=1943636",
    "text": "\n \n \n \n Find/Deposit Data - Research Data Management - Research Guides at University of California, Riverside Libraries \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Skip to main content \n \n    It looks like you're using Internet Explorer 11 or older. This website works best with modern browsers such as the latest versions of Chrome, Firefox, Safari, and Edge. If you continue with this browser, you may see unexpected results.\n \n \n \n \n \n \n \n \n \n \n \n UCR Library\n\t\t\t\t\t\t \n \n \n Research Guides\n\t\t\t\t\t\t \n \n \n Research Data Management\n\t\t\t\t\t\t \n \n Find/Deposit Data\n\t\t\t\t\t \n   \n \n \n \n \n \n \n Search this Guide \n \n Search \n \n \n \n   \n \n \n Research Data Management: Find/Deposit Data \n \n Data management basics and tools provided by the UC-system. \n \n \n \n \n \n \n \n \n \n Home \n \n \n \n \n Data Management Plans \n \n \n \n \n Funder & Publisher Requirements \n \n \n \n \n Find/Deposit Data \n \n \n \n Toggle Dropdown \n \n \n \n General Repositories and Government Data\n                                    \n                                 \n \n \n at UC and UCR\n                                    \n                                 \n \n \n \n \n Working With Data \n \n \n \n \n Data Services \n \n   \n \n \n \n \n \n \n \n \n \n \n \n Data Repositories and Sources\n                                 \n \n \n \n There are many data repositories and archives which support finding or storing research data. Most of the repositories are organization or discipline and subject specific; however, below are listed resources to find research data across the disciplines. \n Government agencies will produce data and statistics which may be useful for research in many disciplines. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Multi-discipline Repositories and Archives\n                                 \n \n \n \n \n Data Citation Index   allows searching for data across multiple disciplines.  When searching for data using a citation, Data Citation Index is the best resource to use. \n DataCite  is a resource which brings allows you to find data and repositories across multiple disciplines.  Includes a metadata field search and DOI resolver. \n re3data.org , the Registry of Research Data Repositories is a global registry of research data repositories covering different academic disciplines.  \n Open Access Data Repositories  provides a list of repositories and databases for open data across multiple disciplines. \n Data.gov  is the US Government's open data portal, which includes Federal, state and local data, tools and resources. \n \n   \n \n \n \n \n \n \n \n \n \n \n \n \n \n Government Data and Statistics\n                                 \n \n \n \n \n U.S. Bureau of Economic Analysis  provides an interactive application to access and use national, industry, and international data such as GDP, GDP & personal income; GDP by industry; direct investment & MNEs; input-output tables, and more.   \n U.S. Census Bureau  provides data tools and interactive applications such as QuickFacts which provides information at the national, state, county, and city level; and industry snapshots.  Statistics the Census Bureau creates includes the 2012 Economic Census, 2010 Decennial Census, median income, population, and U.S. international trade in goods & services. \n U.S. Census Bureau Data Visualizataion Gallery  provides a weekly visual exploration of Census Data \n U.S. Census Bureau Geography  provides data which has been geolocated to put into geographical context. \n Bureau of Labor Statistics  provides databases, tables & calculators by subject including Inflation and Prices, Employment, Unemployment, Productivity, Employment projections, and more.  Includes a public data API. \n Statistical Sites on the World Wide Web  is maintained by BLS containing links to statistics from other U.S. and foreign government, and international agencies . \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n   <<  Previous:  Funder & Publisher Requirements Next:  General Repositories and Government Data >> \n \n \n \n \n \n \n Last Updated:   Apr 21, 2021 10:01 AM   \n \n URL:   https://guides.lib.ucr.edu/datamanagement   \n \n  Print Page   \n \n \n Login to LibApps   \n \n \n \n \n \n Subjects:  \n General and Multidisciplinary Research \n \n \n Tags:  \n Data ,  Data management ,  reproducible research \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n"
}