{
    "docno": "RJP138",
    "url": "https://guides.lib.ucr.edu/c.php?g=291771&p=1943634",
    "text": "\n \n \n \n Funder & Publisher Requirements - Research Data Management - Research Guides at University of California, Riverside Libraries \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Skip to main content \n \n    It looks like you're using Internet Explorer 11 or older. This website works best with modern browsers such as the latest versions of Chrome, Firefox, Safari, and Edge. If you continue with this browser, you may see unexpected results.\n \n \n \n \n \n \n \n \n \n \n \n UCR Library\n\t\t\t\t\t\t \n \n \n Research Guides\n\t\t\t\t\t\t \n \n \n Research Data Management\n\t\t\t\t\t\t \n \n Funder & Publisher Requirements\n\t\t\t\t\t \n   \n \n \n \n \n \n \n Search this Guide \n \n Search \n \n \n \n   \n \n \n Research Data Management: Funder & Publisher Requirements \n \n Data management basics and tools provided by the UC-system. \n \n \n \n \n \n \n \n \n \n Home \n \n \n \n \n Data Management Plans \n \n \n \n \n Funder & Publisher Requirements \n \n \n \n \n Find/Deposit Data \n \n \n \n Toggle Dropdown \n \n \n \n General Repositories and Government Data\n                                    \n                                 \n \n \n at UC and UCR\n                                    \n                                 \n \n \n \n \n Working With Data \n \n \n \n \n Data Services \n \n   \n \n \n \n \n \n \n \n \n \n \n \n Data Management Requirements\n                                 \n \n \n \n Different funders and publishers will have different data management requirements.  As an example, a data management plan (DMP) written for an NSF proposal might not include requirements of a DOE proposal.   It is important to know and meet the requirements specific for your particular funder, grant program, and publisher.  Always read your Funding Opportunity Announcement or Solicitation for additional or specific requirements.   \n This page includes links to policy for common US Federal funders, including NSF, DOE, NIH, NEH, and IES; and sharing policy for publishers including Nature and Science.   Contact us  to receive DMP consultation for any research project or funding application. \n   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n DMPTool\n                                 \n \n \n \n \n The DMPTool allows you to use a template to create a data management plan for your grant application. Answering the questions in the template to create your plan.  It is helpful to answering the questions on the \"Data Management Plans\" tab prior to using the DMPTool. \n \n \n \n \n \n \n \n \n \n Journals and Publishers\n                                 \n \n \n \n Many publishers require that data which supports the underlying research reported in an article be made available to any reader of the journal which publishes the article.  These requirements are not always posted on the Information For Authors page; look in other areas if a data sharing requirement isn’t readily apparent. Publishers also sometimes recommend repositories for data in different disciplines; this is useful if you are not familiar with repositories in your field. \n Data sharing policies for Science and Nature \n \n Science: Data Availability \n Nature: Scientific Data Policies \n Nature: Open Access Policies \n Nature: Availability of Materials and Data \n \n \n \n \n \n \n \n \n \n \n National Institutes of Health\n                                 \n \n \n \n NIH does not require a full data management plan, but one section of a regular DMP: sharing data.  Current research applications requesting $500,000 or more of direct costs in any single year are expected to include a plan for sharing final research data for research purposes, or state why data sharing is not possible.  The plan must state how the applicant will maintain and protect the rights and confidentiality of participants, if human subjects are involved. \n \n NIH Data Sharing Policy and Implementation Guidance \n NIH Data Sharing Policy  \n Frequently Asked Questions (FAQs) on Data Sharing  (last revised 2019) \n \n \n NIH is moving toward an integrated data-ecosystem. \n \n NIH: Office of Data Science Strategy \n NIH’s Strategic Vision for Data Science: Enabling a FAIR-Data Ecosystem  (also,  adapted presentation ) \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n National Science Foundation\n                                 \n \n \n \n National Science Foundation \n NSF requires that all current proposals include a Data Management Plan as a supplementary document, to be no more than two pages, to conform to their data sharing policy.  Investigators are expected to share data, samples, and supporting materials created or gathered during NSF funded research ( Award & Administration Guide (AAG) Chapter VI.D.4 ). \n NSF has three levels of DMP requirements:  Directorate, division, or unit specific;  Grant Proposal Guide  which must be followed if guidance specific to the program is not provided; and Program Solicitation guidance which must be followed if provided.  \n \n NSF General DMP Policy \n Frequently Asked Questions (FAQs) for Public Access \n \n Directorate Guidance \n Biological Sciences Directorate (BIO) \n \n Directorate-wide Guidance  (posted Feburary 2018) \n \n Computer & Information Sciences & Engineering (CISE) \n \n Directorate-wide Guidance  (last revised April 2018) \n \n Education & Human Resources Directorate (EHR) \n \n Directorate-wide Guidance  (Effective January 2018, posted September 2017) \n \n Engineering Directorate (ENG) \n \n Directorate-wide Guidance  (last revised November 2018) \n \n Geosciences Directorate (GEO) \n \n Directorate-wide Guidance  (last revised February 2018) \n \n Mathematical and Physical Sciences Directorate (MPS) \n \n Division of Astronomical Sciences  (last revised January 2018) \n Division of Chemistry  (last revised January 2018) \n Division of Materials Research  (last revised January 2018) \n Division of Mathematical Sciences  (last revised January 2018) \n Division of Physics  (last revised January 2018) \n \n Social, Behavioral and Economic Sciences Directorate (SBE) \n \n Directorate-wide Guidance  (last revised April 2018) \n \n \n docs last checked: 20190729 kek \n \n \n \n \n \n \n \n \n \n NIST\n                                 \n \n \n \n Policies, Directives, and NIST's Public Access Plan \n \n \n \n \n \n \n \n \n \n \n \n \n \n National Endowment for the Humanities\n                                 \n \n \n \n \n Data isn’t generated only in the sciences!  Digital Humanities projects also create and collect data.  NEH has a DMP requirement for proposals and awards.  NEH provides sample grant narratives from successful ODH applications, which include DMPs, and guidelines for DMP creation.   \n \n Data Management Plans for NEH Office of Digital Humanities Proposals and Awards \n\t  \n \n \n \n \n \n \n \n \n \n \n \n Dept of Ed: Institute of Education Services\n                                 \n \n \n \n IES has policy requiring DMPs with all current grant applications.  Data sharing is currently required for Goal 4 Effectiveness and Goal 3 Efficacy and Replication grants.  In FY2016, IES included a requirement for data sharing for the Research Networks on Critical Problems of Policy and Practice competition. \n \n IES Policy Regarding Public Access to Research \n Policy Statement on Public Access to Data Resulting from IES Funded Grants \n Implementation Guide for Public Access to Research Data \n Frequently Asked Questions About Providing Public Access To Data \n \n \n \n \n \n \n \n \n \n \n \n US Department of Energy\n                                 \n \n \n \n \n The DOE requires that all proposals submitted to the Office of Science for research finding including a Data Management Plan (DMP). There are three levels of DMP requirements which must be met: general  DOE , Program Office specific, and FOA requirements. \n \n DOE DMP Requirements \n \n DOE Program Offices \n \n Advanced Scientific Computing Research   \n Basic Energy Sciences   \n Biological and Environmental Research   \n Fusion Energy Sciences   \n High Energy Physics   \n Nuclear Physics \n Small Business Innovation Research (SBIR) and Small Business Technology Transfer (STTR)   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n   <<  Previous:  Data Management Plans Next:  Find/Deposit Data >> \n \n \n \n \n \n \n Last Updated:   Apr 21, 2021 10:01 AM   \n \n URL:   https://guides.lib.ucr.edu/datamanagement   \n \n  Print Page   \n \n \n Login to LibApps   \n \n \n \n \n \n Subjects:  \n General and Multidisciplinary Research \n \n \n Tags:  \n Data ,  Data management ,  reproducible research \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n"
}