{
    "docno": "RJP13",
    "url": "https://ehs.ucr.edu/coronavirus/return",
    "text": "\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Reopening Work | Environmental Health & Safety \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Skip to main content \n \n Planning Budget & Administration \n \n \n \n \n \n \n Report a Incident, Injury or Safety Concern \n \n \n Report a COVID-19 or Public Health Concern \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n UC Riverside \n \n \n \n \n  Environmental Health & Safety  \n \n \n \n \n \n \n \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n About EH&S \n \n \n Organizational Chart \n \n \n Programs & Policies \n \n \n Staff Directory \n \n \n Who Do I Call? \n \n \n \n \n How Can We Help? \n \n \n Programs & Policies \n \n \n Food Permit Request \n \n \n Hazardous Waste Pick Up \n \n \n Log into Chemicals, INSPECT, LHAT, & WASTe Apps \n \n \n Personal Protective Equipment (PPE) \n \n \n \n \n Programs & Services \n \n \n Training \n \n \n COVID-19 Prevention Training \n \n \n \n \n Report \n \n \n COVID-19 Concern \n \n \n Safety Concern \n \n \n Work Related Injury/Illness \n \n \n \n \n \n \n \n \n \n \n Report a Incident, Injury or Safety Concern \n \n \n Report a COVID-19 or Public Health Concern \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Face Coverings are required while on campus. Staff/Faculty may request a  face covering from EH&S . Students may request a  face covering from The Well . \n \n \n × \n \n \n \n \n \n \n \n \n \n \n Breadcrumb \n \n \n \n \n \n \n \n \n \n Coronavirus \n \n \n Reopening Work \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Return to Campus protocols \n  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n As always, your health and well-being are our primary concern. If you are able to do your job effectively without returning to campus, we urge you to talk with your supervisor about continuing to work remotely.  As more people get vaccinated and the overall level of new COVID-19 cases declines across the country, we are easing out of the worst public health crisis in a generation.  All returns to the workplace must be pre-approved.  If you have any questions or concerns about this, please speak with your supervisor. The guidance below applies to all employees who perform duties on campus or UC leased or affiliated properties, unless the facility has expressly provided different instructions. Deans and unit heads will determine which groups are needed to work in person. For those who are approved to return, we are instituting new protocols designed to protect yourself and others. We expect all on-campus workers to abide by the guidelines and directives described below. \n Supervisors \n Authorization .  Provide authorization for each employee to report onsite.  \n Worksite specific plan.  Must develop own  Worksite Specific Plan  . In some cases, the Worksite Specific Plan may be routed to campus oversight committees for review and approval prior to return to campus.  \n Positive case?   Refer to the COVID-19  Symptom monitoring and reporting procedures   and  Response to suspected COVID-19 cases :   Guide for Department Leads, Supervisors, Chairs\".  Download the quick reference for  Supervisors Infographic . \n For All Returning Employees \n COVID-19 Prevention Plan Campus Guidance \n COVID-19 Prevention Plan \n The campus has developed general guidance, which all employees should review. \n Prior to your return, your supervisor must share their  Worksite Specific Plan  with all their employees, and you must review and acknowledge. \n Download the  When To Return guidance infographic .  \n You can also view the  Return to Campus Working Group   webinars on You Tube . \n Training \n COVID-19 PREVENTION \n All employees who plan to be on-site are required to view a training video, \"COVID-19 prevention training\" as required by CDPH/CalOSHA before returning to campus.  Even if you will continue to work remotely, but may need to come to campus occasionally, you must complete this training. This course is accessible in the  UC Learning Center .  \n Training \n Wellness \n UCR COVID-19 DAILY WELLNESS CHECK SURVEY \nAll employees who work on-site at a UCR property (owner or leased) must complete a survey prior to reporting for work. If you have symptoms or concerns about exposure, contact your primary care physician and the Wellness Hotline (844) 827-6827. For more information, refer to the COVID-19  Symptom monitoring and reporting procedures  (SOP). \n Daily wellness check   \n EMPLOYEE WELLNESS PROGRAM \nThe UCR Wellness Program focuses on promoting awareness and education, motivation for positive behavior changes, and influencing campus practices and policy to support a healthy environment. Wellness \n FACULTY STAFF ASSISTANCE PROGRAM \nComPsych will provide GuidanceResources® services whose benefits will provide UCR faculty, staff and their household family members confidential support, resources and information for personal and work-life issues, free of charge Faculty Staff Assistance Program \n Face covering \n In compliance with the UC order and the California Department of Public Health all individuals on UC property are required to wear face coverings. EH&S is offering face coverings to all campus employees. Submit a request using the button below. Supervisors may request on behalf of their staff using the Face Covering Request form. \n Face Covering Request \n Hygiene \n Disinfectant and sanitizers \n Order  a disinfectant kit from Facilities services (includes disinfectant, painter’s tape, shop towels, and other items).  Download the  Disinfecting Infographic  for an at a glace guide.   \n Disinfectant KiT Request   \n Handwashing \n All employees must practice good hygiene by frequently washing your hands with soap and water for 20 seconds or longer. When possible, use soap and water instead of hand sanitizer.  Watch  this short video on proper handwashing. \n Custodial  \n A summary of COVID-19 Building Ventilation, Lab Sanitation, Disinfecting and Cleaning schedule as of July 10, 2020 (view the schedule in the link below). Learn more at Facilities Services  Campus Return Support Information  view details on  cleaning schedule . \n Guidance Document and Schedule \n Ventilation \n All campus buildings that are open to the public during normal times are safe environments. Some of our buildings are much older and have some limitations. Our buildings are designed to provide sufficient \nair changes based on building activities. We are making a special effort to ensure that all buildings have current filter changes. The information below is how HVAC systems are maintained. \n Expanded Timeframe: To help with airflow, Facilities Services is expanding the length of time outside airflow will circulate throughout each building. \n Filtration Maintenance: Building filtration systems are well maintained and have the appropriate level of filters for each building. \n Air Flow: To accommodate efficient airflow in each building, the most advanced level of filters \nare being used based on the building’s air filtration system capabilities. \n Building Ventilation \nStrict adherence to the public health posters and other visual cues throughout campus and in buildings will reduce transmission risks. Ventilation systems will continue to operate as designed even though \nbuilding occupancy will be reduced. This will further reduce the risk of potential airborne transmission.  While each individual occupant of a campus building will want to make sure these guidelines are \nfollowed, including limited occupancy, it will be very important to ensure that all the other occupants in that building, at least on that same floor, coordinate to ensure the overall density and guidelines are \nbeing followed on a collective basis. \n Transmission Reduction Efforts \nAccording to the World Health Organization (WHO) and the Centers for Disease Control (CDC), the COVID-19 virus appears to spread human-to-human through respiratory droplets coming from an infected person. Based on public health guidance, the key transmission reduction factors include: \n social distancing, \n limiting occupancy, \n practicing good personal hygiene, and \n utilizing face coverings \n As part of the public health guidance, Facilities Services will disinfect high-touch areas including elevators, door handles, common areas and restrooms. We have made disinfecting kits available to departments and hand sanitizing stations are located at the entrance of each building. A map locating sanitizing stations can be viewed by clicking  here .  \n HVAC ventilation FAQ's \n Resources and SOPs \n Signage \n The campus has developed standard signage and postings for building entrances, exits, stairs, elevators and more. Download and post signage through your work areas. \n COVID-19 Campus SignaGE \n The following posters are installed throughout campus: \n Keep yourself healthy  \n Face covering required \n Elevator (1 person maximum) \n Wait here (footprints) \n Do not use (this area is closed) \n To obtain additional signs complete the  COVID-19 signage request . \n Standard Operating Procedures (SOP) \n General Areas: Office Space General Area/Office Space Disinfection SOP \n Laboratories \n\tLaboratory/Research Space Disinfection SOP \n Facilities \n\tDisinfection response plan SOP \n Shared Vehicle \n To reduce the spread of COVID-19, avoid sharing UCR vehicles whenever possible. Employees may share vehicles only if approved in advance and in writing by a supervisor. Review this  Shared Vehicle Guidance  for details. \n Visitors & Contractors \n We recognize that visitors, contractors, vendors and other non-UCR personnel may need to come to campus. \n Contract employees working through third party employers must follow all campus protocols. \n Contract employees are required to continue following all Non-Pharmaceutical Interventions (NPI), such as masking, physical distancing, hygiene, daily wellness checks until further notice \n Contract units must complete and submit a copy of their WSSP or provide their employer’s equivalent documentation to   ehspublichealth@ucr.edu \n Non-UCR affiliated individuals coming to campus for essential work must abide by visitor guidelines.  \n Non-UCR Affiliate information  \n Travel \n Employees who have travelled domestically or internationally, whether for personal or business purposes should refer to the following guidelines and restrictions regarding travel.  \n Travel Guidelines \n Parking \n Find the most up to date information on parking from Transportation Services \n Parking Information \n  \n   \n \n \n \n \n \n \n \n \n \n Quick Links \n \n \n Campus Return \n \n Hotline \n \n UCR Daily Wellness Check Survey \n \n Human Resources COVID-19 Resources \n \n Student Health Services \n \n Campus Emergency Status \n \n Keep Teaching \n \n Keep Learning \n \n Keep Working \n \n Keep Researching \n \n Coronavirus Resources \n \n Face Covering Request \n \n Research Ramp Up \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n University of California, Riverside \n \n 900 University Ave. \n            Riverside, CA 92521 \n Tel: (951) 827-1012 \n \n \n UCR Library \n Campus Status \n Campus Store \n Career Opportunities \n Diversity \n Maps and Directions \n Visit UCR \n \n \n \n \n \n University of California, Riverside \n \n               Environmental Health & Safety \n             900 University Ave.              Riverside, CA 92521              \n  tel: (951) 827-5528                  fax: (951) 827-5122          email:  ehs@ucr.edu   \n \n \n  Find Us \n \n \n \n \n \n \n Related Links \n \n \n Coronavirus Resources & Updates \n \n Customer Service Satisfaction Survey for EH&S \n \n Emergency Management \n \n Fire & Life Safety \n \n Risk & Safety Solutions Web Application Log In \n \n Risk Management \n \n UC Police Department \n \n UC Risk & Safety Training \n \n \n \n \n \n \n \n \n \n \n \n \n \n Privacy Policy \n Terms and Conditions \n © 2021 Regents of the University of California \n \n \n \n \n \n \n \n \n \n \n × \n \n \n \n \n \n \n Let us help you with your search \n \n \n Enter your Search Criteria. \n \n \n \n Search All UCR \n \n \n Search This Site \n \n \n Cancel \n \n \n \n \n \n \n \n \n \n \n \n \n"
}