{
    "docno": "RJP145",
    "url": "https://datadryad.org/stash/submission_process",
    "text": "\n \n Dryad Submission Process \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Skip to main content \n \n \n \n \n \n   \n \n \n \n Search Dryad site \n \n \n \n \n Explore Data \n \n \n \n About \n \n Our Mission \n Our Membership \n Join Us \n Our Governance \n Our Team \n Our Advisors \n Our Platform \n \n \n \n \n \n \n \n Help \n \n Submission Process \n Good Data Practices \n Frequently Asked Questions \n \n \n \n \n Login \n \n \n \n \n \n Submission and Publication Process \n \n    Data publishing includes describing and organizing your data in a way that makes it accessible and reusable to\n    researchers. For an overview see our  Quick Start to Data Sharing .\n    Dryad’s process is outlined here, including links to our  Frequently Asked Questions  with\n    information on particular topics and  recommendations for good data practices . If\n    you need further assistance, please contact us at  help@datadryad.org .\n \n Ready to get started?  Log in  and go to \"My Datasets\" to begin your data submission now! \n Login\n\n \n    Dryad requires an  ORCID ID  for login. If you do not have an ORCID, you will have the\n    opportunity to create a free, unique, identifier for yourself at the login page. Dryad uses ORCID so that we can\n    authenticate and identify each individual researcher regardless of your route of entry to Dryad (i.e. through the\n    website, through the API, through a journal integration, etc.). When datasets are published, they should appear in\n    your ORCID profile along with articles and other works.\n \n \n    For institutional members, we require a second form of authentication at login for campus single-sign-on. After you\n    have logged in with your institutional credentials, Dryad ties together your ORCID and institutional affiliation so\n    that you will not have to include this information a second time.\n \n Once you are logged in, within \"My Datasets\" you can begin your submission. \n Uploading your data\n \n    You will first be asked to enter metadata (information about your data). Check out our tips for complete and\n     comprehensive metadata .  When you  upload data files ,\n    ensure that they meet our  file requirements  and are able to be opened, they do not\n    contain sensitive information, and do not have licensing conflicts with  CC0 . Please\n    upload a  README  that describes your data as a .txt file.\n \n \n    If you choose to upload Software which will be triaged and published at Zenodo, we recommend uploading a README specific\n    to the software on page three. For more information about our Zenodo integration check\n    out  our FAQ .\n \n \n    You will have the opportunity for data to be curated and published immediately or if you prefer for data to be private\n    during your peer review process, select  Private for Peer Review  on the “Review and Submit”\n    page.\n \n Dataset Curation\n \n    We will review your data ensuring it meets our  curation requirements . If we have\n    questions we’ll get in touch with you. For more information check out  our FAQ .\n \n Dataset Publication\n \n    Once your dataset has been approved by our curators it will be published and publicly available. We will notify you\n    by email and this email will contain a permanent DOI that can be used to  cite your dataset .\n    If the cost of your dataset is not covered by a journal, your institution, or a country waiver you will\n     receive an invoice . Datasets can be versioned at any time by clicking  \"update\"  on\n    your dataset.\n \n \n \n \n \n \n Privacy Policy \n Accessibility Policy \n Terms of Service \n \n \n  Follow us on Twitter \n  Check out our Blog \n \n \n Copyright (c) 2021 Dryad \n \n \n \n"
}