{
    "docno": "RJP114",
    "url": "https://facilities.ucr.edu/fs-campus-return-support-information",
    "text": "\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n FS Campus Return Support Information | Facilities Services \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Skip to main content \n \n Facilities Services  \n \n \n \n \n \n \n Submit a Service Request \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n UC Riverside \n \n \n \n \n  Facilities Services   \n \n \n \n \n \n \n \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n Home \n \n \n Services \n \n \n Business Operations \n \n \n Client Support Services  \n \n \n Energy & Engineering \n \n \n Environmental & Resource Services \n \n \n Maintenance Services \n \n \n \n \n Fall Return \n \n \n Service Rates \n \n \n Outages \n \n \n Utility Interruption Calendar \n \n \n \n \n Submit Request \n \n \n R'Projects  \n \n \n Contact \n \n \n Leadership \n \n \n \n \n \n \n \n \n \n \n Submit a Service Request \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n FS Campus Return Support Information \n \n \n \n \n \n \n \n \n \n \n \n \n Breadcrumb \n \n \n \n \n \n \n \n \n \n FS Campus Return Support Information \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Resources and news about Facilities Services' return to campus efforts.  \n This page will be updated as additional information becomes available. Please check back often.  \n   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Join Our Waiting List! \nDisinfectant Kits \n Current inventory is sold out, but don't worry, join our waiting list! \n  \n   \n View our Disinfecting Kits \n Order a disinfecting kit today! \n \n \n \n \n \n \n \n \n \n \n \n \n Hand Sanitizer \nOrdering Guide \n Current inventory is sold out, but don't worry, join our waiting list! \n  \n   \n View the Ordering guide here \n Order Hand Sanitizer Today! \n \n \n \n \n \n \n \n \n \n \n \n \n How to Order \nAdditional Disinfecting Supplies  \n Current inventory is sold out, but \ndon't worry, join our waiting list! \n  \n   \n View the Purchasing Guide Here \n \n \n \n \n \n \n \n \n \n \n \n \n Temporary Personal Protection Barrier \n(Plexiglass)Purchasing Guide \n Current inventory is sold out, but don't worry, join our waiting list! \n   \n View the Purchasing Guide Here \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Custodial Cleaning Schedule   \n Facilities Services will continue to provide services to campus buildings based on the schedule below.  \n   \n \n*Cleaning schedules are subject to change. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Cleaning & Disinfecting FAQs  \n If you have questions about the custodial cleaning and disinfecting process within Facilities Services, review our FAQs below.  \n For additional inquiries related to our services, email us at  facilities@ucr.edu .  \n \n \n \n \n \n            How often will the areas in my building be cleaned?     \n \n Please see the Custodial Cleaning Chart above. \n \n \n \n \n            How often will you disinfect high-touch areas?     \n \n Facilities Services is following cleaning guidelines and protocols recommended by EH&S and the Centers for Disease Control and Prevention (CDC). Attention is being given to high touch areas in common areas, restrooms and classrooms. Surfaces include door handles, handrails, push bars, restroom fixtures and classroom furniture. \n \n \n \n \n            What kind of training has your custodial staff received?      \n \n Our custodial staff have been trained on the proper cleaning and disinfecting methods through EH&S' training curriculum, as well as the CDC's Guidelines for Cleaning and Disinfecting:  https://www.cdc.gov/coronavirus/2019-ncov/community/disinfecting-building-facility.html \n \n \n \n \n            Are you using approved disinfectants to prevent the spread of COVID-19?     \n \n Yes, Facilities Services uses chemical disinfectants recommended by EH&S, the CDC and are listed on the EPA's List N, the approved list of products for use against SARS-coV-2, the virus that causes COVID-19.  \n \n \n \n \n            Will you provide hand sanitizing stations?     \n \n Yes, hand sanitizer stations will be provided in all building main entrances and general assignment classrooms when they return to use. Facilities Services and our campus GIS partners have developed a visual map of all sanitizing locations. The map can be found,  here .  \n \n \n \n \n            Is Facilities providing additional cleaning resources to disinfect our own spaces?     \n \n Yes there are two options.  \n Facilities Services is providing a disinfecting kit for use in occupied spaces. This kit will provide an EPA approved, one-step surface disinfectant spray that does not require you to wear PPE and is effective in killing viruses left on a variety of surfaces. See flyer above. Orders can be placed for those currently working on UCR's main campus by clicking,  here . \n Additionally, for information on purchasing disinfectant supplies and other PPE for your department, view the  Disinfectant Supplies Purchasing Guide  above. \n \n \n \n \n            How do I clean a space if someone has informed us they have COVID-19?     \n \n Facilities Services, in partnership with EH&S, has protocols in place for the cleaning and disinfection of areas where there is a suspected or positive COVID-19 case. If you have a suspected case, per campus guidelines, report concerns to your department head and call the UCR COVID Hotline at 1- 844-827-6827 and they will guide callers from there.  \n \n \n \n \n            How can I request cleaning at a higher frequency than the schedule shown above?     \n \n Departments interested in receiving additional cleaning beyond the frequencies listed in the cleaning schedule above can go to the  Facilities Services website  and submit a service request with their department FAU. \n \n \n \n \n \n \n \n \n \n \n \n Campus Events FAQs \n If you have questions about on-campus events or ordering event-related equipment from Facilities Services, review our FAQs below.  \n For additional inquiries related to our services, email us at  facilities@ucr.edu .  \n \n \n \n \n \n            Will you be providing event-related equipment for the 2020 – 2021 Fall Quarter?       \n \n For Fall quarter 2020/2021 no events, particularly those encouraging large crowds, will be taking place on campus. If you have a need for event related equipment such as tents, chairs, etc., email us at   facilities@ucr.edu   with specific details. Our staff will determine how best to assist you while adhering to campus and State COVID-19 physical distancing guidelines. You can also call us weekdays during campus business hours Monday - Friday / 8am - 5pm at (951) 827-4214 .   \n \n \n \n \n \n \n \n \n \n \n \n HVAC Ventilation FAQs \n General COVID-19 infection prevention recommendations should be followed by building occupants regardless of the HVAC functionality. This includes, but is not limited to:  \n Social distancing by remaining 6 feet or further away from other persons.  \n Wearing a face covering while on campus or interacting with others.  \n Following CDC recommendations for handwashing, which includes use of soap and water and washing for 20 seconds.  \n Washing hands after touching commonly touched surfaces such as door knobs, light switches, shared equipment, etc.  \n Not touching your face without first washing your hands.  \n Building occupancy should be reduced to meet safe distancing requirements. Ventilation systems will continue to operate as designed.  \n Maintaining building systems, including HVAC systems, supports safe occupancy on an ongoing basis by ensuring proper ventilation in all occupied spaces.  \n UCR is utilizing California Department of Public Health (CDPH) COVID-19 Industry Guidance for Institutions of Higher Education, Centers for Disease Control and Prevention (CDC), and American Society of Heating, Refrigeration and Air-Conditioning Engineers (ASHRAE) to inform HVAC-related measures on campus.  \n To download a PDF version of these FAQs, click  here .  \n \n \n \n \n \n            What steps will Facilities Services take to reduce risk through building ventilation (HVAC)?     \n \n All campus buildings that are open to the public during normal times are safe environments. Some of our buildings are much older and have some limitations. Our buildings are designed to provide sufficient air changes based on building activities. We are making a special effort to ensure that all buildings have current filter changes. The information below is how HVAC systems are maintained.  \n Expanded Timeframe : To help with airflow, Facilities Services is expanding the length of time outside airflow will circulate throughout each building.  \n Filtration Maintenance : Building filtration systems are well-maintained and have the appropriate level of filters for each building.  \n Air Flow : To accommodate efficient airflow in each building, the most advanced level of filters are being used based on the building's air filtration system capabilities.  \n Building Ventilation \n Strict adherence to the public health posters and other visual cues throughout campus and in buildings will reduce transmission risks. Ventilation systems will continue to operate as designed even through building occupancy will be reduced. This will further reduce the risk of potential airborne transmission. While each individual occupant of a campus building will want to make sure these guidelines are followed, including limited occupancy, it will be very important to ensure that all the other occupants in that building, at least on that same floor, coordinate to ensure the overall density and guidelines are being followed on a collective basis.  \n Transmission Reduction Efforts \n According to the World Health Organization (WHO) and the Centers for Disease Control (CDC), the COVID-19 virus appears to spread human-to-human through respiratory droplets coming from an infected person. Based on public guidance, the key transmission reduction factors include: \n physical distancing, \n limiting occupancy, \n practicing good personal hygiene and \n utilizing face coverings \n As part of the public health guidance, Facilities Services will disinfect high-touch areas including elevators, door handles, common areas and restrooms. We have made disinfecting kits available to departments and hand sanitizing stations are located at the entrance of each building. A map locating sanitizing stations can be reviewed by clicking,  here .  \n \n \n \n \n            How many air changes per hour are in my room?      \n \n Air changes per hour (ACH) is defined as the volume of ventilation air that is supplied and removed from the room every hour. The ventilation air can be through natural or mechanical ventilation systems and helps to remove contaminants from a room. \n The number of air changes per hour in each room in a building can vary throughout campus. \n In general, laboratories are typically supplied with 6-12 air changes per hour, and office areas are typically supplied with 4-8 air changes per hour in accordance with the American Society of Heating, Refrigeration and Air-Conditioning Engineers (ASHRAE) standards. \n The campus is implementing reduced public health occupancy limits for spaces. This will allow for more outside air available per occupant.  \n \n \n \n \n \n            I am concerned about COVID-19 and the air quality in my work area. How do I know my work area has adequate ventilation?     \n \n UCR buildings are typically supplied with a percentage of outside air, either via natural ventilation or mechanical fans, dependent on each building and system. Those systems are maintained to provide ventilation and thermal comfort as designed through the following activities.  \n Filtration Maintenance: Building filtration systems are well maintained and have the appropriate level of filters for each building's mechanical design.  \n HVAC systems are set to maintain appropriate indoor temperatures as much as system designs allow, which minimizes thermal stresses on the body. These systems are optimized to bring in the maximum amount of fresh air feasible while still maintaining recommended indoor temperature ranges. In most cases, laboratory ventilation systems operate continuously with 100% outside air supply that is not recirculated in the building and is exhausted directly to the outside. These systems are already designed to exhaust indoor contaminants effectively.  \n In most cases, exhaust fans in restrooms operate continuously when buildings are occupied. For restroom exhaust fans to work best, it is recommended to avoid opening operable windows in restrooms and keep restroom doors closed (or mostly closed for single restrooms not in use). When possible, keeping conference room doors open can help promote good ventilation. \n Spaces are more limited or no mechanical ventilation will have operable windows left open.  \n A process for reporting critical building HVAC issues on the UCR campus continues to remain the same and in place through the UCR Facilities Services Client Support Services Team. For critical HVAC issues, such as non-operational thermostats or building pressure issues, submit a work order at  https://facilities.ucr.edu/requests . For general inquiries, email us at  facilities@ucr.edu  or call (951) 827-4214 during normal business hours (Mon-Fri 8am -5pm). \n \n \n \n \n \n            What is being done to building HVAC in regards to COVID-19?     \n \n During our normal preventative maintenance, Facilities Services continues to check HVAC systems to ensure that buildings are ready for reoccupation, including but not limited to the following:\n\t Fan systems are functional and operating. \n Central HVAC fan filters are within acceptable operating ranges and replaced as necessary. \n Fan filter racks are inspected for major gaps or damage. \n Occupied/Unoccupied Timeframe: To help with airflow, Facilities Services is ensuring the length of time airflow will circulate throughout each building, starting air handler systems 2 hours prior to normal building occupancy hours and turning off an hour after building occupancy hours. \n Air filter efficiency ratings are selected in accordance with ASHRAE standards based on mechanical capabilities of the system, to provide required fresh air without loss of pressure. MERV 13 or better filters are used whenever possible. \n \n \n \n \n \n \n            Can I turn on a portable air-conditioning unit or fan when it gets too hot? Can I use or purchase a portable air cleaner or air filter for my area?     \n \n Due to air balancing and electrical capacity, we do not allow portable air conditioners, fans or heaters in mechanically ventilated spaces. \n \n \n \n \n            Can the building’s outdoor air ventilation rate be increased?     \n \n Outside air rates are set by the building mechanical design and these rates cannot be increased without adversely affecting air conditioning control. Keep in mind that reduced public health occupancy limits for spaces will allow for more outside air available per occupant without making changes to mechanical systems. \n \n \n \n \n            Can my building’s supply airflow or exhaust airflow be increased or rebalanced?     \n \n Indoor air exchange rates are set by the building mechanical design and these rates cannot be increased without adversely affecting air conditioning control. \n \n \n \n \n            What ventilation is provided in stairwells?     \n \n While some stairwells may have operable windows, stairwells are not provided with mechanical ventilation. \n \n \n \n \n            Can I prop open my classroom, office, laboratory door for better building ventilation?      \n \n No. For fire prevention and life safety reasons, do not prop open: \n Entry doors \n Fire doors \n Laboratory doors \n Security access doors \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n University of California, Riverside \n \n 900 University Ave. \n            Riverside, CA 92521 \n Tel: (951) 827-1012 \n \n \n UCR Library \n Campus Status \n Campus Store \n Career Opportunities \n Diversity \n Maps and Directions \n Visit UCR \n \n \n \n \n \n University of California, Riverside \n \n               3401 Watkins Drive\n             Riverside, CA 92507                          \n  tel: (951) 827-4214                         email:  facilities@ucr.edu   \n \n \n  Find Us \n \n \n \n \n \n \n \n \n \n \n \n \n Privacy Policy \n Terms and Conditions \n © 2021 Regents of the University of California \n \n \n \n \n \n \n \n \n \n \n × \n \n \n \n \n \n \n Let us help you with your search \n \n \n Enter your Search Criteria. \n \n \n \n Search \n \n \n Cancel \n \n \n \n \n \n \n \n \n \n \n \n \n"
}