{
    "docno": "RJP137",
    "url": "https://guides.lib.ucr.edu/c.php?g=291771&p=1943633",
    "text": "\n \n \n \n Data Management Plans - Research Data Management - Research Guides at University of California, Riverside Libraries \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Skip to main content \n \n    It looks like you're using Internet Explorer 11 or older. This website works best with modern browsers such as the latest versions of Chrome, Firefox, Safari, and Edge. If you continue with this browser, you may see unexpected results.\n \n \n \n \n \n \n \n \n \n \n \n UCR Library\n\t\t\t\t\t\t \n \n \n Research Guides\n\t\t\t\t\t\t \n \n \n Research Data Management\n\t\t\t\t\t\t \n \n Data Management Plans\n\t\t\t\t\t \n   \n \n \n \n \n \n \n Search this Guide \n \n Search \n \n \n \n   \n \n \n Research Data Management: Data Management Plans \n \n Data management basics and tools provided by the UC-system. \n \n \n \n \n \n \n \n \n \n Home \n \n \n \n \n Data Management Plans \n \n \n \n \n Funder & Publisher Requirements \n \n \n \n \n Find/Deposit Data \n \n \n \n Toggle Dropdown \n \n \n \n General Repositories and Government Data\n                                    \n                                 \n \n \n at UC and UCR\n                                    \n                                 \n \n \n \n \n Working With Data \n \n \n \n \n Data Services \n \n   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n DMP Resources\n                                 \n \n \n \n \n \n \n Data Management Questions\n\t\t\t\t\t \n Questions to Help Build a Robust Data Management Plan \n \n \n \n \n DMPTool \n Data Management Planning Tool. Sign in using institutional affiliation (Option 1). \n \n more... \n less... \n \n Create, review, and share data management plans that meet institutional and funder requirements.\n\t\t\t\t\t \n \n \n Digital Humanities Data Curation \n DH Data Curation quick reference guide. \n \n more... \n less... \n \n A compilation of articles that address aspects of data curation in the digital humanities.\n\t\t\t\t\t \n \n \n Principles for Engineering Research Data Management \n \n \n more... \n less... \n \n A set of high-level ideals which may underlie any engineering research data management activity.\n\t\t\t\t\t \n \n \n Guidelines for OSTP Data Access Plan \n \n \n more... \n less... \n \n Summary of and guidance for the United States Executive Office of the President's Office of Science and Technology Policy (OSTP) Data Access Plan.\n\t\t\t\t\t \n \n \n ICPSR's Guide to Social Science Data Preparation and Archiving \n \n \n more... \n less... \n \n Provides guidance on creating a data management plan for Social, Behavioral and Economic Sciences including recommended elements.  Includes a sample DMP for depositing data with Inter-university Consortium for Political and Social Research (ICPSR)\n\t\t\t\t\t \n \n \n ICPSR Data Management & Curation Resources \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Writing a Data Management Plan (DMP)\n                                 \n \n \n \n \n A Data Management Plan (DMP) is a written document which commonly includes an overview of the research data which will be produced including the types and size, the organization & documentation, and ownership & reuse of the data.  While creating a plan may initially seem daunting, a good DMP can quickly be seen as an essential step in research.  A good DMP will help you manage your data, meet funder and publisher requirements, and allow others to find and reuse your data if shared. \n These prompts will help you begin to think about what will be in your DMP.  See the  Data Management Questions PDF  for a full list of questions which will help you create a robust DMP.  Always refer to funder requirements for elements required in a DMP.  If you have identified journals in which you intend to publish articles stemming from your research, some of their requ irements will help you complete elements of your DMP. \n \n \n \n \n How will the data be created (type and size) \n How will the research data be documented (metadata and documentation) \n Where will the research data be stored and backed up \n \n during the research  (storage and backup) \n after the research is completed (archiving and preservation) \n \n \n Who will backup the data  (backup) \n Who will have access to the data (security) \n Will the data be shared (share and reuse) \n Will the data be preserved (archiving and preservation) \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n   <<  Previous:  Home Next:  Funder & Publisher Requirements >> \n \n \n \n \n \n \n Last Updated:   Apr 21, 2021 10:01 AM   \n \n URL:   https://guides.lib.ucr.edu/datamanagement   \n \n  Print Page   \n \n \n Login to LibApps   \n \n \n \n \n \n Subjects:  \n General and Multidisciplinary Research \n \n \n Tags:  \n Data ,  Data management ,  reproducible research \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n"
}