{
    "docno": "RJP12",
    "url": "https://www.facebook.com/UCRCompSciEng",
    "text": "\n UCR - Computer Science and Engineering - Home | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home Posts Reviews Photos About Community See more of UCR - Computer Science and Engineering on Facebook Log In or Create New Account See more of UCR - Computer Science and Engineering on Facebook Log In Forgot account? or Create New Account Not Now UCR - Computer Science and Engineering College & University  Community See All 206 people like this 212 people follow this About See All +95 1 827 5639 www.cs.ucr.edu College & University Page Transparency See More Facebook is showing information to help you better understand the purpose of a Page. See actions taken by the people who manage and post content. Page created - August 9, 2018 People 206  likes Related Pages UC Riverside International Affairs College & University Iranian Students of California Community Organization Indian Student Club - Fresno State Community Organization Filipino Martial Arts Club at UCR Organization Underwater Robotics at Berkeley Organization Sigcse Technical Symposium 2021 Science, Technology & Engineering Caltech Seismological Laboratory Science, Technology & Engineering Cutie Hack Interest Our Sweet Nest Landmark & Historical Place Sié Chéou-Kang Center for International Security & Diplomacy School Gamea & Gamea - Branding and Digital Marketing Agency Marketing Agency IDEA Hacks Computer Company FullCycle Investment Management Company Bradán Accountants Accountant Toastmasters Speakeasy 8704 at UCR Nonprofit Organization Saleem & Yapa East Coast Real Estate Real Estate Agent Analytical Space Aerospace Company Center for Long-Term Cybersecurity College & University International Student Union at UCR College & University Rose Hack Event See More triangle-down Pages Businesses Education College & University UCR - Computer Science and Engineering English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 Posts UCR - Computer Science and Engineering June 4 at 10:44 AM  ·  CSE Colloquium: Biresh Kumar Joardar from  Duke University  is giving a talk titled \"Bridging the Gap between Algorithm and Architecture: A Machine learning-based Approach\" on June 4 at 11:00 am on Zoom! UCR - Computer Science and Engineering June 4 at 10:04 AM  ·  Prof. Nael Abu-Ghazaleh received the Doctoral Dissertation Faculty Award which is a campus-wide award to faculty who provide excellent mentorship and support of their graduate students!   https://www1.cs.ucr.edu/…/cse-professor-received-doctoral-d… See All Photos See All See More \n \n \n"
}