{
    "docno": "RJP105",
    "url": "https://ehs.ucr.edu/coronavirus/worksite_specific_plan",
    "text": "\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Work Site Specific COVID-19 Prevention Plan | Environmental Health & Safety \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Skip to main content \n \n Planning Budget & Administration \n \n \n \n \n \n \n Report a Incident, Injury or Safety Concern \n \n \n Report a COVID-19 or Public Health Concern \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n UC Riverside \n \n \n \n \n  Environmental Health & Safety  \n \n \n \n \n \n \n \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n About EH&S \n \n \n Organizational Chart \n \n \n Programs & Policies \n \n \n Staff Directory \n \n \n Who Do I Call? \n \n \n \n \n How Can We Help? \n \n \n Programs & Policies \n \n \n Food Permit Request \n \n \n Hazardous Waste Pick Up \n \n \n Log into Chemicals, INSPECT, LHAT, & WASTe Apps \n \n \n Personal Protective Equipment (PPE) \n \n \n \n \n Programs & Services \n \n \n Training \n \n \n COVID-19 Prevention Training \n \n \n \n \n Report \n \n \n COVID-19 Concern \n \n \n Safety Concern \n \n \n Work Related Injury/Illness \n \n \n \n \n \n \n \n \n \n \n Report a Incident, Injury or Safety Concern \n \n \n Report a COVID-19 or Public Health Concern \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Face Coverings are required while on campus. Staff/Faculty may request a  face covering from EH&S . Students may request a  face covering from The Well . \n \n \n × \n \n \n \n \n \n \n \n \n \n \n Breadcrumb \n \n \n \n \n \n \n \n \n \n Coronavirus \n \n \n Work Site Specific COVID-19 Prevention Plan \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n COVID-19 Work Site Specific Prevention Plan \n Who must complete this plan? \n The state requires that each department with employees working on campus for any length of time (even occasional visits) must complete this plan prior to returning to campus.   This requirement will be in place until all pandemic restrictions have been removed.  This p lan template must be used  when applying  to return to campus for work, either as an individual department, research lab, or campus unit. Units  and individual  departments who continued to work on campus as essential personnel during the pandemic must also submit a plan and receive proper approvals. Please consult with the  Operations and Support Recovery Workgroup  before preparing plans or for additional guidance. \n Create a new plan \n Create a New Plan Instructions  |  Initial Reviewer Guidance \n To Update Existing Plan without Human Subjects Research \n Retrieve and review existing plan. \n Make adjustments as appropriate. \n Review the plan with new personnel and ensure all questions and concerns are addressed. \n Have new personnel acknowledge the plan by signing and dating \n Return updated plan to  ehspublichealth@ucr.edu .  \n For Human Subjects Research \n New IRB Applications or Modifications to Approved UCR IRB application \n Review the  Human Subjects Risk Matrix . \n Create a new Worksite Specific Plan and be sure to complete the Human Subjects Research section. \n Submit new or modified IRB Application to  irb@ucr.edu .  \n No Modifications to Currently IRB-approved Protocols  \n Create or update Worksite Specific Plan. \n No need to seek new IRB approval   \n Approval Types  \n Work Environment Type \n Plan Owner develops the plan (Step 1) \n Routing and Approval (Step 2) \n Required Additional Reviewer* may be routed to others as appropriate (Step 3) \n Final Review Workgroup (Step 4) \n Research/Lab Facility \n Principal Investigator or Lead Faculty \n Department Chair and Dean \n Operations and Support Recovery Workgroup \n None \n Research Centers/Core Facilities \n Center Director \n Dean or VCRED \n Operations and Support Recovery Workgroup \n None \n Indoor Instructional Space (classroom, lab, studio, conference room, etc.) managed by the Registrar or a department \n \n General Assignment Space: Registrar (lead) and Department Chair \n Departmental Space: Department Chair \n \n \n General Assignment Space: Provost \n Departmental Space: Dean \n \n Operations and Support Recovery Workgroup \n None \n Office Space \n \n Staff Office: Supervisor \n Faculty Office: Department Chair \n \n \n Staff Office: Department Head, Dean or VC \n Faculty Office: Dean \n \n Operations and Support Recovery Workgroup \n None \n \n All other work environment types managed by UCR \n *Note some units must abide by specific CDPH guidelines that are beyond the scope of this template. Those units must address all additional requirements. Those units are advised to contact EH&S for consultation prior to submitting their plan including: Athletics, Dining Services, Library, Housing, Recreation Center, Early Childhood Services, Bookstore, Swimming Pools and Spas \n \n Supervisor \n Department Head, Dean or VC \n Operations and Support Recovery Workgroup \n Public Health \n Non-UCR owned or managed locations such as field stations. Complete or demonstrate equivalency from host location. \n Supervisor \n Department Head, Dean or VC \n Copy of host location worksite specific plan must be provided to Operations and Support Recovery Workgroup \n None \n COVID-19 Work Site Specific Plan Review Process \n   \n   \n What steps do I follow?   \n The Plan Owner (supervisor/PI)  must submit a return to campus plan to their respective Dean, VC or unit head for review and acknowledgement. A copy of the plan must be routed to the Operations  Workgroup for review for consistency with state and campus requirements.  The plan document must include the required risk assessment and physical space assessment. The  Operations Continuity  Workgroup will advise on any missing or incomplete submissions and work with the Plan Owner to ensure that all elements of the plan can be executed safely. \n Responsibilities: \n PLAN OWNER:  Plan Owner (Principal Investigator, Department Head) is responsible for completing this plan for their work area and routing it as indicated above for initial approval to return to campus.  Plan Owner must ensure all employees have familiarized themselves with this plan. Plan Owner must ensure that all employees follow the plan as it is outlined. Refusal to follow the plan will be addressed through performance management processes with Human Resources.   \n Obtain approval.   Approval of each Plan must be obtained by the Authorized Official (Dean, Vice Chancellor, or designee).  The Plan must be approved  before  employees are allowed to return to campus.   Some essential departments have continued work on campus or return plans were approved under a prior process.  Those plans will be reviewed, and departments may be asked to complete additional items to ensure compliance with the current requirements. \n Post the Plan.   Approved plans must be posted in a public area assigned to the  department.  \n Implement the Plan.   Take action on the items outlined in the Plan .  All Plan Owners will be responsible for conducting periodic  compliance monitoring  measures such as spot checks of approved spaces to ensure that practices are compliant with the guidelines laid out in this safety plan. \n Update the Plan.    Regularly assess for compliance.   The Plan documents should   be updated when requirements or circumstances change.  Any updates to the Plan must be approved by the Authorizing Official and submitted to  ehspublichealth@ucr.edu . \n UNITS HEADS:  All Unit Heads (VCs, Deans, Chairs) must review the plans when they are received, assess the need to return to campus and ensure the plans are complete and meet the  COVID-19 Prevention Plan  requirements. Units heads must also be prepared to address compliance issues associated with not following approved plans. \n EMPLOYESS: All employees must sign and date this plan.   Electronic signature is acceptable. \n Employees must familiarize themselves with this plan and routinely follow the COVID-19 prevention plan procedures.  \n OPERATIONS CONTINUITY WORKGROUP  is responsible for providing consultation and verifying the completeness of plans as they are received. The workgroup is also responsible for collecting copies of each plan and distributing the plan to additional review groups or departments including but not limited to Facilities Services, HR, Compliance and the Registrar's office. EH&S may also conduct spot checks of spaces. The operations group is responsible for centrally tracking all plans for the campus. For questions and concerns related to the completion of the Plan, please contact the  Operations Continuity Workgroup . \n Webinar \n View Recording \n Campus Planning Framework \n View the current Campus Planning Framework \n Worksite Specific Plan  Frequently Asked Questions  (FAQ) \n Requirement:  E ach department/Supervisor with employees working on campus for any length of time (even occasional visits) must complete this plan prior to returning to campus. \n What is the Worksite Specific Plan? \n\tThe Worksite Specific Plan is a document based on comprehensive risk assessment of the worksite and supervisors must outline how they will implement coronavirus prevention in accordance to the CDPH/CalOSHA Institutions of Higher Education guidance. \n Is what was submitted in June/July for all research ramp up sufficient or do we need to have the PIs now fill out the new forms? \n\tThe Research Ramp Up plans met the requirements of the campus at that time. However, the Worksite Specific Plan must be completed as soon as possible. Any updates to the plan will require new signatures. \n I would like to get approval to return to campus to conduct research. Do I need to complete both the Research Ramp Up Agreement and the Worksite Specific Plan? \n\tNo. The Worksite Specific Plan provides a comprehensive risk assessment of the worksite and outlines how supervisors will implement coronavirus prevention. \n Are electronic signatures allowed? \n\tYes, electronic signatures will suffice. \n Who needs to sign the plan? \n\tComplete plans and documents must include signatures from all personnel including students, graduate students, post docs, staff, visitors, etc. \n I don't know the square footage of the room. Where can I find that information? \n\tRoom information can be provided by Sharyl Murdock.  \n Do I need to complete the Worksite Specific Plan if I am working remotely at home and don't anticipate to return to campus? \n\tNo. Since you are not physically coming to campus, you do not need to complete the worksite specific plan at this time. Prior to you returning to campus, you will need to complete all the items in the  Return to Work protocols .  \n I manage a core facility and I have my own lab. Do I need to submit separate plans? \n\tYes. Core facilities will need to develop their own plan for their workers in the workspace. The core directors must also ensure that other users (those that are not under their direct chain of command) are aware of the core director's worksite specific assessment/mitigation measures. \n What other requirements do I need to do with the completed and signed plan? \n\tCompleted and signed plans should be posted in the labs. \n Who can I contact if I need help completing the Worksite Specific Plan? Please contact the  Operations Continuity Workgroup . \n Is this only for research activities? No, any workers returning to campus must complete the plan. It is the supervisor's responsibility to complete the plan and have all employees review and acknowledge. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n University of California, Riverside \n \n 900 University Ave. \n            Riverside, CA 92521 \n Tel: (951) 827-1012 \n \n \n UCR Library \n Campus Status \n Campus Store \n Career Opportunities \n Diversity \n Maps and Directions \n Visit UCR \n \n \n \n \n \n University of California, Riverside \n \n               Environmental Health & Safety \n             900 University Ave.              Riverside, CA 92521              \n  tel: (951) 827-5528                  fax: (951) 827-5122          email:  ehs@ucr.edu   \n \n \n  Find Us \n \n \n \n \n \n \n Related Links \n \n \n Coronavirus Resources & Updates \n \n Customer Service Satisfaction Survey for EH&S \n \n Emergency Management \n \n Fire & Life Safety \n \n Risk & Safety Solutions Web Application Log In \n \n Risk Management \n \n UC Police Department \n \n UC Risk & Safety Training \n \n \n \n \n \n \n \n \n \n \n \n \n \n Privacy Policy \n Terms and Conditions \n © 2021 Regents of the University of California \n \n \n \n \n \n \n \n \n \n \n × \n \n \n \n \n \n \n Let us help you with your search \n \n \n Enter your Search Criteria. \n \n \n \n Search All UCR \n \n \n Search This Site \n \n \n Cancel \n \n \n \n \n \n \n \n \n \n \n \n \n"
}