{
    "docno": "RJP160",
    "url": "https://www.localist.com?utm_source=widget&utm_campaign=widget_footer&utm_medium=branded%20link",
    "text": "Localist: Community Event Marketing Automation Platform \n \n \n \n \n \n Features Integrations Solutions Pricing About Request a Demo Pricing About Request a Demo \n \n Grow your organization through the power of community. Localist brings together event management and marketing automation in one place, so you can easily grow and engage your community and make measurable gains in your business goals. How it Works Explore features Event management and marketing in one place. From branding to post-event analysis, Localist combines must-have event management tools, marketing automation and community data in one dashboard. Your community, your voice, your brand No coding required Events build communities, and communities drive growth . Localist isnâ\u0080\u0099t just easy to use. It makes your events more discoverable (automagically), increases attendance and gives you a holistic view of your community. University of Louisville University of Louisville saw an increase in its summer event series attendance by 233%. Travel Portland Travel Portland increased traffic by 800% using Localist Richard Tammar Director of Digital Strategy, Travel Portland â\u0080\u009cLocalist checks all the boxes with its strong data model, customizable fields and taxonomies, decent API, widgets and versatile theming/templating layer. Beyond the product, the customer service is second-to-none. The support team is very highly skilled and quick to respond.â\u0080\u009d Cody Wiseman Marketing Manager, Visit Rapid City â\u0080\u009cI love how user-friendly the platform is. It makes it very simple for me to add, submit, and categorize all of our community events. The EventReach metric is very helpful to ensure that all events reach the maximum number of people.â\u0080\u009d Corey Wright Web Services, Niagara County Community College â\u0080\u009cI love the interface and workflow. Adding and approving events could not be easier to understand. Also, I can't say enough about how responsive the support team is. They really care about their customers and end-user experience.â\u0080\u009d Explore solutions Events build communities, and communities drive growth . Localist isnâ\u0080\u0099t just easy to use. It makes your events more discoverable (automagically), increases attendance and gives you a holistic view of your community. Link event success to organizational growth. Prove the value of your events and their place within your marketing strategy; clear metrics quantify the ROI of events and their power to generate leads, maximize meaningful engagement, and grow your community â\u0080\u0094 online and offline. Localist collects, stores, and displays actionable user behavior and revenue data for your team. Zoom Communication Hubspot Software Salesforce Sales Khoros Software Twitter Social Media Localist connects seamlessly with your existing platforms. We play well with the platforms youâ\u0080\u0099re already using, including community management, member management, video conferencing and more. See all integrations 10m+ Localist-powered events 1b+ Attendees 65m+ Impressions per month Over 10 years of powering 10+ million events around the world. Marketing Features Event Listings Registration and Ticketing Digital Promotion Event Performance Branding Features Branding and Design Landing Pages Extras Support Bold Training FAQ Resources Support Documentation API Company Blog Careers Contact Us Looking for a better way to manage and market your events? Contact Us (443) 451-3000 Â© 2021 Localist. All Rights Reserved.  Legal Terms \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n"
}