{
    "docno": "RJP227",
    "url": "https://wrc.ucr.edu/faq",
    "text": "\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n FAQs | Women's Resource Center (WRC)| UC Riverside \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Due to the impact of COVID-19, our Ethnic & Gender campus locations are closed until further notice. Our staff is working remotely and available to support you along your Highlander journey. We look forward to being back on campus and supporting you in-person. Please continue to wash your hands, wear a face covering, and maintain physical distance. \n \n \n × \n \n \n \n \n \n \n \n \n \n \n \n \n \n Skip to main content \n \n University of California, Riverside \n \n \n \n \n \n \n A to Z Listing \n \n \n Campus Map \n \n \n Find People \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n UC Riverside \n \n \n \n \n  Women's Resource Center  \n \n \n \n WE LISTEN. WE SUPPORT. WE EMPOWER. \n \n \n \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n Home \n \n \n Who We Are \n \n \n Our Promise \n \n \n Our Staff \n \n \n Our History \n \n \n Our Partners \n \n \n FAQ \n \n \n \n \n Programs \n \n \n Campus Safety Escort Service \n \n \n R'kids \n \n \n \n \n Events \n \n \n Get Involved \n \n \n Get Help \n \n \n Contact Us \n \n \n \n \n \n \n \n \n A to Z Listing \n \n \n Campus Map \n \n \n Find People \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Breadcrumb \n \n \n \n \n \n \n \n \n \n FAQ \n \n \n \n \n \n \n \n \n FAQ \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n   \n \n \n Here for You \n Learn more about the services that the Women's Resource Center (WRC) provides the UCR community by exploring these frequently asked questions (FAQ). If you’d like more information about the WRC, visit 260 Costo Hall, call (951) 827-3337, or email  wrc@ucr.edu \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n            What exactly does the Women's Resource Center do?     \n \n The WRC provides educational programming, study space and resources, sexual assault and domestic/relationship violence advocacy, leadership opportunities, special events, and safety support services for women and all members of the UCR community. \n \n \n \n \n            Where is the Women's Resource Center located?     \n \n You can find the WRC at: \nUC Riverside \n260 Costo Hall \nRiverside, CA 92521 \n \n \n \n \n            What is the difference between the Women's Resource Center and the Department of Gender and Sexuality Studies?     \n \n The WRC is part of  Student Affairs  and offers educational programming and advocacy, while the  Department of Gender and Sexuality Studies  is an academic department offering academic courses and degrees. Both work to address issues concerning women and gender. \n \n \n \n \n            Is the Women's Resource Center just for women?     \n \n People of all genders are welcome to engage in and access our programs and services. Our open-door policy allows all students to get involved, access resources and support our efforts. \n \n \n \n \n            How can I contribute to the Women's Resource Center's efforts?     \n \n See our  Get Involved  page for the many ways you can contribute, from volunteering your time and talents to informing the center of gender-oriented organizations and events. You can also help the WRC with a tax-deductible gift. Your donation truly makes a difference and the WRC greatly appreciates its friends and supporters.  Donate to WRC \n \n \n \n \n            How can I schedule an appointment to meet with a Women's Resource Center      \n \n To make an appointment or meet with our staff, call (951) 827-3337, email us at  wrc@ucr.edu , or visit our office at 260 Costo Hall and a front-desk staff member will assist you. \n \n \n \n \n            How can I partner with the Women's Resource Center to put on an event or have the center participate in my event?     \n \n The WRC co-sponsors activities with student groups and other organizations as long as it supports the center’s mission. If you want to partner with us on an existing project, or invite us to partner with yours, simply contact us to discuss the possibilities. \n \n \n \n \n            I'm a student in crisis, who do I contact?     \n \n Dial 911 or call the  UC Police Department  at (951) 827-5222 in an emergency. For further crisis support,  contact WRC  or use our  Get Help  page to connect with additional resources. \n \n \n \n \n            What are some of the programs men can help with or use?     \n \n Men can participate in all of our programs and services. Men can also volunteer for the  Campus Safety Escort Service . Because men can be victims of sexual assault and domestic/relationship violence, they should consider the WRC a safe place for getting help. \n \n \n \n \n            Does the Women's Resource Center have jobs or internships?     \n \n We do offer an internship that you can learn more about on our  Get Involved  page. The WRC also hires student workers and volunteers on a yearly basis. \n \n \n \n \n            How can I find out about your upcoming programs and events?     \n \n Find out about all upcoming programs and events on our  Events  page. There you can add our Google calendar to yours. You can also like us on  Facebook  and follow us on  Instagram  to get updates on events. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n University of California, Riverside \n \n 900 University Ave. \n            Riverside, CA 92521 \n Tel: (951) 827-1012 \n \n \n UCR Library \n Campus Status \n Campus Store \n Career Opportunities \n Diversity \n Maps and Directions \n Visit UCR \n \n \n \n \n \n \n \n \n Women's Resource Center \n \n               260 Costo Hall\n             Riverside, CA 92521                          \n  tel: (951) 827-3337                         email:  wrc@ucr.edu   \n \n \n  Find Us \n \n \n \n \n Follow US: \n \n Facebook \n Instagram \n Flickr \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Related Links \n \n \n African Student Programs \n \n Asian Pacific Student Programs \n \n Chicano Student Programs \n \n LGBT Resource Center \n \n Native American Student Programs \n \n Middle Eastern Student Center \n \n Undocumented Student Programs \n \n Women's Resource Center \n \n \n \n \n \n \n \n \n \n \n \n \n \n Privacy Policy \n Terms and Conditions \n © 2021 Regents of the University of California \n \n \n \n \n \n \n \n \n \n \n × \n \n \n \n \n \n \n Let us help you with your search \n \n \n Enter your Search Criteria. \n \n \n \n Search All UCR \n \n \n Search This Site \n \n \n Cancel \n \n \n \n \n \n \n \n \n \n \n \n \n"
}