{
    "docno": "RJP228",
    "url": "https://wrc.ucr.edu/programs/campus-safety-escort-service",
    "text": "\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Campus Safety Escort Service | Programs | Women's Resource Center (WRC) | UCR \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Due to the impact of COVID-19, our Ethnic & Gender campus locations are closed until further notice. Our staff is working remotely and available to support you along your Highlander journey. We look forward to being back on campus and supporting you in-person. Please continue to wash your hands, wear a face covering, and maintain physical distance. \n \n \n × \n \n \n \n \n \n \n \n \n \n \n \n \n \n Skip to main content \n \n University of California, Riverside \n \n \n \n \n \n \n A to Z Listing \n \n \n Campus Map \n \n \n Find People \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n UC Riverside \n \n \n \n \n  Women's Resource Center  \n \n \n \n WE LISTEN. WE SUPPORT. WE EMPOWER. \n \n \n \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n Home \n \n \n Who We Are \n \n \n Our Promise \n \n \n Our Staff \n \n \n Our History \n \n \n Our Partners \n \n \n FAQ \n \n \n \n \n Programs \n \n \n Campus Safety Escort Service \n \n \n R'kids \n \n \n \n \n Events \n \n \n Get Involved \n \n \n Get Help \n \n \n Contact Us \n \n \n \n \n \n \n \n \n A to Z Listing \n \n \n Campus Map \n \n \n Find People \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Breadcrumb \n \n \n \n \n \n \n \n \n \n Campus Safety Escort Service \n \n \n \n \n \n \n \n \n Campus Safety Escort Service \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n   \n   \n The Campus Safety Escort Service (CSES) ensures the safety of UCR’s students, faculty, and staff by accompanying them to their campus destination. \n Request a Campus Safety Escort \n It’s easy to pair up with a trustworthy, professionally trained campus safety escort (CSE). \n Use any of the campus-wide “red phones” labeled “Campus Safety Escort Service” to speak directly to a dispatcher. \n Visit the Information Desk on the first floor of the  Highlander Union Building (HUB)  during operating hours. \n \n \n \n \n \n \n \n Find the Nearest “Red Phone” \n The map below shows you the exact location of every “red phone” that directly connects you to a CSES dispatcher. They are usually located near exits and lobbies of most campus buildings. \n \n \n \n \n \n \n \n \n \n General Safety Tips \n \n \n Do \n Be aware and confident when traveling to your destination; establish eye contact with those passing by. \n If approached by a suspicious individual(s), assert yourself with a loud voice and statement such as, “No, I can't help you!” or “Get away from me!” \n Travel and/or park in occupied and well-lit areas. \n Have your keys in-hand, ready to unlock your housing or vehicle. \n Always check your vehicle before getting in, including the backseat and underneath, as well as the surrounding area. \n Once inside your home or vehicle, lock the doors. \n Familiarize yourself with your neighbors. \n Report any suspicious activity in your neighborhood. \n Leave lights, TVs, or radios on when nobody is home. \n Make sure the lights work around all entrances. \n Close and/or lock windows and doors at all times. \n \n \n Don't \n Take shortcuts through dark, isolated areas. \n Focus on a mobile device or use headphones. \n Hide keys outside of your home. \n Put your address on your key ring. \n Post your location on social media. \n Leave messages on your door indicating your absence and/or return. \n Leave valuables in your room. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Service Hours \n Days:  Sunday–Thursday (Closed Friday and Saturday) Times:  Whenever it gets dark until 11:30 p.m. \n For escort service beyond CSES hours, call the UCR Police at (951) 827-5222. \n Contact CSES \n Office Visit: 260 Costo Hall safetyescort@ucr.edu \n Staff Advisor: Katie Estrella \n(951) 827-3337 katie.estrella@ucr.edu \n Student Coordinators: \n(951) 827-3772 cses_ucr@yahoo.com \n  \n \n \n \n \n \n \n \n \n \n \n Apply To Be a CSES Student Coordinator \n This is a paid, part-time position within the Women’s Resource Center (WRC) for the 2021–22 academic year. \n Supervise volunteer safety escorts, dispatchers, and cart drivers. \n Plan and publicize public events. \n Create promotional materials and new programs. \n And so much more! \n Apply by June 11  \n \n \n \n \n \n \n \n \n \n \n Awards/Accolades \n Under the direction of WRC, CSES has received the Bayless Leadership Award five times since its operation. \n CSES has also been voted the “fifth-most-critical campaign organization” by students during a campus survey. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Frequently Asked Questions (FAQs) \n Explore CSES and the service it offers. For additional questions, contact staff advisor Katie Estrella at  katie.estrella@ucr.edu  or call (951) 827-3337. \n \n \n \n \n \n            How can I be sure that CSES is safe?     \n \n All campus safety escorts go through a background check and interview process. Once hired, they are trained on how to properly escort someone and what to do in dangerous situations. A CSES student coordinator monitors each shift. \n \n \n \n \n            How can I tell the difference between a CSE and a regular UCR student?     \n \n Campus safety escorts are required to wear: \n Bright Yellow Uniform Shirt – A UCR seal is on the front, and “UC Riverside Escort Service” is on the back. \n Photo Identification Badge – Includes a sticker with the current academic quarter and year. \n \n \n \n \n \n            What hours are campus safety escorts available?     \n \n CSES operates Sunday–Thursday, from dark to 11:30 p.m. After 11:30 p.m., you can call the UC Police Department at (951) 827-5222 for an escort. \n \n \n \n \n            Who can use the CSES program?     \n \n The CSES program is available to all UCR students, staff, and faculty. \n \n \n \n \n            Can I be escorted to campus?     \n \n Yes, as long as your starting location is on campus-owned property such as apartments, residence halls, and parking lots. \n \n \n \n \n            Where do you escort to and from?     \n \n Our boundaries cover university properties, including University Village, Stonehaven, and all campus parking lots. \n \n \n \n \n            How do I use the red phones on campus?     \n \n Pick up a nearby red phone and wait for the dispatcher to answer (usually after the second ring). View the map on this page for red phone locations. \n \n \n \n \n            Are CSEs paid?     \n \n CSES is a volunteer-based organization made up of safety escorts, dispatchers, and cart drivers. They are not paid, however, the WRC hires two part-time student coordinators every academic year. If you’re interested in applying for the 2021–22 CSES student coordinator position, visit  UCR Handshake .  The deadline is June 11, 2021 . \n \n \n \n \n            What CSES positions are available?     \n \n Paid and volunteer positions are available for the 2021–22 academic year. \n Paid Positions | Now Accepting Applications \n Two student coordinators are hired every summer for the following academic year. Visit  UCR Handshake  to access the job description and application deadline. \n Timeline \n May 28–June 11  – The application is open. June 18  – Candidates are offered an interview via email. June 29–July 1  – Interviews take place. July 2  – Job offers are emailed to candidates. July 9  – Deadline for candidates to accept or decline the job offer. July 12–30  – Onboarding paperwork must be completed. Aug. 9–13  – Job training takes place. Sept. 13  – Employment begins. \n Volunteer Positions | Applications Open in September 2021 \n Approximately 15–25 volunteers serve as dispatchers, cart drivers, or campus safety escorts each year. Volunteers commit two-hours per week, each quarter — including finals week. No experience needed, and training is provided. \n \n \n \n \n            How many hours are safety escorts required to serve?     \n \n Campus safety escorts are required to serve two hours per week until the end of each quarter, including during finals week. Safety escorts are allowed to serve a maximum of six hours per week. An incentive award is available for volunteers who work an entire quarter without missing any days. \n \n \n \n \n \n \n \n \n \n \n \n History: Established 1974–75 \n Following a campus assault in the seventies, UCR student and Aberdeen-Inverness Hall resident started walking his friends across campus at night to keep them safe. His gesture sparked a movement by fellow students, which eventually developed into today’s CSES. The team’s simple setup of just one telephone and an answering machine has grown into over ten “red phones” spread across campus and a dedicated, professional, and organized team. However, through its growth, the goal has always been the same: keep the campus community safe. \n   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n University of California, Riverside \n \n 900 University Ave. \n            Riverside, CA 92521 \n Tel: (951) 827-1012 \n \n \n UCR Library \n Campus Status \n Campus Store \n Career Opportunities \n Diversity \n Maps and Directions \n Visit UCR \n \n \n \n \n \n \n \n \n Women's Resource Center \n \n               260 Costo Hall\n             Riverside, CA 92521                          \n  tel: (951) 827-3337                         email:  wrc@ucr.edu   \n \n \n  Find Us \n \n \n \n \n Follow US: \n \n Facebook \n Instagram \n Flickr \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Related Links \n \n \n African Student Programs \n \n Asian Pacific Student Programs \n \n Chicano Student Programs \n \n LGBT Resource Center \n \n Native American Student Programs \n \n Middle Eastern Student Center \n \n Undocumented Student Programs \n \n Women's Resource Center \n \n \n \n \n \n \n \n \n \n \n \n \n \n Privacy Policy \n Terms and Conditions \n © 2021 Regents of the University of California \n \n \n \n \n \n \n \n \n \n \n × \n \n \n \n \n \n \n Let us help you with your search \n \n \n Enter your Search Criteria. \n \n \n \n Search All UCR \n \n \n Search This Site \n \n \n Cancel \n \n \n \n \n \n \n \n \n \n \n \n \n"
}