{
    "docno": "RJP225",
    "url": "https://wrc.ucr.edu/who-we-are/our-history",
    "text": "\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Our History | Women's Resource Center (WRC)| UC Riverside \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Due to the impact of COVID-19, our Ethnic & Gender campus locations are closed until further notice. Our staff is working remotely and available to support you along your Highlander journey. We look forward to being back on campus and supporting you in-person. Please continue to wash your hands, wear a face covering, and maintain physical distance. \n \n \n × \n \n \n \n \n \n \n \n \n \n \n \n \n \n Skip to main content \n \n University of California, Riverside \n \n \n \n \n \n \n A to Z Listing \n \n \n Campus Map \n \n \n Find People \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n UC Riverside \n \n \n \n \n  Women's Resource Center  \n \n \n \n WE LISTEN. WE SUPPORT. WE EMPOWER. \n \n \n \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n Home \n \n \n Who We Are \n \n \n Our Promise \n \n \n Our Staff \n \n \n Our History \n \n \n Our Partners \n \n \n FAQ \n \n \n \n \n Programs \n \n \n Campus Safety Escort Service \n \n \n R'kids \n \n \n \n \n Events \n \n \n Get Involved \n \n \n Get Help \n \n \n Contact Us \n \n \n \n \n \n \n \n \n A to Z Listing \n \n \n Campus Map \n \n \n Find People \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Breadcrumb \n \n \n \n \n \n \n \n \n \n Our Promise \n \n \n Our History \n \n \n \n \n \n \n \n \n Our History \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n   \n \n \n \n \n \n \n \n   \n Empowering Students Since 1973 \n Since the day our doors opened, the WRC has not only supported students, but also forwarded the larger, collective goals of equity, safety and empowerment for all women everywhere. Our timeline tells the story. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n            1973     \n \n The Women's Resource Center (WRC) opens its doors in August 1973, serving as an action-oriented women's space providing referrals, educational programs, speakers and services for women that may not have been provided elsewhere on campus. \n The center collaborates with many campus organizations, other universities and the greater community to address issues including welfare and prison reform, LGBT rights and sexual health, including birth control, family planning, sexual harassment and rape. \n \n \n \n \n \n            1974     \n \n Sara Sheehan becomes the first official WRC coordinator. \n The center is moved to the former Commons area behind the HUB. \n The WRC lounge is considered a place of progressive women's politics, a bastion of activism and a location where all women can come together to share poetry, spoken word and feminist readings. \n The center adds self-defense, affirmative-action advocacy and training for women around the \"bureaucracy\" to its agenda. \n The WRC is instrumental in implementing the first rape crisis center at UCR and pushing the university to offer a women's studies major. \n \n \n \n \n \n            1976     \n \n Jane Brown becomes the second WRC coordinator and begins addressing issues of domestic violence, alcoholism, sexuality and LGBT issues. She creates a feminist library, makes great strides for LGBT rights on campus and is involved in the creation of a  Title IX Office  at UCR. \n \n \n \n \n \n            1977     \n \n Two years after its creation by a group of concerned students, the  Campus Safety Escort Service  moves under the supervision of the WRC. \n \n \n \n \n \n            1978     \n \n When a university administrator proposes eliminating the WRC, the campus community responds with petitions, rallies and protests that ultimately save the center. \n \n \n \n \n \n            1989     \n \n Barbara Paton Gardner becomes the center’s first director. \n The center focuses much of its efforts on rape prevention and community building. \n \n \n \n \n \n            1996     \n \n Dr. Adrienne Sims becomes WRC director. \n \n \n \n \n \n            2003     \n \n The WRC changes its name to Gender Education and Resource Services (GEARS). \n \n \n \n \n \n            2005     \n \n Students successfully lobby to change the center's name back to the Women's Resource Center. \n \n \n \n \n \n            2010     \n \n The WRC founded the  Leadership Community for Women Club  (TLC Club) as part of the Leadership Community for Women initiative. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n            2011     \n \n Dr. Sims initiates UCR’s first institutional membership with the  American Association of University Women . \n \n \n \n \n \n            2012     \n \n The WRC founds peer mentor program  SAVE  (Sexual Assault and Violence Education). \n \n \n \n \n \n            2013     \n \n The WRC broadens its internship base, adding internships through The Leadership Community for Women Club and SAVE. \n The center launches the   Scotty Cubs and Parents   support group and creates the student parent assistant position to coordinate family-friendly events. \n The center develops the Resources and Research in Genders Initiative (RReGI), a bridge between the Women’s Resource Center and   Department of Women’s Studies   that enhances and connects communities and initiatives around gender. \n The center establishes the campus’s first student lactation station so students have a relaxing, secure space they can use at-will to express milk or breastfeed. \n \n \n \n \n \n            2014     \n \n Dr. Sims retires after 20 years of service at the WRC. \n \n \n \n \n \n            2015     \n \n Felicia Salinas-Moniz becomes WRC director. \n The WRC hosts the first family graduation. \n \n \n \n \n \n            2016     \n \n Denise Davis becomes WRC director. \n Romanie Arterberry, student life and development specialist, marks 25 years of service in the WRC. \n \n \n \n \n \n            2017     \n \n WRC's first-ever  Persist: Women's Political Engagement Conference \n \n \n \n \n \n            2018     \n \n Nathaly Martinez leaves the position of WRC Program Coordinator, after three years, to pursue a Masters of Education at Harvard. \n \n \n \n \n \n            2019     \n \n The WRC co-sponsored the first-ever \"State of Women in the Inland Empire Report\" with UCR's Center for Social Innovation and The Women's Foundation of California.  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Special thanks to Karla Aguilar for her invaluable research! \nSource:  Special Collections and University Archives, Tomás Rivera Library \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n University of California, Riverside \n \n 900 University Ave. \n            Riverside, CA 92521 \n Tel: (951) 827-1012 \n \n \n UCR Library \n Campus Status \n Campus Store \n Career Opportunities \n Diversity \n Maps and Directions \n Visit UCR \n \n \n \n \n \n \n \n \n Women's Resource Center \n \n               260 Costo Hall\n             Riverside, CA 92521                          \n  tel: (951) 827-3337                         email:  wrc@ucr.edu   \n \n \n  Find Us \n \n \n \n \n Follow US: \n \n Facebook \n Instagram \n Flickr \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Related Links \n \n \n African Student Programs \n \n Asian Pacific Student Programs \n \n Chicano Student Programs \n \n LGBT Resource Center \n \n Native American Student Programs \n \n Middle Eastern Student Center \n \n Undocumented Student Programs \n \n Women's Resource Center \n \n \n \n \n \n \n \n \n \n \n \n \n \n Privacy Policy \n Terms and Conditions \n © 2021 Regents of the University of California \n \n \n \n \n \n \n \n \n \n \n × \n \n \n \n \n \n \n Let us help you with your search \n \n \n Enter your Search Criteria. \n \n \n \n Search All UCR \n \n \n Search This Site \n \n \n Cancel \n \n \n \n \n \n \n \n \n \n \n \n \n"
}