{
    "docno": "RJP24",
    "url": "http://library.ucr.edu/using-the-library/covid-19",
    "text": "  \n \n \n \n \n \n \n Library Resources & Services for Remote Users | UCR Library \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Ask Us \n Hours \n My Accounts \n Connect From Off-Campus \n Comments? \n Donate now \n   \n \n \n \n \n \n \n \n \n \n \n \n \n \n   \n \n \n   \n \n \n \n \n \n \n \n \n \n \n \n \n Using the Library Borrow, Renew, Return Borrowing & Renewing \n Returning \n Borrowing Course Reserves \n Electronic Document Delivery \n Paging Service \n Fines & Fees \n Appeal Your Bills \n \n Getting a Library Card \n Borrowing Privileges \n Technology & Equipment Print, Copy, Scan \n Equipment \n Software on Public Computers \n Wireless Access \n Connect from Off-Campus \n \n Study Spaces \n Interlibrary Loan How to Use My ILL Requests \n Institutional Lending \n \n Disability Services \n Resources for Remote Users \n \n Research Support Getting Started Learn About Research Fundamentals \n How Do I Find? Articles & Journals \n Books &  E-books \n Course Reserves \n Dissertations & Theses \n Film & Video \n Government Info \n Images & Photos \n K-12 Curriculum Materials \n Learning Resources Display Center \n Maps & GIS \n Microforms \n Music & Scores \n Newspapers \n Patents & Trademarks \n Primary Sources \n Research Guides \n Standardized Test Preparations \n \n Ask Us \n \n Finding and Evaluating Information Search Library Databases \n Browse Disciplinary Subject Guides \n Patent & Trademark Services \n \n Data Services Find Data \n Manage Your Data \n Share Your Data (Dryad) \n \n Publishing and Sharing Research Share Your Publications \n Author Rights & Copyright \n Manage Your Scholarly Identity \n \n Grant Support \n Creating Digital Projects Support for Digital Scholarship \n Using Digital Tools for Research \n \n Geospatial Mapping \n Making and Innovation Creat'R Lab Makerspace \n Maker Services and Programs \n \n Workshops & Events \n \n Collections Collection Strategists \n Databases \n Suggest a Book \n \n Instructional Support Library Instruction Sessions \n Put Materials on Course Reserves \n Affordable Course Materials Initiative \n Copyright & Teaching \n Teaching with R'Stuff \n \n Libraries Tomás Rivera Library Rivera Library Floor Maps \n Collections \n Equipment \n History \n Study Spaces \n \n Orbach Science Library Orbach Science Library Floor Maps \n Collections \n Equipment \n History \n Study Spaces \n \n Music Library \n Special Collections & University Archives Appointments \n Collections \n Request Materials \n Policies \n Staff \n Study Spaces \n Research Guides \n Workshops & Events \n \n \n About Hours \n Directory Departments & Services \n Staff \n \n News \n Publications Newsletters \n Strategic Plan \n \n Exhibits \n Workshops & Events \n FAQs \n Policies \n Jobs \n Directions, Parking, Mailing Address \n Giving to the Library \n Service Notifications \n \n \n \n \n \n \n \n \n \n You are here Home  /  Using the Library  /  Library Resources & Services for Remote Users \n \n \n \n \n \n \n \n \n \n \n Library Resources & Services for Remote Users \n \n \n \n \n \n \n \n UCR Library is online and ready to help you! Library buildings remain closed, with the exception of  Contact-Free Curbside Delivery. \n \n \n Ask a Librarian \n \n   \n Ask a Librarian \n When in doubt, start by asking a librarian for help!  https://library.ucr.edu/research-services/ask-a-librarian \n \n \n     \n Getting Library Materials \n \n   \n Contact-Free Curbside Delivery \n Starting on June 15, 2020, you can now check out books from the Rivera and Orbach Libraries using our  Contact-Free Curbside Delivery  service. Pick-up will Monday-Friday, 1:00 pm to 4:30 pm at the Rivera Library loading dock. To use this service, submit a  paging request  from the  UCR Catalog  for the books you need. Within 24-72 hours you will receive a notification email that the material is ready to be picked up. Directions, phone number, and other details will be included in the email. You will drive up, call the library staff, and they will bring your books and place them in your trunk. Please have your UCR ID ready to show through the car window. See  Contact-Free Curbside Delivery  for everything you need to know to use the service. \n \n \n     \n \n   \n I don't have a library card/ R'Card yet--how do I get one? \n The R'Card is your library card. If you have not yet received an R'Card, please consult the appropriate website below to find out how to obtain one. During the COVID closure we are only issuing new library privileges to current students, faculty, staff, and alumni. Students:   https://ucrcard.ucr.edu/students Staff, Faculty, and PostDocs:   https://ucrcard.ucr.edu/staff-faculty-postdocs Once an R'Card has been established in the system, the Library should automatically receive your information and will create an account for you within 24 hours. If you are still not able to access your library account after receiving your R'Card, please contact  library_circulation@ucr.edu  for assistance. \n \n \n     \n \n   \n Is there any expanded access to UCR books and other materials during the COVID-19 closure? \n Yes, many publishers and other information providers have made resources temporarily available online. Please see this guide on  Expanded/Free Access during COVID-19 Closure.  Additionally, faculty and students can access electronic copies of many library books and other materials from off-campus locations through the  HathiTrust Emergency Temporary Access Service.  If you need help accessing the HathiTrust content, please see this  news article  on the special access. Depending on the length of this pandemic and our agreements with publishers and other information providers, affected resources may change at any time; additional resources may be added, or previously available resources may be removed. \n \n \n     \n \n   \n How do I access ebooks, databases, online journals from off-campus? \n Use this guide on  Connecting to the Library  to learn how to access library resources (ebooks, databases, online journals, etc.) from off campus. \n \n \n     \n \n   \n What materials can I request via ILL during the closure? \n ILL staff are working remotely to fill electronic requests when possible.  We are unable to process or receive physical items, including books, DVDs, and microfilm. We are currently processing requests for journal articles as well as other limited material that can be borrowed digitally.  ILL of physical materials will only resume when mail and courier delivery services at UCR and other UC campuses are back in full operation. Unfortunately at this point, we cannot predict when that will be. \n \n \n     \n \n   \n How long will it take to receive electronic items via ILL? \n Our usual quick turnaround time will be impacted due to library closures across the country. We are processing as quickly as possible, but please note there may be delays.  \n \n \n     \n \n   \n Can I request and receive eBooks via ILL? \n Unfortunately, most eBooks cannot be borrowed via ILL.  However, eBooks and digital content  can  be considered for purchase. Please use the  Suggest a Book  form to request an eBook purchase.  \n \n \n     \n \n   \n What do I do about ILL due dates and fines? \n If you have ILL items due, and you are able, you may return items in the drop boxes at either library. However, we are working on arranging automatic renewals for items that are coming due. ILL staff are working hard to extend due dates and suspend recalls and billing to the fullest extent possible. Because some automated billing may happen that is outside of our control, please email ILL staff at   interlib@ucr.edu  with specific inquiries. \n \n \n     \n \n   \n I need a book the library does not own or has only in print format. Can I request an ebook? \n First see if you can find the book you need through a resource that provides  Expanded/Free Access during COVID-19 Closure . You also may use the  Suggest a Book  form if you would like to request a single book. Please reference that you would like an ebook: Ebooks are not necessarily available for all requests. For course-related requests, please submit your request for Library Reserves  here .   For other library material requests, including multiple books/journals/databases, etc., please contact collection strategists for: Arts and Humanities Social Sciences and Area Studies Science, Technology, Engineering, and Mathematics (STEM)   \n \n \n     \n \n   \n What if I have books or other library materials that are due during the closure? \n If you are not able to get to campus to return material, do not worry. We are extending due dates and waiving fines where possible while the library buildings are closed. We are regularly checking and emptying the outdoor book drops.  If you are away from campus and wish to return your material, you do have the option to return materials through the mail, although you will have to pay for the postage. The library address is:  University of California \nRivera Library \n3401 Watkins Dr. \nRiverside, CA 92507 \n \n \n     \n Research and Class Instruction Support \n \n   \n Can I get help from a person for my research paper, class assignment, or other research needs? \n There are multiple ways for you to get assistance remotely. For in-depth support, please fill out our  Consultation Request form . A librarian will be in touch with you within 1 business day to work with you on your question. We can provide support via Zoom, email, or phone. For quicker questions, we encourage you to make use of our 24/7 chat service, available at:  https://library.ucr.edu/research-services/ask-a-librarian . \n \n \n     \n \n   \n Can I still schedule library instruction sessions? \n Yes, please complete the  Library Instruction Request form  as normal. After you submit, a Teaching & Learning librarian will reach out to you to discuss the details of your session. We anticipate being able to fully support online classes, both synchronously and asynchronously. Your course librarian will discuss options with you including Zoom guest lectures, interactive worksheets, and librarian integration into your iLearn site. We may be able to provide limited options for sessions utilizing primary materials from Special Collections and University Archives. Please submit a form with your ideas and we will work with you on possibilities. For classes that will be meeting in-person during the summer and fall 2020 quarters, we will be able to provide library instruction as usual. If you have specific questions about your course, please reach out to  christopher.martone@ucr.edu .​ \n \n \n     \n \n   \n Can I still submit course reserves for my online classes? \n Course Reserve  services will remain operational during Summer 2020.  However, physical material placed on course reserve will be inaccessible to students during the campus closure.   \n \n As of June 15, the Library will have access to our physical materials for scanning (with the exception of materials that are available through the  HathiTrust  Emergency Temporary Access:  https://www.hathitrust.org/ETAS-Description ). Note that there are some copyright limitations regarding the total amount of material from a single book that may be scanned and posted.    \n \n \n   A dditionally , we are working to obtain electronic access to requested material when available.   \n \n Our  Collection Strategists  are available to assist in identifying alternate solutions for material not available electronically.   Please contact our Course Reserves Coordinator,    Joanne Austin , if you have further questions. \n \n \n     \n \n   \n Can I still submit streaming film requests for my online classes? \n The Library course reserves film streaming program will remain operational and accessible during fall 2020.  Films and/or music requests   that we are able to place online   will be available at the start of Summer quarter. Titles will remain active 24/7 until the last day of finals.   The Library staff has access to our physical materials for digitization (following copyright policy). If some titles are   unavailable, we recommend other alternatives be considered. As always, you are encouraged to view the library databases for other media streaming services such as Kanopy and AVON (Academic Video Online):   AVON https://library.ucr.edu/research-services/databases?search=academic+video&subject_specialties=All&popular=All&popular=All&field_type_of_access_value=All&field_trial_value=All   Kanopy https://ucr.kanopy.com/   Please contact our Reserves Streaming Coordinator,   Philip Chiu , if you have any further questions. \n \n \n     \n \n   \n Can I get online help for my research and assignments? \n Yes, we have a number of tutorials  here  on different research topics designed to ensure your research project comes out its best. We also have online  Subject Guides  designed to support both coursework and research. Each guide describes how to access relevant books, articles, specialized resources including databases and other online tools. Each guide provides contact information for librarians who can help you via email, zoom, or in-person if possible. \n \n \n     \n Special Collections & University Archives Access \n \n   \n Is Special Collection and University Archives open to researchers? \n Starting on Tuesday, June 22, 2021, UCR Special Collections and University Archives is offering  limited in-person research appointments  for UC-affiliated students, faculty, and staff. You can also submit a request to have items digitized and electronically delivered to you. Additionally, you can schedule a one-on-one consultation with a librarian by emailing  sandy.enriquez@ucr.edu  or  specialcollections@ucr.edu . Consultations are highly recommended, as librarians can assist you in finding digital surrogates or navigating digital archives for your remote research. \n \n \n     \n \n   \n How can I learn more about Special Collections & University Archives? \n We are developing a series of workshops and resources such as video tutorials and guides (like our  Guide to University Archives at UCR ) to help researchers better navigate our collections. We will also be offering drop-in virtual office hours in the fall quarter, in addition to one-on-one consultations. Please refer to our  website  for more information about upcoming events and new resources. \n \n \n     \n \n   \n Can I check out Special Collections items? \n No, Special Collections items never circulate and cannot be checked out. \n \n \n     \n \n   \n What is the difference between a reproduction order and a digitization order? \n Colloquially, we use the terms interchangeably. However, a reproduction order is typically used to reference a patron-driven request whereas digitization typically refers to an archival-level quality of digital preservation. \n \n \n     \n \n   \n How do I request something be digitized? \n You must create a free account in our  Special Collections Request System . \nYou can then submit a reproduction request and staff will be in contact with you to invoice (for non-UCR affiliates), page count, digitize, and electronically deliver the item. \n \n \n     \n \n   \n Do I have to pay for digital scans? \n While Special Collections is closed to the public UCR-affiliates do not need to pay for scans. During the closure, we will scan up to 200 pages per month per UCR-affiliate for free. Anything above 200 pages will require a consultation with a librarian who can help focus the request. You can schedule a one-on-one consultation with a librarian by emailing  sandy.enriquez@ucr.edu  or  specialcollections@ucr.edu . Non-UCR Affiliates will have to pay standard rates: \n•    $1.00/page for jpg, pdf, or existing tiff. $25/page for new tiffs. \n•    Note: Priority for digital services is currently being given to UCR-affiliates and it may take longer for other requests to be filled. If you are a non-UCR affiliate, a Special Collections staff member will be in contact with you regarding the status of your order. \n•    For more information on reproduction fees and policies please visit our  website . \n \n \n     \n \n   \n Can you digitize entire books? \n No, we cannot digitize entire books. You can remotely meet with a librarian who can help suggest which areas of the book may be most useful. To schedule a one-on-one consultation with a librarian, please email  sandy.enriquez@ucr.edu  or  specialcollections@ucr.edu . You should also check the UCR Library  catalog  to see if the book is available there. If it is, you can request the book via  curbside delivery . \n \n \n     \n \n   \n How long will it take for me to receive my digital request? \n UCR-affiliates are currently given priority for digital requests and then requests from non-UCR affiliates will be filled. \n  Requests are handled in the order received and rush requests are not possible. \n  If the requested materials are of standard size, requests are usually filled within 5-7 business days but could take as long as two weeks. \n  If the requested materials are oversize, they must be scanned in the Orbach Science Library. This can add an additional 1-2 weeks to the processing of the order. \n \n \n \n     \n \n   \n Before I submit a request, can you meet with me via Zoom and show me the items I may want digitized? \n Because of current staffing levels we cannot meet via Zoom to physically show you the item you may want digitized. You can, however, remotely meet with a librarian who can provide more guidance. To schedule a one-on-one consultation with a librarian, please email  sandy.enriquez@ucr.edu  or  specialcollections@ucr.edu . \n \n \n     \n \n   \n What if a collection is unprocessed and there is no finding aid to assist me in making a digitization request? \n You can schedule a remote consultation with a librarian who can assist you in finding pertinent information. You can schedule a one-on-one consultation with a librarian by emailing  sandy.enriquez@ucr.edu  or  specialcollections@ucr.edu . \n \n \n     \n \n   \n How can I contact Special Collections & University Archives? \n You can email us at  specialcollections@ucr.edu or call us at (951) 827-3233. If leaving a voicemail, please be sure to leave both your phone number and an email address we can reach you at. If you have a particular staff member you'd like to reach, please refer to our  website  for individual contact information. \n \n \n     \n General Information \n \n   \n Is the Library open? \n Per mandate from the Riverside County Department of Public Health, all UCR Library facilities (Rivera Library and Orbach Library) closed as of  Monday, March 16, 2020.  Read the  Amended Order of the Heath Officer of the County of Riverside  issued on April 2, 2020. The Library facilities remain closed to the public pending new campus guidance, with the exception of  Contact-Free Curbside Delivery . The Library will continue to offer online services. The Library will regularly evaluate and adjust our operations in response any changes to campus guidance or policy. Campus updates and information regarding COVID-19 are found  here . \n \n \n     \n \n   \n Can I check out a laptop? \n If you have questions about the availability of laptops, please contact bearhelp@ucr.edu or 951-827-IT4U (4848).     \n \n \n     \n \n   \n Where do I find information about COVID-19? \n The  Coronavirus Disease 2019  (COVID-2019) site from the Centers for Disease Control and Prevention is one of the most comprehensive and reliable sources for public health information. For UCR campus-specific guidance and information, see the campus  COVID-19 updates . \n \n \n     \n \n   \n University Archives COVID-19 Collection Call for Materials \n UCR, like many universities, is seeking to document the impact of Covid-19 on the university community. We are actively capturing websites that document the university’s response to Covid-19, as well as collecting campus-wide emails related to the pandemic. In addition to this, University Archives is seeking to collect and preserve materials documenting the experiences of the UCR community (faculty, staff and students) during the COVID-19 pandemic. Our goal is to create an inclusive record of these experiences. To that end, we invite members of the UCR community to submit material documenting their experiences during this time. We are particularly interested in preserving the stories of people from traditionally under-represented groups, however, all UCR community members are welcome to submit their stories. We are accepting a variety of media. Submissions can be in the form of journals, diaries, photographs, videos or other other material. If you have material you wish to submit, please complete this  Google form . Staff from University Archives will follow up with you via email. Please note that by submitting your materials, you are agreeing to make them accessible to researchers using University Archives. \n \n \n     \n Outside Visitors to the Library \n \n   \n I would like to visit the Learning Resources Display Center. Can I make an appointment? \n At this time we are unable to accommodate pre-arranged non-campus-affiliated visitors in the Library, as the library facilities are closed to the public until further notice. If you wish to review the textbooks and curricular materials in the  Learning Resources Display Center , please check  library.ucr.edu  to stay up to date with information on building re-opening. \n \n \n     \n \n   \n I’m a K-12 teacher. Can I schedule a session for my students in the Library? \n At this time, we are unable to accommodate non-campus-affiliated groups in the Library, as the Library facilities are closed until further notice. Please check  library.ucr.edu  to stay up to date with information on building re-opening. \n \n \n     \n \n   \n \n \n \n \n \n \n \n Using The Library \n \n \n Borrow, Renew, Return Borrowing & Renewing \n Returning \n Borrowing Course Reserves \n Electronic Document Delivery \n Paging Service \n Fines & Fees \n Appeal Your Bills \n \n Getting a Library Card \n Borrowing Privileges \n Technology & Equipment Print, Copy, Scan \n Equipment \n Software on Public Computers \n Wireless Access \n Connect from Off-Campus \n \n Study Spaces \n Interlibrary Loan How to Use My ILL Requests \n Institutional Lending \n \n Disability Services \n Resources for Remote Users \n \n \n \n \n \n \n \n \n \n \n \n \n \n Libraries \n \n \n \n \n \n \n \n Tomás Rivera Library   \n \n            (951) 827-3220           \n \n \n \n Orbach Science Library   \n \n            (951) 827-3701           \n \n \n \n Special Collections & University Archives   \n \n            (951) 827-3233           \n \n \n \n \n \n \n \n   \n \n \n \n \n \n \n Quick Links \n \n Student Disability Resource Center \n Directions & Parking \n Campus Safety Escort Services \n Jobs \n Privacy Policy \n \n \n \n \n \n \n \n Follow \n \n Twitter \n Facebook \n YouTube \n Instagram \n Give to the Library \n \n \n \n \n \n \n \n \n \n © 2020 Regents of the University of California \n \n \n \n \n \n \n \n \n \n \n \n Using the Library Borrow, Renew, Return Borrowing & Renewing \n Returning \n Borrowing Course Reserves \n Electronic Document Delivery \n Paging Service \n Fines & Fees \n Appeal Your Bills \n \n Getting a Library Card \n Borrowing Privileges \n Technology & Equipment Print, Copy, Scan \n Equipment \n Software on Public Computers \n Wireless Access \n Connect from Off-Campus \n \n Study Spaces \n Interlibrary Loan How to Use My ILL Requests \n Institutional Lending \n \n Disability Services \n Resources for Remote Users \n \n Research Support Getting Started Learn About Research Fundamentals \n How Do I Find? Articles & Journals \n Books &  E-books \n Course Reserves \n Dissertations & Theses \n Film & Video \n Government Info \n Images & Photos \n K-12 Curriculum Materials \n Learning Resources Display Center \n Maps & GIS \n Microforms \n Music & Scores \n Newspapers \n Patents & Trademarks \n Primary Sources \n Research Guides \n Standardized Test Preparations \n \n Ask Us \n \n Finding and Evaluating Information Search Library Databases \n Browse Disciplinary Subject Guides \n Patent & Trademark Services \n \n Data Services Find Data \n Manage Your Data \n Share Your Data (Dryad) \n \n Publishing and Sharing Research Share Your Publications \n Author Rights & Copyright \n Manage Your Scholarly Identity \n \n Grant Support \n Creating Digital Projects Support for Digital Scholarship \n Using Digital Tools for Research \n \n Geospatial Mapping \n Making and Innovation Creat'R Lab Makerspace \n Maker Services and Programs \n \n Workshops & Events \n \n Collections Collection Strategists \n Databases \n Suggest a Book \n \n Instructional Support Library Instruction Sessions \n Put Materials on Course Reserves \n Affordable Course Materials Initiative \n Copyright & Teaching \n Teaching with R'Stuff \n \n Libraries Tomás Rivera Library Rivera Library Floor Maps \n Collections \n Equipment \n History \n Study Spaces \n \n Orbach Science Library Orbach Science Library Floor Maps \n Collections \n Equipment \n History \n Study Spaces \n \n Music Library \n Special Collections & University Archives Appointments \n Collections \n Request Materials \n Policies \n Staff \n Study Spaces \n Research Guides \n Workshops & Events \n \n \n About Hours \n Directory Departments & Services \n Staff \n \n News \n Publications Newsletters \n Strategic Plan \n \n Exhibits \n Workshops & Events \n FAQs \n Policies \n Jobs \n Directions, Parking, Mailing Address \n Giving to the Library \n Service Notifications \n \n \n \n \n \n \n \n \n \n \n \n"
}