{
    "docno": "RJP229",
    "url": "https://wrc.ucr.edu/programs/r-kids",
    "text": "\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n R'Kids | Programs | Women's Resource Center (WRC)| UC Riverside \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Due to the impact of COVID-19, our Ethnic & Gender campus locations are closed until further notice. Our staff is working remotely and available to support you along your Highlander journey. We look forward to being back on campus and supporting you in-person. Please continue to wash your hands, wear a face covering, and maintain physical distance. \n \n \n × \n \n \n \n \n \n \n \n \n \n \n \n \n \n Skip to main content \n \n University of California, Riverside \n \n \n \n \n \n \n A to Z Listing \n \n \n Campus Map \n \n \n Find People \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n UC Riverside \n \n \n \n \n  Women's Resource Center  \n \n \n \n WE LISTEN. WE SUPPORT. WE EMPOWER. \n \n \n \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n Home \n \n \n Who We Are \n \n \n Our Promise \n \n \n Our Staff \n \n \n Our History \n \n \n Our Partners \n \n \n FAQ \n \n \n \n \n Programs \n \n \n Campus Safety Escort Service \n \n \n R'kids \n \n \n \n \n Events \n \n \n Get Involved \n \n \n Get Help \n \n \n Contact Us \n \n \n \n \n \n \n \n \n A to Z Listing \n \n \n Campus Map \n \n \n Find People \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Breadcrumb \n \n \n \n \n \n \n \n \n \n R'Kids \n \n \n \n \n \n \n \n \n R'Kids \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Previous Next \n \n \n \n \n \n \n Family Fun at UCR \n The Women's Resource Center (WRC) presents R'Kids — a student-led community that creates a family-friendly environment for students, faculty, and staff who have children. We offer monthly open forums and activities where families can discuss experiences, learn from one another, share resources and encouragement, maintain a well-balanced life — and have fun! \n \n \n \n \n \n \n \n Resources \n From childcare, to housing, to transportation, to legal services — nurture the development of your family with these campus programs and accommodations. \n \n \n \n \n \n \n \n \n Child Care \n \n \n \n \n \n            UCR Early Childhood Services     \n \n UCR Early Childhood Services \n333 Watkins Dr. \nRiverside, CA 92507  \nCDC South: (951) 827-3854 \nCDC North: (951) 827-7454 ecs.ucr.edu \n UCR’s Early Childhood Services (ECS) provides a warm and welcoming environment for children between the ages of two months and five years. Here, your child will exercise their mind and body with books, puzzles, computers, art and outdoor play. It's “learning fun” wrapped up in cognitive, social and emotional growth and development. \n All ECS lessons are carefully designed to meet the goals, expectations and policies of the following organizations:  \nCalifornia Department of Education-Child Development Division \nNational Academy of Early Childhood Programs \n Breakfast, lunch and snacks are provided. Vegetarian selections are also available. Priority enrollment is given to the children of UCR students, staff and faculty. \n Community child care options are also available. \n \n \n \n \n            Lactation Rooms     \n \n Lactation Rooms hr.ucr.edu \n UCR offers on-campus locations for breast-feeding mothers: \n Sproul Hall 2113 \n Pierce Hall 2214B \n Skye Hall 338 \n Human Resources, University Village, No. 208, Room A \n Additional restricted-access locations are available to faculty, staff and students assigned to work in the following locations: \n Center to Environmental Research & Technology \n Child Development Center North \n UCOP IntelliCenter \n These rooms are private, comfortable and equipped with a refrigerator, plush seating and sanitary provisions. To get a room key, you need to complete the Lactation Accommodation Program Room Usage and Program Participation Agreement Form. Please submit your form to the Human Resources office: \n Human Resources \n1201 University Ave., No. 208 \nRiverside, CA 92507 \n(951) 827-1434 benefits@ucr.edu \n \n \n \n \n            Scotty Cubs & Parents     \n \n Scotty Cubs & Parents \n Scotty Cubs and Parents is a student-parent run support group with the express purpose of creating a safe space for students with families. Some of the support group topics have included: birthing stories, balancing school, home and baby, parenthood, relationships, academic success, and student life at UCR. \n \n \n \n \n            UCR Family Resource Guide     \n \n Created by a student-parent group, this guide lists campus and community resources available to student-parents, including child care, housing, health and nutrition. \n \n \n \n \n \n \n \n \n \n \n \n Transportation \n \n \n \n \n \n            Transportation & Parking Services (TAPS)     \n \n Transportation & Parking Services (TAPS) \n683 Linden St. \n(951) 827-8277 parking.ucr.edu parking@ucr.edu \n \n \n \n \n            Carpool     \n \n Graduate students and campus employees are eligible for UCR’s carpool program. Applicants must travel together for a minimum of three days a week and share the expense of one parking permit. A complimentary parking permit allotment is given for those days in which participants cannot commute together. Restrictions may apply. \n \n \n \n \n            Cyclists     \n \n UCR provides open bike lanes, storage, and free licensing and registration for bicycles. \nVisit TAPS Monday–Friday, from 8am–4pm to license and register your bike. A complimentary parking permit allotment is given for those days in which participants cannot ride their bike to campus. Restrictions may apply. Registered cyclists can also use the day lockers and shower facilities at the SRC. \n Need bike, scooter or skateboard parts and repairs? Pedals Bike Shop and \"Do-It-Yourself\" Repair Station in Lot 19 is at your service. \n Hours \nAcademic year: Tuesdays and Wednesdays, 10am–4pm \nSummer session: Wednesdays, 10am–4pm \n \n \n \n \n            Drop Off     \n \n UCR graduate students and campus employees are eligible for the Drop Off program. Participants share a ride with drivers who do not work or park on campus. A complimentary parking permit allotment is given for those days in which participants cannot commute with their rideshare partner. \n \n \n \n \n            Emergency Ride Home     \n \n If you have an emergency or need to work late, Emergency Ride Home (ERH) will provide a free overnight vehicle rental. Eligibility extends to graduate students and campus employees already enrolled in the carpool or vanpool program. \n \n \n \n \n            Vanpool     \n \n UCR’s vanpool program pairs local UCR students and campus employees to a nearby departure site. Vanpools travel to and from the UCR campus with at least one certified driver and one certified alternate driver. A complimentary parking permit allotment is given for those days in which participants cannot use the vanpool. Restrictions may apply. \n \n \n \n \n            Walkers     \n \n UCR graduate students and campus employees who live near campus can take part in the walkers program. A complimentary parking permit allotment is given for those days in which participants cannot walk to campus. Restrictions may apply. Registered walkers can also use the day lockers and shower facilities at the SRC. \n \n \n \n \n \n \n \n \n \n \n \n Additional Programs \n \n \n \n \n \n            Cub Club     \n \n Cub Club \nUC Riverside Athletics \n(951) 827-4653 \n Your child can cheer on the NCAA Division I Highlanders Athletics Program as an official Cub Club member. Available to youths through the eighth grade, the $20 annual membership includes:  \n• Free admission to all regular season home athletic events \n• Official Cub Club T-shirt \n• Official Cub Club membership card \n• Exclusive Cub Club VIP events and discounts \n• Birthday card from mascot Scotty Highlander \n• Free tickets to Castle Park \n \n \n \n \n            Financial Aid     \n \n Financial Aid  \nStudent Services Building \nHighlander One Stop Shop (HOSS) \n(951) 827-3878  financialaid.ucr.edu finaid@ucr.edu \n Financial Aid provides scholarships, grants, student expense loans, emergency loan programs and work-study opportunities. \n \n \n \n \n            HighlanderLink     \n \n HighlanderLink highlanderlink.ucr.edu \n HighlanderLink is a database that features over 500 on-campus student organizations. Get involved today and meet other Highlanders with interests just like yours! \n \n \n \n \n            Housing Services      \n \n Housing Services \n3595 Canyon Crest Dr. \n(951) 827-6350 housing.ucr.edu housinginfo@ucr.edu \n Family Housing at Oban is a collection of one- and two-bedroom apartment homes directly adjacent to the UCR campus and near Early Childhood Services. Each apartment is outfitted with a stove, refrigerator, dishwasher and central heating/cooling. Oban features a central laundry facility, community room, state-of-the-art playground and perimeter security gate. Residents enjoy complimentary parking, utilities and WiFi. Oban's Residential Life team offers an extensive family-oriented activities calendar to help build a strong community environment and reduce your family’s need to travel far for family-friendly entertainment. \n Applications are accepted year-round. Early submission is recommended as wait times can exceed one year. \n \n \n \n \n            International Students and Scholars Office     \n \n International Students and Scholars Office \nSkye Hall 321 \n(951) 827-4113 internationalscholars.ucr.edu internationalstudents@ucr.edu \n The International Students and Scholars Office helps international students navigate the visa process, adjust to American culture, practice safety measures and build meaningful relationships. The office also offers leadership and mentoring opportunities through its International Peer Advisor (IPA) and Global Connections Partner Programs. \n \n \n \n \n            Student Recreation Center     \n \n Student Recreation Center \nLinden St. and Lot 25 \n(951) 827-5738 recreation.ucr.edu recinfo@ucr.edu \n Get fit with UCR’s Student Recreation Center (SRC) programs, classes and services. Membership is included in your student fees. The 80,000-square-foot fitness center features these amenities: \n 6,000-square-foot weight room \n 3,000-square-foot cardio areas \n 237,000-gallon swimming pool \n 20-person spa \n Sand volleyball court \n Tennis courts \n Indoor rock climbing and bouldering wall (“The Rock”) \n Indoor jogging track \n Multi-activity court (MAC) gymnasium \n Drop-in basketball, volleyball and badminton \n Fitness lab and massage therapy room \n Demonstration kitchen \n Child care \n The SRC also offers kids' activities classes, including karate and swimming. \n \n \n \n \n            Legal Clinic     \n \n Legal Clinic \nAssociated Students \nHUB 202 \n(951) 827-3621  asucrexchange.ucr.edu/services/legal exchange@ucr.edu \n The Associated Students of UCR (ASUCR)’s Legal Clinic can help students in need of legal services. Staffed by volunteer attorneys from the Riverside County Barristers Association, the Legal Clinic offers free education and self-help services to resolve legal matters. Please note that formal representation is not included. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Thanks to R'Kids, UCR Has:  \n Changing tables installed in most restrooms \n High chairs are available for children at on-campus dining facilities \n Childcare at the Student Recreation Center \n An EBT machine available in the HUB Scotty's convenience store \n \n \n \n \n \n \n \n \n \n \n Awards/Accolades  \n “Outstanding New Student Organization of the Year” (June 2014) \n \n \n \n \n \n \n \n \n \n \n R'Kids is Under the Direction of WRC \n \n   \n   \n Contact R'Kids \n Office: 260 Costo Hall (WRC) \n Hours: Monday-Friday, 8 a.m.-5 p.m. \n Phone: (951) 827-3337 \n Student Coordinator: \nEvelyn Ruiz |  eruiz018@ucr.edu \n       \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n University of California, Riverside \n \n 900 University Ave. \n            Riverside, CA 92521 \n Tel: (951) 827-1012 \n \n \n UCR Library \n Campus Status \n Campus Store \n Career Opportunities \n Diversity \n Maps and Directions \n Visit UCR \n \n \n \n \n \n \n \n \n Women's Resource Center \n \n               260 Costo Hall\n             Riverside, CA 92521                          \n  tel: (951) 827-3337                         email:  wrc@ucr.edu   \n \n \n  Find Us \n \n \n \n \n Follow US: \n \n Facebook \n Instagram \n Flickr \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Related Links \n \n \n African Student Programs \n \n Asian Pacific Student Programs \n \n Chicano Student Programs \n \n LGBT Resource Center \n \n Native American Student Programs \n \n Middle Eastern Student Center \n \n Undocumented Student Programs \n \n Women's Resource Center \n \n \n \n \n \n \n \n \n \n \n \n \n \n Privacy Policy \n Terms and Conditions \n © 2021 Regents of the University of California \n \n \n \n \n \n \n \n \n \n \n × \n \n \n \n \n \n \n Let us help you with your search \n \n \n Enter your Search Criteria. \n \n \n \n Search All UCR \n \n \n Search This Site \n \n \n Cancel \n \n \n \n \n \n \n \n \n \n \n \n \n"
}