{
    "docno": "RJP253",
    "url": "https://commencement.ucr.edu/",
    "text": "\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Commencement 2021 | Celebrate UCR's 67th Commencement \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Skip to main content \n \n University of California, Riverside \n \n \n \n \n Search \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n UC Riverside \n \n \n \n \n  Commencement 2021  \n \n \n \n Celebrate UCR's 67th Commencement \n \n \n \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n Home \n \n \n Schedule \n \n \n Graduation Checklists \n \n \n Tradition & Symbols \n \n \n A Look Back \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Celebrate UCR's 67th Commencement \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Breadcrumb \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Important Deadlines  \n \n \n \n \n \n \n \n \n                \n            Jan 25, 2021    \n             \n \n                \n            Master's and Ph.D. Grad App Deadline for Winter 2021    \n             \n \n \n \n \n \n                \n            Feb 8, 2021    \n             \n \n                \n            Master's and Ph.D. Grad App Available for Spring 2021    \n             \n \n \n \n \n \n                \n            March 1, 2021    \n             \n \n                \n            Bachelor's Grad App Deadline for Spring 2021    \n             \n \n \n \n \n \n                \n            March 16, 2021    \n             \n \n                \n            Master's and Ph.D. Grad App Available for Summer 2021    \n             \n \n \n \n \n \n                \n            April 1, 2021    \n             \n \n                \n            Bachelor's Grad App Available for Summer 2021    \n             \n \n \n \n \n \n                \n            April 22, 2021    \n             \n \n                \n            (Extended) Master's and Ph.D. Grad App Deadline for Spring and Summer 2021    \n             \n \n \n \n \n \n                \n            April 22, 2021    \n             \n \n                \n            (Extended) Bachelor's Grad App Deadline for Summer 2021    \n             \n \n \n \n \n \n                \n            May 5, 2021    \n             \n \n                \n            (Updated) Intent to Participate Form Opens    \n             \n \n \n \n \n \n                \n            May 17, 2021    \n             \n \n                \n            Intent to Participate Deadline to select Name to Be Listed in the commemorative Commencement e-program and your Name to Be Read for your personalized graduate slide and in-person name reading.     \n             \n \n \n \n \n \n                \n            May 27, 2021    \n             \n \n                \n            (Updated) Intent to Participate Deadline to submit your completed form. The form will close at 11:59 p.m.    \n             \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n UCR Class of 2021 Virtual Commencement Ceremonies \n \n \n \n \n UC Riverside Class of 2021, congratulations on your graduation! \n The UC Riverside Class of 2021 Virtual Commencement Ceremonies will begin on Friday, June 11, 2021 at 6:00 p.m. Please see the links below and click on your respective College link to be directed to your Virtual Commencement Ceremony. Once the Virtual Ceremony pages are live at 5:55 p.m., please click the play button on your \"Virtual Commencement Ceremony\" video and get settled in for the program to premiere at 6:00 p.m. Please feel free to click on the \"full screen\" icon at the bottom right corner to watch the program full screen once the video has premiered. \n Graduate Division Hooding Virtual Commencement Ceremony \n School of Business Virtual Commencement Ceremony \n College of Natural and Agricultural Sciences Virtual Commencement Ceremony \n College of Humanities, Arts, and Social Sciences Group 1 Virtual Commencement Ceremony \n College of Humanities, Arts, and Social Sciences Group 2 Virtual Commencement Ceremony \n College of Humanities, Arts, and Social Sciences Group 3 Virtual Commencement Ceremony \n Graduate School of Education Virtual Commencement Ceremony \n School of Public Policy Virtual Commencement Ceremony \n Marlan and Rosemary Bourns College of Engineering Virtual Commencement Ceremony \n \n \n \n \n \n \n \n \n \n \n \n On Wednesday, April 7, 2021 Chancellor Kim A. Wilcox announced that UC Riverside will be holding limited, in-person Commencement activities for the graduating class of 2021 and 2020, consistent with public health guidance, assuming local SARS CoV-2 infection data do not worsen significantly between now and the end of Spring Quarter.  Click here to see the Chancellor's full announcement.  Graduates from the Classes of 2021 and 2020 will be provided the opportunity to sign up for blocks of time to walk cross a stage individually as their name is read, have their photo taken in academic regalia on stage, and exit the opposite side of the venue. This activity will take place Saturday, June 5 and from Saturday, June 12 through Monday, June 14. Please see the full schedule under \"Schedule of Ceremonies\" below. \n Per Chancellor Wilcox's latest announcement on Friday, May 7, 2021, we are pleased to announce that the Chancellor is granting an exception to our current campus policy prohibiting visitors to allow each student to bring  no more than two guests  with them into the venue. Once inside, students will remain at all times with their guests, who will cross the stage with them and join for a professional photograph. These activities will still be livestreamed for family and friends to watch online.  Click here to see the latest Chancellor's announcement made on May 7. \n As previously described, participants will line up with households socially distanced and all individuals wearing face coverings, as required by campus and public health guidelines. To protect the safety and health of fellow students and guests, as well as staff and volunteers who assist with the events, all participants must show proof of COVID-19 vaccination at check-in, with a completed COVID Vaccination Record Card issued by the U.S. Centers for Disease Control and Prevention (CDC).  Unvaccinated individuals  must arrive with a negative result from a SARS CoV-2 PCR test or rapid antigen test, performed no more than 72 hours prior to arriving on campus. \n Consistent with California Department of Public Health guidance anyone who tests positive, is feeling ill, has symptoms of COVID-19, or has potentially been exposed to someone with confirmed or suspected COVID-19, may not attend the graduation event and should follow public health recommendations.  \n Any student or guest traveling or visiting from outside California and who is  not vaccinated  should self-quarantine per  public health guidelines . All travelers who test positive or develop  symptoms of COVID-19  should  isolate  and follow  public health recommendations . \n Any student or guest who is not vaccinated and who has come in contact with anyone with COVID-19 must quarantine per public health guidelines. Any student or guest who has symptoms of COVID-19 on the day of the event will not be able to attend the event, whether vaccinated or not. All attendees are expected to wash hands often or use hand sanitizer per CDC guidelines on the day of the Commencement activity. \n The formal ceremony will remain as a virtual event, with remarks and greetings by university, Academic Senate, alumni, and student leadership delivered as a prerecorded program of approximately 30 minutes and released at the beginning of commencement weekend. Students and their families may watch this at a convenient time and enjoy a tassel-turning or hooding moment with their loved ones at home. \n Students eligible to participate have been e-mailed their Intent to Participate form which confirms that you will be participating in this year's Commencement activities. \n \n \n × \n \n \n \n \n \n \n \n \n Commencement 2021 \n Welcome to the official Website for UC Riverside's 67th Commencement. \n If you are a graduating student, congratulations on your achievement! You have worked hard to get to this point in your life and UC Riverside is honored to have been part of your journey. \n Making this day a memorable occasion for you and your proud family members and friends is very important to UC Riverside, so we have developed this website for everything Commencement.  \n Class of 2020 graduates:   Click here  for more information regarding participation in the Class of 2021 and Class of 2020 in-person graduate recognition and name-reading event. \n  \n \n \n \n \n \n \n Getting Started \n \n \n \n \n            Step 1: Apply to Graduate     \n \n If you are a UC Riverside student who graduated Fall 2020 or are expected to graduate in Winter 2021 or Spring 2021, you are eligible to participate in the Class of 2021 Commencement. If you expect to graduate Summer 2021, you may be approved to participate if you submit your Summer graduation application by the early deadline. \n In order to graduate from UCR, all students must submit a graduation application via R'Web. In addition to this, Bachelor's degree students in CHASS, CNAS, and School of Business must also complete your College graduation application. \n For Advanced degree candidates and Teaching Credential candidates, please complete the appropriate paperwork on time and receive approval from the Graduate Division and Teacher Education Program office. \n For instructions on how to file your graduation application, please visit the  Registrar's Guide to Graduation Website . \n \n \n \n \n            Step 2: Check out our Class of 2021 Commencement checklist to stay on track with the various requirements and deadlines relating to your participation     \n \n Review the  Class of 2021 Commencement checklist  for deadlines relating to the Intent to Participate form, and other important information regarding Commencement participation. \n \n \n \n \n            Step 3: Submit your Intent to Participate form for the Class of 2021 Commencement     \n \n The Intent to Participate form confirms that you will be participating in the Class of 2021 Commencement. The form  will open on Wednesday, May 5, 2021 , and login and instructions will be e-mailed to eligible students that afternoon. \n All eligible graduates may participate in the UCR Class of 2021 Commencement and will have a graduate slide published. If you would like to select how your name is displayed and your name is announced, you must register through the Intent to Participate form beginning Wednesday, May 5, 2021. In addition, you will have the opportunity to upload a photo and add a personal message if desired. \n Please check the  Class of 2021 Commencement checklist  for important deadlines relating to the Intent to Participate form. \n \n \n \n \n            Step 4: Let us know your plans after graduation!     \n \n You've made it to graduation, but what's your next destination?  Tell us your next step now! \n \n \n \n \n \n \n \n \n \n \n \n \n Schedule  \n Tradition & Symbols \n A Look Back \n \n \n \n \n \n   \n Schedule of Virtual Ceremonies \n   \n School of Medicine Virtual Commencement and Hippocratic Oath Ceremony \n Friday, June 4, 2021 at 6:00 p.m.  \nM.D. degree recipients \nLocation: Zoom Webinar Click here for more information. \n Class of 2021 Virtual Commencement Ceremonies by College \n Friday, June 11, 2021 at 6:00 p.m. \n Graduate Division Hooding Ceremony All Ph.D. degree and M.F.A. degree candidates Click here to watch the Graduate Division Hooding Virtual Commencement Ceremony \n School of Business  Master's and Bachelor's degree candidates  Click here to watch the School of Business Virtual Commencement Ceremony \n College of Natural and Agricultural Sciences  Master's and Bachelor's degree candidates Click here to watch the College of Natural and Agricultural Sciences Virtual Commencement Ceremony \n College of Humanities, Arts, and Social Sciences (CHASS) Group 1  Master's and Bachelor's degree candidates in the departments of Anthropology, Economics, History and Political Science Click here to watch the College of Humanities, Arts, and Social Sciences Group 1 Virtual Commencement Ceremony \n College of Humanities, Arts, and Social Sciences (CHASS) Group 2 Master's and Bachelor's degree candidates in the departments of Art, Art History, Asian Studies, Comparative Literature and Foreign Languages, Creative Writing, Dance, English, Ethnic Studies, Gender and Sexuality Studies, Global Studies, Hispanic Studies, Multidisciplinary Studies, Latin American Studies, Liberal Studies, Media and Cultural Studies, Middle East and Islamic Studies, Music, Religious Studies, Southeast Asian Studies, Theatre, Film & Digital Production Click here to watch the College of Humanities, Arts, and Social Sciences Group 2 Virtual Commencement Ceremony \n College of Humanities, Arts, and Social Sciences (CHASS) Group 3 Master's and Bachelor's degree candidates in the departments of Philosophy, Psychology and Sociology Click here to watch the College of Humanities, Arts, and Social Sciences Group 3 Virtual Commencement Ceremony \n Graduate School of Education Master's and Bachelor's degree candidates and Teacher Credential candidates Click here to watch the Graduate School of Education Virtual Commencement Ceremony \n School of Public Policy Master's and Bachelor's degree candidates Click here to watch the School of Public Policy Virtual Commencement Ceremony \n Marlan and Rosemary Bourns College of Engineering Master's and Bachelor's degree candidates Click here to watch the Marlan and Rosemary Bourns College of Engineering Virtual Commencement Ceremony \n  \n Schedule of In-Person Graduate Recognition and Name-Reading Events \n   \n Thursday, June 3, 2021 at 4:00 p.m. \n School of Medicine Photo Op M.D. degree recipients \nLocation: University Theatre Click here for more information. \n Saturday, June 5, 2021 at 10:30 a.m. \n Graduate Division All Ph.D. degree and M.F.A. degree candidates **NOTE: All in-person events will be touch-free, so graduates will not be hooded in-person** \nLocation: University Theatre Click here to watch the Graduate Division in-person event livestream \n Saturday, June 12, 2021 \n School of Business | 9:00 a.m. Master's and Bachelor's degree candidates  \nLocation: Student Recreation Center North, main gymnasium Click here to watch the School of Business in-person event livestream \n College of Natural and Agricultural Sciences  | 4:00 p.m. Master's and Bachelor's degree candidates \nLocation: Student Recreation Center North, main gymnasium Click here to watch the College of Natural and Agricultural Sciences in-person event livestream \n Sunday, June 13, 2021 \n College of Humanities, Arts, and Social Sciences (CHASS) Group 1 | 9:00 a.m. Master's and Bachelor's degree candidates in the departments of Anthropology, Economics, History and Political Science \nLocation: Student Recreation Center North, main gymnasium Click here to watch the College of Humanities, Arts, and Social Sciences (CHASS) Group 1 in-person event livestream \n Graduate School of Education and School of Public Policy | 1:30 p.m. Master's and Bachelor's degree candidates and Teacher Credential candidates \nLocation: Student Recreation Center North, main gymnasium Click here to watch the Graduation School of Education and School of Public Policy in-person event livestream \n Marlan and Rosemary Bourns College of Engineering | 5:00 p.m. Master's and Bachelor's degree candidates \nLocation: Student Recreation Center North, main gymnasium Click here to watch the Marlan and Rosemary Bourns College of Engineering in-person event livestream \n Monday, June 14, 2021 \n College of Humanities, Arts, and Social Sciences (CHASS) Group 2 | 9:00 a.m. Master's and Bachelor's degree candidates in the departments of Art, Art History, Asian Studies, Comparative Literature and Foreign Languages, Creative Writing, Dance, English, Ethnic Studies, Gender and Sexuality Studies, Global Studies, Hispanic Studies, Multidisciplinary Studies, Latin American Studies, Liberal Studies, Media and Cultural Studies, Middle East and Islamic Studies, Music, Religious Studies, Southeast Asian Studies, Theatre, Film & Digital Production ​​​​​​ Location: Student Recreation Center North, main gymnasium Click here to watch the College of Humanities, Arts, and Social Sciences (CHASS) Group 2 in-person event livestream \n College of Humanities, Arts, and Social Sciences (CHASS) Group 3 | 4:00 p.m. Master's and Bachelor's degree candidates in the departments of Philosophy, Psychology and Sociology ​​​​​​ Location: Student Recreation Center North, main gymnasium Click here to watch the College of Humanities, Arts, and Social Sciences (CHASS) Group 3 in-person event livestream \n  \n Schedule of College Virtual Celebrations \n   \n Graduate School of Education Virtual Celebration \n Friday, June 11, 2021 at 4:00 p.m. \nLocation: Zoom  \nStudents have been sent the invitation to register via Zoom. \nGuests can watch the virtual event on YouTube Live  using this link here . \n CNAS Graduation Celebration \n Saturday, June 12, 2021 at 2:00 p.m. \nLocation :  Guests can watch this live  virtual celebration here  or the  CNAS YouTube page .   \nCNAS graduates will be sent a Zoom link for the event. \nAdditional CNAS Departments Graduation Celebration Schedule is  posted here . \n \n \n   \n Tradition & Symbols \n   \n The UCR Pipe Band \n The UCR Pipe Band performs on the campus and surrounding community at formal and informal events, including parades, memorials, highland games, athletic events, alumni events, Chancellor's events and Commencement. The band encompasses a diverse group of musicians and performers offering a wide variety of Celtic music played on bagpipes and drums.  Visit their website to find out more about the UCR Pipe Band. \n The Regalia \n In 1895, American Universities adopted a code for uniformity in academic dress. These codes, handed down from European academic ceremonies, represent different degree levels, field of study, and the institution from which the degree was earned. Each color, worn on tassels, hoods, velvet and satin trimmings, represents a specific educational discipline: \n Arts, Letters, Humanities:  white \n Commerce, Accountancy, Business:  drab \n Economics:  copper \n Education:  light blue \n Engineering:  orange \n Music:  pink \n Philosophy:  dark blue \n Public Administration:  peacock blue \n Medicine:  green \n Science:  golden yellow \n Theology:  scarlet \n Social Work:  citron \n The Seal of the University of California \n   \n The present seal, designed by Tiffany and Company, has been used since 1910. The seal incorporates symbolic icons and phrases that represent the image of the University. Symbols used include: \n The open book, which symbolized the accumulation and dissemination of knowledge. \n The letter \"A\", representing the beginning of wisdom. \n The five-pointed star above the book represents the discovery and sharing of knowledge. \n The University motto, \"Fiat Lux\", or \"Let There be Light\", displayed on a scroll, represents the coming of light and knowledge in to the world. \n The Chancellor's Medal \n   \n The Chancellor's Medal is worn at ceremonial observances as a part of the chancellor's regalia. At the center is the University of California seal. The back of the medal displays the names of the campus' chancellors and year he or she was inaugurated. \n   \n   \n   \n The UC Riverside Mace \n   \n The academic mace, first used in the 14 th  century, is descended from the club of Hercules. The scepter on the mace stands for lawful power and regal authority, and was carried by Zeus, the Greek God of moral law and order. \n Most academic maces take the same general shape. At the top is an ornament placed on a bulbous head; ring-shaped enlargements are found on the shaft; and the base is a round, foliated ornament. \n The UC Riverside Mace was first suggested by Ramon J. Rhine, Chair of the Academic Senate, to represent the dignity and history of the campus. Professor Emeritus George Helmkamp designed and constructed the ceremonial mace, with Eugene L. Ethridge of the Chemistry Department contributing metal work. \n The UC Riverside mace was hand crafted with inlaid woods, with the head and shaft made out of Hawaiian Koa wood. The light inlaid wood is Yellow Fir from Canada, and the dark inlays are Desert Ironwood  collected by Professor Helmkamp throughout Southern California. The mace has ornaments at the top and the base. The base is in the shape of a citrus fruit, representing UCR's Citrus Experiment Station. The top   ornament is the bear of the State of California. Seals of California and the University are mounted on opposite sides of the mace's head. Below the seals are the mottos of California and the University, respectively,   along with the years 1850 (the year California was admitted in to the Union), and 1868 (the year the University of California was founded). \n UC Riverside Alma Mater \n   \n Professor of Music Byron Adams joined the UCR faculty in 1987 and was dismayed to discover that the university did not have a school song. To promote school spirit and engender institutional pride, Adams held  an informal competition for the text of the song and selected the verses written by the late Bob Wild, a beloved physics professor. He then set forth to create \"Hail Fair UCR\". \n \"I sat down one beautiful winter afternoon and, inspired by the hills surrounding the university, the bell tower and the orange groves, composed Hail Fair UCR,\" he said. \"It is meant to be sung in full - every word   and every note - at Commencement and other solemn, and not so solemn, university events.\" \n \n \n   \n A Look Back \n Relive the pageantry and excitement of UCR’s Commencement ceremonies. Watch videos of the keynote and student speakers from each of the ceremonies as well as the remarks from our Chancellor and Deans of the Colleges. \n Commencement 2020 Online Celebrations \n Advanced Degree Graduates and Teacher Credential Online Celebration \n Bachelor's Degree Graduates Online Celebration \n 2019 \n Watch the ceremonies from UCR's 65th Commencement exercises, May 31-June 1 and June 14-17, 2019. \n 2018 \n Watch the ceremonies from UCR's 64th Commencement exercises, June 1 and June 15 - 19, 2018. \n 2017 \n Watch the ceremonies from UCR's 63rd Commencement exercises, June 9 and June 16–19, 2017. \n 2016 \n Watch the ceremonies from UCR's 62nd Commencement exercises, June 10–13, 2016. \n 2015 \n Watch the ceremonies from UCR's 61st Commencement exercises, June 12–15, 2015. \n 2014 \n Watch the ceremonies from UCR's 60th Commencement exercises, June 13–16, 2014. \n 2013 \n Watch the ceremonies from UCR's 59th Commencement exercises, June 14–17, 2013. \n 2012 \n Watch the ceremonies and view photos from UCR's 58th Commencement exercises, June 15–18, 2012. \n 2011 \n Watch the ceremonies and view photos from UCR's 57th Commencement exercises, June 10–13, 2011. \n 2010 \n Watch the ceremonies from UCR's 56th Commencement exercises, June 11-14, 2010 \n \n \n \n \n \n \n \n \n \n \n \n \n Zoom Backgrounds for Celebrations \n \nWe have created UCR Zoom backgrounds that you can use for any Zoom celebrations with your friends and family! Please feel free to download any of our Zoom backgrounds below. \n Zoom Background 1 - Bell Tower \n Zoom Background 2 - Bagpiper  \n Zoom Background 3 - Pipe Band \n Zoom Background 4 - Stage \n \nUCR Class of 2021 Lawn Signs \n \nShow your support for the UCR Class of 2021! Honor your graduate or show support for the Class of 2021 by displaying a custom lawn sing in your yard. Choose one to print at home or send to a local vendor to celebrate our graduating Highlanders! \n Class of 2021 Lawn Sign - 8.5\" x 11\" \n Class of 2021 Lawn Sign - 12\" x 18\" \n Class of 2021 Lawn Signs - 18\" x 24\" \n   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Participant Information \n \n \n \n \n \n \n   \n \n CANDIDATES FOR GRADUATION \n   \n \nIncludes Commencement participation information, and candidate checklists to ensure that all requirements and deadlines are met to participate in Commencement. \n Get Started \n \n \n \n \n \n   \n \n FACULTY PARTICIPATION \n   \n \nInformation for all ladder-rank faculty, adjunct professors, visiting faculty, lecturers, and supervisors of teacher education who wish to join in celebrating the Class of 2021. \n Get Started \n \n \n \n \n \n   \n \n STAFF & VOLUNTEERS \n   \n \nInformation and registration for UCR Commencement staff and volunteers assisting in the administration of the event. \n Get Started \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n University of California, Riverside \n \n 900 University Ave. \n            Riverside, CA 92521 \n Tel: (951) 827-1012 \n \n \n UCR Library \n Campus Status \n Campus Store \n Career Opportunities \n Diversity \n Maps and Directions \n Visit UCR \n \n \n \n \n \n University of California, Riverside \n \n               900 University Ave.\n             Riverside, CA 92521                          \n  tel: (951) 827-3144                         email:  commence@ucr.edu   \n \n \n \n \n \n Follow US: \n \n UCR Commencement Facebook \n UCR Twitter \n UCR YouTube \n UCR Instagram \n \n \n \n \n \n \n \n \n \n \n \n Privacy Policy \n Terms and Conditions \n © 2021 Regents of the University of California \n \n \n \n \n \n \n \n \n \n \n × \n \n \n \n \n \n \n Let us help you with your search \n \n \n Enter your Search Criteria. \n \n \n \n Search \n \n \n Cancel \n \n \n \n \n \n \n \n \n \n \n \n \n"
}