{
    "docno": "RJP282",
    "url": "https://ehs.ucr.edu/coronavirus/students",
    "text": "\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Students | Environmental Health & Safety \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Skip to main content \n \n Planning Budget & Administration \n \n \n \n \n \n \n Report a Incident, Injury or Safety Concern \n \n \n Report a COVID-19 or Public Health Concern \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n UC Riverside \n \n \n \n \n  Environmental Health & Safety  \n \n \n \n \n \n \n \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n About EH&S \n \n \n Organizational Chart \n \n \n Programs & Policies \n \n \n Staff Directory \n \n \n Who Do I Call? \n \n \n \n \n How Can We Help? \n \n \n Programs & Policies \n \n \n Food Permit Request \n \n \n Hazardous Waste Pick Up \n \n \n Log into Chemicals, INSPECT, LHAT, & WASTe Apps \n \n \n Personal Protective Equipment (PPE) \n \n \n \n \n Programs & Services \n \n \n Training \n \n \n COVID-19 Prevention Training \n \n \n \n \n Report \n \n \n COVID-19 Concern \n \n \n Safety Concern \n \n \n Work Related Injury/Illness \n \n \n \n \n \n \n \n \n \n \n Report a Incident, Injury or Safety Concern \n \n \n Report a COVID-19 or Public Health Concern \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Face Coverings are required while on campus. Staff/Faculty may request a  face covering from EH&S . Students may request a  face covering from The Well . \n \n \n × \n \n \n \n \n \n \n \n \n \n \n Breadcrumb \n \n \n \n \n \n \n \n \n \n Coronavirus \n \n \n Students \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Students \n Visit Student affairs for the latest Student information \n Return to Campus \n Before returning to campus, please be aware there will be some changes coming, such as: \n Face Coverings are required \n Physical Distancing of at least 6 feet required  \n COVID-19 Wellness Kits and Masks/Face Coverings: \n Developed by our Health Educators, and with generous contributions from campus partners, these COVID-19 Wellness Kits provide students with the items for well-being usually distributed out of our physical office. The kits contain face coverings, hand sanitizer, condoms, period products, stress ball, sleep kit, and more - all to help support your well-being during these stressful and uncertain times.\n\t Individual students: get your kit at an  R'Pantry appointment . \n Faculty & Student Groups (classrooms, student orgs, res halls): fill out this  Request Form  for bulk Wellness Kits and/or masks  \n Email  thewell@ucr.edu  for additional pick-up options \n \n For more information, visit  The Well . \n Keep Learning \n Undergraduate Education and Student Affairs want to support your success as you continue learning remotely. Learn More:  https://keeplearning.ucr.edu/ \n Student Health Center \n Learn More about changes or impacts to services:   https://studenthealth.ucr.edu/ \n Resources \n Housing COVID-19 Information \n Dining Services COVID-19 Response \n Student Affairs Website \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n            Is UCR cancelling classes?     \n \n All instruction (including but not limited to labs, studios, and directed studies) will be delivered remotely.  \n Select on campus housing and residential dining services remain open and residents can elect to remain on campus if needed. \n To facilitate remote instruction and learning, ITS is identifying solutions for those instructors, teaching assistants, and students who are in  urgent  need of laptops and internet access.  \n \n \n \n \n            Is UCR closing research operations?     \n \n No undergraduate students will be allowed in any on-campus labs or research facilities. \n Many research operations are critical campus functions, and  those deemed critical will be allowed to continue their work on campus , following important social distancing and hygiene measures. Deans and department chairs will be working with principal investigators to determine critical research functions that must continue on campus, with guidance from the Provost and the Vice Chancellor for Research and Economic Development. \n Per UC policies, in no event should researchers take materials other than secure laptops, data storage devices, and other similar devices offsite (e.g., to their homes) to maintain research continuity during a curtailment. All essential research must continue within the confines of appropriate laboratory space. Please exercise extreme care when transporting data storage devices or accessing data remotely and contact  Information Technology Solutions  if you need assistance. If in doubt about these restrictions, please contact the relevant RED office for further assistance. \n \n \n \n \n            Will my tuition or fees change?     \n \n All tuition and fees remain unchanged for enrolled students as instruction will continue. This includes for recreation and Student Services fees. For information about housing and dining contracts, click  here . For information about late fees or course material fees, click  here . \n \n \n \n \n            What do I do if I need access to a computer to take finals?     \n \n For students without home internet service, several companies have announced plans to offer free internet service to students for 60 days. UCR shared this information via email on March 14 ( Remote Network Connectivity Recommendations ).  \n For students with technology, consider helping a friend in need by sharing your device when you don’t need it during finals week. \n Remember to check  https://keeplearning.ucr.edu  for help navigating remote learning environments. This website is being updated regularly.  \n  \n \n \n \n \n            Is there any guidance for Student Employees, TAs, and Research Assistants?     \n \n Please visit:  Human Resources COVID-19 Resource Website  for the most accurate information for staff. \n At this time the University of California has granted use of up to 16 days of paid administrative leave for all employees. Those individuals that do not continue to work either on campus as essential personnel, or remotely, may use this benefit to cover their time away from campus. This paid administrative leave is a single allocation of up to 16 work days at the current FTE level, but these days do not need to be consecutive. \n It is critical that all employees coordinate with their supervisors to verify work assignments and responsibilities.  \n Graduate Research Assistants should consult with their supervisor/PI (who will be carefully coordinating with the appropriate Dean) on their work assignments and also their eligibility for paid administrative leave. For all Staff, TAs and Graduate Research Assistants, the same policy considerations will apply, including the option for up to 16 days of paid administrative leave. \n We expect there will be some on-campus research work continuing even during this closure. TAs should consult with their supervisor particularly how they can fulfill their role when courses are not being taught in person. UCR will provide more details for TAs. We understand that some TAs and Graduate Assistants may have more than one supervisor, for separate appointments, and therefore they will need to check with each appropriate supervisor. \n For employees who are undergraduate students the same policy considerations apply, including the option of up to 16 work days of paid administrative leave (which do not need to be consecutive). Some undergraduate student employees may have their duties impacted by the campus actions relative to the campus “closure” and the elimination of in person class meetings, and UCR will work to provide additional guidance for these individuals. \n   \n \n \n \n \n            I have applied to UC Riverside. When will I be notified of the admission decision?     \n \n Admission decisions are posted on  MyUCR . \nIf you do not see your decision, continue checking. For a full list of questions about admissions and financial aid related FAQs, please visit  this site .  \n \n \n \n \n \n \n \n \n \n \n \n \n Quick Links \n \n \n Campus Return \n \n Hotline \n \n UCR Daily Wellness Check Survey \n \n Human Resources COVID-19 Resources \n \n Student Health Services \n \n Campus Emergency Status \n \n Keep Teaching \n \n Keep Learning \n \n Keep Working \n \n Keep Researching \n \n Coronavirus Resources \n \n Face Covering Request \n \n Research Ramp Up \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Contact Us \n ehsPublicHealth@ucr.edu \n Report a Concern \n \n \n \n Request \n Disinfectant Kit \n Face Covering \n \n \n \n Resources \n Campus Return \n Research   \n Telecommute   \n Travel \n \n \n \n Health \n Daily Wellness Check  survey \n Symptom monitoring and reporting procedures  (SOP) \n Testing ( on-campus  |  off-campus ) \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n University of California, Riverside \n \n 900 University Ave. \n            Riverside, CA 92521 \n Tel: (951) 827-1012 \n \n \n UCR Library \n Campus Status \n Campus Store \n Career Opportunities \n Diversity \n Maps and Directions \n Visit UCR \n \n \n \n \n \n University of California, Riverside \n \n               Environmental Health & Safety \n             900 University Ave.              Riverside, CA 92521              \n  tel: (951) 827-5528                  fax: (951) 827-5122          email:  ehs@ucr.edu   \n \n \n  Find Us \n \n \n \n \n \n \n Related Links \n \n \n Coronavirus Resources & Updates \n \n Customer Service Satisfaction Survey for EH&S \n \n Emergency Management \n \n Fire & Life Safety \n \n Risk & Safety Solutions Web Application Log In \n \n Risk Management \n \n UC Police Department \n \n UC Risk & Safety Training \n \n \n \n \n \n \n \n \n \n \n \n \n \n Privacy Policy \n Terms and Conditions \n © 2021 Regents of the University of California \n \n \n \n \n \n \n \n \n \n \n × \n \n \n \n \n \n \n Let us help you with your search \n \n \n Enter your Search Criteria. \n \n \n \n Search All UCR \n \n \n Search This Site \n \n \n Cancel \n \n \n \n \n \n \n \n \n \n \n \n \n"
}