{
    "docno": "RJP232",
    "url": "https://wrc.ucr.edu/get-help",
    "text": "\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Get Help/Info | Women's Resource Center (WRC)| UC Riverside \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Due to the impact of COVID-19, our Ethnic & Gender campus locations are closed until further notice. Our staff is working remotely and available to support you along your Highlander journey. We look forward to being back on campus and supporting you in-person. Please continue to wash your hands, wear a face covering, and maintain physical distance. \n \n \n × \n \n \n \n \n \n \n \n \n \n \n \n \n \n Skip to main content \n \n University of California, Riverside \n \n \n \n \n \n \n A to Z Listing \n \n \n Campus Map \n \n \n Find People \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n UC Riverside \n \n \n \n \n  Women's Resource Center  \n \n \n \n WE LISTEN. WE SUPPORT. WE EMPOWER. \n \n \n \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n Home \n \n \n Who We Are \n \n \n Our Promise \n \n \n Our Staff \n \n \n Our History \n \n \n Our Partners \n \n \n FAQ \n \n \n \n \n Programs \n \n \n Campus Safety Escort Service \n \n \n R'kids \n \n \n \n \n Events \n \n \n Get Involved \n \n \n Get Help \n \n \n Contact Us \n \n \n \n \n \n \n \n \n A to Z Listing \n \n \n Campus Map \n \n \n Find People \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Breadcrumb \n \n \n \n \n \n \n \n \n \n Get Help \n \n \n \n \n \n \n \n \n Get Help \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Assistance and Support \n The following campus, local, regional and national resources can support and assist you in dealing with a range of issues. Please consult the appropriate resource directly or drop by the Women’s Resource Center and our staff can assist you with referrals. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Campus Life \n \n \n \n \n \n            Financial Aid     \n \n Financial Aid \nHighlander One Stop Shop (HOSS), First Floor \nStudent Services Building \n(951) 827-3878 financialaid.ucr.edu finaid@ucr.edu \n Financial Aid provides scholarships, grants, student expense loans, emergency loan programs and work-study opportunities. \n \n \n \n \n            HighlanderLink     \n \n highlanderlink.ucr.edu \n HighlanderLink is a database that features 400 on-campus student organizations. Get involved today and meet other Highlanders with interests just like yours! \n \n \n \n \n            Housing Services     \n \n Housing Services \n3595 Canyon Crest Dr. \n(951) 827-6350 housing.ucr.edu housinginfo@ucr.edu \n Housing Services manages the residence halls, UCR campus apartments and family housing to create a student-centered environment and complement your university education. \n \n \n \n \n            International Students and Scholars (ISS) Office     \n \n International Students and Scholars Office \nSkye Hall 321 \n(951) 827-4113 international.ucr.edu/students internationalstudents@ucr.edu \n The International Students and Scholars Office helps international students navigate the visa process, adjust to American culture, practice safety measures and build meaningful relationships. The office also offers leadership and mentoring opportunities through its International Peer Advisor (IPA) and Global Connections Partner Programs. \n \n \n \n \n            Student Recreation Center (SRC)     \n \n Student Recreation Center \nLinden St. and Lot 25 \n(951) 827-5738 recreation.ucr.edu recinfo@ucr.edu \n Get fit with UCR’s Student Recreation Center (SRC) programs, classes and services. Membership is included in your student fees. The 80,000-square-foot fitness center features these amenities: \n 6,000-square-foot weight room \n 3,000-square-foot cardio areas \n 237,000-gallon swimming pool \n 20-person spa \n Sand volleyball court \n Tennis courts \n Indoor rock climbing and bouldering wall (“The Rock”) \n Indoor jogging track \n Multi-activity court (MAC) gymnasium \n Drop-in basketball, volleyball and badminton \n Fitness lab and massage therapy room \n Demonstration kitchen \n Child care \n \n \n \n \n \n \n \n \n \n \n \n \n Transportation \n \n \n \n \n \n            Transportation & Parking Services (TAPS)     \n \n Transportation & Parking Services (TAPS) \n683 Linden St. \n(951) 827-8277 parking.ucr.edu parking@ucr.edu \n \n \n \n \n            Carpool     \n \n Graduate students and campus employees are eligible for UCR’s carpool program. Applicants must travel together for a minimum of three days a week and share the expense of one parking permit. A complimentary parking permit allotment is given for those days in which participants cannot commute together. Restrictions may apply. \n \n \n \n \n            Cyclists     \n \n UCR provides open bike lanes, storage, and free licensing and registration for bicycles. \nVisit TAPS Monday–Friday, from 8am–4pm to license and register your bike. A complimentary parking permit allotment is given for those days in which participants cannot ride their bike to campus. Restrictions may apply. Registered cyclists can also use the day lockers and shower facilities at the SRC. \n Need bike, scooter or skateboard parts and repairs? Pedals Bike Shop and \"Do-It-Yourself\" Repair Station in Lot 19 is at your service. \n Hours \nAcademic year: Tuesdays and Wednesdays, 10am–4pm \nSummer session: Wednesdays, 10am–4pm \n \n \n \n \n            Drop Off     \n \n UCR graduate students and campus employees are eligible for the Drop Off program. Participants share a ride with drivers who do not work or park on campus. A complimentary parking permit allotment is given for those days in which participants cannot commute with their rideshare partner. \n \n \n \n \n            Emergency Ride Home     \n \n If you have an emergency or need to work late, Emergency Ride Home (ERH) will provide a free overnight vehicle rental. Eligibility extends to graduate students and campus employees already enrolled in the carpool or vanpool program. \n \n \n \n \n            Vanpool     \n \n UCR’s vanpool program pairs local UCR students and campus employees to a nearby departure site. Vanpools travel to and from the UCR campus with at least one certified driver and one certified alternate driver. A complimentary parking permit allotment is given for those days in which participants cannot use the vanpool. Restrictions may apply. \n \n \n \n \n            Walkers     \n \n UCR graduate students and campus employees who live near campus can take part in the walkers program. A complimentary parking permit allotment is given for those days in which participants cannot walk to campus. Restrictions may apply. Registered walkers can also use the day lockers and shower facilities at the SRC. \n \n \n \n \n \n \n \n \n \n \n \n Community Commuter Services \n \n \n \n \n \n            Bus     \n \n RTA Offices \n1825 Third St. \nP.O. Box 59968 \nRiverside, CA 92517 \n(951) 565-5002 \nTTY: (800) 800-7825 TTY \nCalifornia Relay: (800) 735-2929 riversidetransit.com \n Ride for free with U-Pass and Go-Pass. When you board any RTA bus, simply swipe your R’Card in the fare box and get unlimited travel to work, school, the mall or even the beach. \n \n \n \n \n            Rideshare     \n \n zimride.com/ucriverside \n Zimride is a private rideshare network linking would-be passengers with would-be drivers. Destinations include the UC Riverside campus as well as community events. \n \n \n \n \n            Train     \n \n Metrolink \n(800) 371-LINK (5465) \nSpeech- and hearing-impaired customers: \n(800) 698-4TDD (4833) metrolinktrains.com \n Metrolink provides reliable transportation on five regional lines: \n Riverside – From the downtown Riverside Station, RTA provides CommuterLink Express service to the UCR campus. \n San Bernardino \n Orange County \n Ventura County \n Antelope Valley \n \n \n \n \n \n \n \n \n \n \n \n \n Conduct & Safety \n \n \n \n \n \n            Legal Clinic     \n \n Legal Clinic  \nAssociated Students \nHUB 202 \n(951) 827-3621 asucrexchange.ucr.edu/services/legal exchange@ucr.edu \n The Associated Students of UCR (ASUCR)’s Legal Clinic can help students in need of legal services. Staffed by volunteer attorneys from the Riverside County Barristers Association, the Legal Clinic offers free education and self-help services to resolve legal matters. Please note that formal representation is not included. \n \n \n \n \n            Office of the Ombuds     \n \n Office of the Ombuds \nSkye Hall 390  \n(951) 827-3213  ombudsperson.ucr.edu ombuds@ucr.edu \n The campus ombudsman provides a safe, confidential, impartial and informal place to discuss a concern or complaint; to identify issues, generate options and/or resolve conflicts; and address questions regarding university policies, procedures or regulations. \n \n \n \n \n            Student Conduct & Academic Integrity Programs (SCAIP)     \n \n Student Conduct & Academic Integrity Programs \n111 Costo Hall  \n(951) 827-4208  conduct.ucr.edu   conduct@ucr.edu \n SCAIP supports a respectful, safe community by enforcing student conduct policies (both academic and social). The organization educates students about their rights, holds them accountable for their responsibilities and supports their ethical growth. \n \n \n \n \n            UC Police Department (UCPD)     \n \n UC Police Department  \n3500 Canyon Crest Dr.  \n(951) 827-5222  police.ucr.edu  ucpdgeneralemail@ucr.edu  (not monitored 24 hours a day) \n The UCPD works to enhance the quality of life by providing a secure and safe environment through professional service to the University community. \n \n \n \n \n            Legal Services     \n \n Riverside County Bar Association Lawyer Referral Service   \n4129 Main St., No. 100  \nRiverside, CA 92501 (951) 682-7520  riversidecountybar.com   rcba@riversidecountybar.com \n \nThe Riverside County Bar Association Lawyer Referral Service refers students to attorneys who specialize in the legal branch needed for their case. Consultations are free for personal injury, workers' compensation and social security matters. All other legal matters require a $40 fee. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Assault Support \n \n \n \n \n \n            CARE (Campus Advocacy, Resource & Education)     \n \n CARE (Campus Advocacy, Resource & Education) \n(951) 827-6225 care.ucr.edu advocate@ucr.edu \n CARE advocates anticipate and respond to the needs of students impacted by sexual assault, dating/domestic violence and stalking by providing confidential advocacy and support. The CARE office provides immediate, confidential and supportive crisis intervention and advocacy for ALL survivors. \n \n \n \n \n            Sexual Violence Prevention & Response     \n \n Sexual Violence Prevention & Response \nSkye Hall 349 \n(951) 827-7070 sexualviolence.ucr.edu \n This website, operated by the campus Title IX office, provides information and reporting options around sexual assault, domestic violence, dating violence, stalking and rape. \n \n \n \n \n            Title IX/Sexual Harassment Office     \n \n Title IX/Sexual Harassment Office \nSkye Hall 349 \n(951) 827-7070 titleix.ucr.edu titleix@ucr.edu \n The Title IX/Sexual Harassment Office has the primary responsibility for educating the campus community on sexual harassment and sexual violence; providing ways to prevent sexual harassment and sexual violence; assisting individuals involved in complaints of sexual harassment; assisting victims of sexual assault, domestic violence, dating violence, and stalking; and investigating and resolving complaints of sexual harassment and sexual violence. \n \n \n \n \n            Alternatives to Domestic Violence (ADV)     \n \n Alternatives to Domestic Violence (ADV) \n24/7 Hotline (Riverside): (951) 683-0829 24/7 \n(Countywide): (800) 339-SAFE (7233) alternativestodv.org \n ADV offers services including a 24-hour crisis line, emergency and transitional housing, outreach services to victims of domestic violence, individual and group counseling, life skills and job training, child development services, child and teen counseling, and a range of training programs for legal professionals, first responders and employers in the identification of and response to domestic violence. \n \n \n \n \n            California Coalition Against Sexual Assault (CALCASA)     \n \n California Coalition Against Sexual Assault (CALCASA) \n(916) 446-2520 SMS/Text: (916) 905-2272 calcasa.org \n CALCASA provides leadership, vision and resources to rape crisis centers, individuals and other entities committed to ending sexual violence. \n \n \n \n \n            National Domestic Violence Hotline     \n \n National Domestic Violence Hotline \n24/7 Hotline: (800) 799-7233 \nTTY: (800) 787-3224 thehotline.org \n Operating around the clock, seven days a week, confidential and free of cost, the National Domestic Violence Hotline provides lifesaving tools and immediate support to enable victims to find safety and live lives free of abuse. Callers to The Hotline can expect highly trained, experienced advocates to offer compassionate support, crisis intervention information and referral services in more than 200 languages. \n \n \n \n \n            RAINN (Rape, Abuse & Incest National Network)      \n \n RAINN (Rape, Abuse & Incest National Network) \n24/7 Hotline: (800) 656-HOPE (4673) rainn.org \n RAINN is the nation's largest anti-sexual violence organization. It created and operates the National Sexual Assault Hotline in partnership with more than 1,000 local sexual assault service providers across the country and operates the DoD Safe Helpline for the Department of Defense. RAINN also carries out programs to prevent sexual violence, help victims and ensure that perpetrators are brought to justice. \n \n \n \n \n            Riverside Area Rape Crisis Center      \n \n Riverside Area Rape Crisis Center \n24/7 Hotline: (951) 686-RAPE (7273) or (866) 686-7273 rarcc.org \n Founded in 1973, the Riverside Area Rape Crisis Center is a nonprofit organization that acts as a visible presence and resource for the victims of sexual assault and their families throughout Western Riverside County during a particularly traumatic time in their lives. The services of the Riverside Area Rape Crisis Center are provided free of charge. V-Day: A Global Movement to End Violence Against Women and Girls vday.org Through V-Day campaigns, local volunteers and college students produce annual benefit performances of The Vagina Monologues and A Memory, A Monologue, A Rant and A Prayer to raise awareness and funds for anti-violence groups within their own communities. Each year, thousands of V-Day benefit events take place produced by volunteer activists in the United States and around the world, educating millions of people about the reality of violence against. \n \n \n \n \n            V-Day: A Global Movement to End Violence Against Women and Girls     \n \n vday.org \nThrough V-Day campaigns, local volunteers and college students produce annual benefit performances of  The Vagina Monologues  and  A Memory, A Monologue, A Rant and A Prayer  to raise awareness and funds for anti-violence groups within their own communities. Each year, thousands of V-Day benefit events take place produced by volunteer activists in the United States and around the world, educating millions of people about the reality of violence against women and girls. \n \n \n \n \n \n \n \n \n \n \n \n Health & Wellness \n \n \n \n \n \n            Counseling and Psychological Services (CAPS)     \n \n Counseling and Psychological Services (CAPS) \nVeitch Student Center, North Wing \n(951) 827-5531 \n24/7: (951) UCR-TALK (827-8255) counseling.ucr.edu \n CAPS provides free, confidential psychological services to all registered UCR students. Individual, couple and group counseling sessions are available for students to work on a variety of issues, such as adjustment, relationship problems, depression, anxiety, eating disorders, substance use and abuse, identity development, stress management, and family concerns. Stress management programs include Biofeedback and StressBusters Peer Educators. \n \n \n \n \n            Student Affairs Case Management (SACM)     \n \n Student Affairs Case Management \n125 Costo Hall \n(951) 827-5000 casemanagement.ucr.edu casemanager@ucr.edu \n Case Managers provide support through referrals, linkage, advocacy, problem solving, community resources, support in managing the demands of a UCR student, managing relationships and family demands, meeting academic goals, basic student needs (including housing, food and health care), and making the most of one’s mental and emotional health. \n \n \n \n \n            Student Health Services (SHS)     \n \n Student Health Services \nVeitch Student Center \n(951) 827-3031 studenthealth.ucr.edu health@ucr.edu \n Student Health Services provides affordable, convenient, confidential, high-quality medical care to UCR students. Services include a primary care clinic, in-house medical lab, pharmacy and X-ray services. Specialty clinics include women’s health, travel, dental and psychiatric services. The Student Health Center’s Preventative Care Clinic promotes healthy lifestyles through on-campus activities and one-on-one consultations to help you stay well. \n \n \n \n \n            Student Disability Resource Center (SDRC)     \n \n Student Disability Resource Center (SDRC) \n125 Costo Hall \n(951) 827-3861 sdrc.ucr.edu specserv@ucr.edu \n SDRC works to ensure that students with disabilities have equal access to educational programs and can fully participant in all aspects of campus life. \n \n \n \n \n            The Well     \n \n The Well \nHUB 248 \n(951) 827-9355 well.ucr.edu thewellevents@gmail.com \n Home to all things health and wellness, The WELL promotes health and wellness for UCR undergraduate and graduate students, and works to support student success, both in and out of the classroom. \n \n \n \n \n            R'Pantry     \n \n R'Pantry \nThe WELL: (951) 827-9355 rpantry.ucr.edu rpantry@ucr.edu \n UCR and the local community have a number of emergency food assistance resources and programs to help put food on your table, including R'Pantry, which is managed by The WELL and provides emergency non-perishable food, personal hygiene, household care and child care items for students in need. Hours of operation vary per quarter. \n \n \n \n \n            Grad Student R'Pantry     \n \n Grad Student R'Pantry \nGradSuccess at UOB 141 rpantry@ucr.edu gsrc@ucr.edu \n Graduate students in need can get emergency food, personal hygiene, household care and child care items at this location as well as the original R'Pantry location. Hours of operation vary per quarter. \n \n \n \n \n            National Suicide Prevention Lifeline     \n \n National Suicide Prevention Lifeline \n24/7: (800) 273-TALK (8255) \nTTY (24/7): (800) 799-4889 suicidepreventionlifeline.org \n The National Suicide Prevention Lifeline provides free and confidential emotional support to people in suicidal crisis or emotional distress 24 hours a day, seven days a week, across the United States. The Lifeline is comprised of a national network of over 160 local crisis centers, combining custom local care and resources with national standards and best practices. \n \n \n \n \n            Utility Assistance     \n \n Utility Assistance \nCounty of Riverside Community Action Partnership \n2038 Iowa Ave., Ste. B-102 \nRiverside, CA 92507 \n(851) 955-4900 or (800) 511-1110 \nTTY: (951) 955-5126 capriverside.org/program/utilityassistanceprogram info@capriverside.org \n If you can't make your utility payment, CAP can help with two one-time assistance programs. Eligibility is determined by household income, priority points and energy burden. \n • Sharing Households Assist Riverside’s Energy (SHARE) – SHARE pays one bill per year for qualified Riverside Public Utility customers. \n• Low-Income Home Energy Assistance Program (LIHEAP) – This federally funded program pays for the gas, electric, wood, oil or propane usage for qualifying residents. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n University of California, Riverside \n \n 900 University Ave. \n            Riverside, CA 92521 \n Tel: (951) 827-1012 \n \n \n UCR Library \n Campus Status \n Campus Store \n Career Opportunities \n Diversity \n Maps and Directions \n Visit UCR \n \n \n \n \n \n \n \n \n Women's Resource Center \n \n               260 Costo Hall\n             Riverside, CA 92521                          \n  tel: (951) 827-3337                         email:  wrc@ucr.edu   \n \n \n  Find Us \n \n \n \n \n Follow US: \n \n Facebook \n Instagram \n Flickr \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Related Links \n \n \n African Student Programs \n \n Asian Pacific Student Programs \n \n Chicano Student Programs \n \n LGBT Resource Center \n \n Native American Student Programs \n \n Middle Eastern Student Center \n \n Undocumented Student Programs \n \n Women's Resource Center \n \n \n \n \n \n \n \n \n \n \n \n \n \n Privacy Policy \n Terms and Conditions \n © 2021 Regents of the University of California \n \n \n \n \n \n \n \n \n \n \n × \n \n \n \n \n \n \n Let us help you with your search \n \n \n Enter your Search Criteria. \n \n \n \n Search All UCR \n \n \n Search This Site \n \n \n Cancel \n \n \n \n \n \n \n \n \n \n \n \n \n"
}