{
    "docno": "RJP251",
    "url": "https://about.instagram.com/about-us/careers",
    "text": "\n Instagram Careers & Jobs | Official Site \n \n \n \n \n \n  Log in   CAREERS   Join us and help inspire creativity around the world   EMBRACING PURPOSE   We place great value on caring for people who work at Instagram. Here are some of the things we are doing.   Campus Locations   Our headquarters in Menlo Park, CA, is just one of our many office locations. Our presence is growing in cities all around the globe.   Salary and 401(k)   We provide competitive salary and 401(k) matching along with full healthcare coverage that includes dental and vision plans.   Remote Work Support   We provide financial support to help people in remote roles get set up and maintain a productive home workspace.   Work/Life Balance   We offer flexible working hours, generous vacation days each year, and family-oriented work policies. We also make time for regular team-wide events.   OUR CULTURE   We put people first, and value craft and simplicity in our work. With over 1 billion monthly users—there are countless ways to make an impact.   View More About Our Culture and Values  Clear Filters Apply Apply Apply Apply Apply Apply Full-time Menlo Park, CA Data Scientist - Instagram, Core Growth Full-time New York, NY Creative Producer, @shop Full-time London, United Kingdom Northern Europe Instagram Partnerships Lead Full-time Gurgaon, India Public Policy Manager, Instagram Full-time AdTech Developer, Consumer Marketing (Instagram) Full-time Menlo Park, CA | New York, NY | San Francisco, CA | Remote, US Data Science Manager, Instagram Graph Full-time New York, NY Product Marketing Manager, Shopping  (Instagram) Full-time New York, NY | San Francisco, CA Qualitative UX Researcher, Instagram  View All  Facebook is proud to be an Equal Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, genetic information, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law.   If you need assistance or an accommodation due to a disability, you may contact us at  accommodations-ext@fb.com .   FEATURED ARTICLES   Read our latest posts and news about Instagram.  #INSTAGRAM #ANNOUNCEMENTS Giving People More Control on Instagram and Facebook #INSTAGRAM #ANNOUNCEMENTS Equity updates – what we’ve been up to and what comes next #INSTAGRAM #ANNOUNCEMENTS Introducing new tools to protect our community from abuse  View More  About Us Careers Brand Assets Features Reels Stories Messenger IGTV Shopping Search & Explore Community Anti-Bullying Safety Parents Programs Business Advertising Partners Success Stories Creators Engage Build Education Tools Blog Help Instagram Engineering About Us Features Community Business Creators Blog Help Brand Assets Careers Privacy Sitemap Terms Instagram Engineering English (US) English (US) Select your preference. Languages English (US) Español Français (France) Português (Brasil) 한국어 Deutsch 日本語 Instagram from Facebook API Privacy Terms Sitemap \n \n \n"
}