{
    "docno": "RJP299",
    "url": "https://irecruitportal.ucr.edu/irecruit/!Controller?action=jobs_webui.show_page&page=jobs_detail&requisition_id=22986840&profile_id=&module=jobs",
    "text": "\n \n UCR Jobs - Position Details  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Skip Navigation \n \n \n Home Page \n \n \n \n \n \n \n \n \n Login   \n Register   \n \n \n \n \n \n \n \n HR Employment \n \n \n \n \n \n \n \n \n \n Home \n Browse Jobs \n How to Apply \n My Account \n Help \n About \n \n \n \n \n \n \n \n \n \n \n Position Details \n \n \n \n View All Details \n  \n          Back To Current Job Opportunities\n     \n \n Apply \n \n \n \n Medical Assistant / Patient Care Coordinator (Outpatient Behavioral Health in Irvine, CA)     \n \n \n \n \n  Job Number \n  Full/Part Time  \n  Schedule    \n  Salary \n \n \n \n \n  22986840  \n  Full Time     \n  8AM - 5PM     \n      $44,015 -     $54,747     \n \n \n \n \n Position Information \n  \nThis position performs medical, technical, and administrative support services to contribute to the efficient day-to-day operations providing a positive patient experience. Clinical duties may include escorting patients to exam rooms, taking and recording vital signs and medical histories, preparing patients for examination, assist in procedures, and other duties as directed by physician. Provides administrative support to the providers and interacts with patients by scheduling patient appointments in tandem with the provider availability, interacts with patients in person and on the phone, answers clinic phone, greets patient at check-in, collects patient information, updates/maintains electronic records, insurance verification, handles visit payments, ensures the clinic has needed inventory for operation, and performs clerical tasks. Secure authorizations for incoming and outgoing referrals. This position will be primarily assigned to the women's health location, but may also be assigned to work at various UCR Health clinic locations. This position may be required to work different shifts, including evenings, weekends, and holidays.\t\n    \n     \n  Education   \n \n  Education Requirements  \n \n \n  Degree  \n  Requirement  \n \n \n \n  Medical Assistant Diploma  \n  Required  \n \n \n \n \n  Certifications  \n \n \n  Certification  \n  Requirement  \n \n \n \n  Basic Life Support (BLS) certification.  \n  Required   \n \n \n  Current Medical Assistant Certification.  \n  Preferred   \n \n \n \n \n  Conditions  \n \n \n  Condition  \n  Requirement  \n \n \n \n  In lieu of a MA diploma may have a Certificate of Competency with written evidence to validate training and competency as a medical assistant (i.e., certification of completion of a medical assistant training program, or a letter from supervising physician).  \n  Required   \n \n \n \n \n  Experience   \n \n \n \n  Experience  \n  Requirement \n \n \n \n      A minimum of two years (2) years of experience working in an environment performing tasks related to front and back office duties related to this position. At least one (1) of these years should be in a medical clinic office or hospital setting where insurance verification and patient financial responsibilities are performed.   \n  Required   \n \n \n      Experience using standard exam room medical equipment and computers.   \n  Required   \n \n \n      Work experience in a behavioral health setting.   \n  Preferred   \n \n \n \n \n \n  Special Conditions   \n \n \n \n  Special Condition  \n  Requirement  \n \n \n \n  Flexibility to work at various clinic sites in the inland empire and different work shifts, including evenings, weekends, and holidays. Travel will be required between clinical sites, administrative offices, campus, and other settings.  \n  Required   \n \n \n  To administer injections or provide venipuncture, must have written evidence of validation for training and competence in medication administration by injecting and skin testing.  \n  Required   \n \n \n  Overtime  \n  Required   \n \n \n  Shift Work (hours outside standard Mon-Fri 8AM-5PM work hours). This position may be required to work different shifts, including evenings, weekends, and holidays.  \n  Required   \n \n \n \n \n \n  Minimum Requirements  \n Strong oral and written communication skills to effectively communicate with patients of varying ages and multicultural backgrounds. Ability to maintain a work pace appropriate to the workload. Must demonstrate customer service skills appropriate to the job. Strong interpersonal skills. Understanding of medical terminology. Ability to work well in a constantly changing environment. Familiarity with universal precautions, handling of bio-hazardous waste, specimen identification and transport. Must possess the skill, knowledge and ability essential to the successful performance of assigned duties.   \n  Preferred Qualifications   \n Bilingual-English/Spanish.   \n Additional Information  \n In the Heart of Inland Southern California, UC Riverside is located on nearly 1,200 acres near Box Springs Mountain in Southern California; the park-like campus provides convenient access to the vibrant and growing Inland region. The campus is a living laboratory for the exploration of issues critical to growing communities' air, water, energy, transportation, politics, the arts, history, and culture. UCR gives every student, faculty and staff member the resources to explore, engage, imagine and excel. UC Riverside is recognized as one of the most ethnically diverse research universities in the country boasting several key rankings of which we are extremely proud.     UC Riverside is proud to be ranked No. 12 among all U.S. universities, according to Money Magazine's 2020 rankings, and among the top 1 percent of universities worldwide, according to the 2019-20 Center for World University rankings.     UC Riverside is the top university in the United States for social mobility. - U.S. News 2020     UCR is a member of the University Innovation Alliance, the leading national coalition of public research universities committed to improving student success for low-income, first-generation, and students of color.     Among top-tier universities, UC Riverside ranks No. 2 in financial aid. - Business Insider 2019     Ranked No. 2 in the world for research, UCR's Department of Entomology maintains one of the largest collections of insect specimens the nation. - Center for World University Rankings     UCR's distinguished faculty boasts 2 Nobel Laureates, and 13 members of the National Academies of Science and Medicine.      The University of California is an Equal Opportunity/Affirmative Action Employer with a strong institutional commitment to the achievement of excellence and diversity among its faculty and staff. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veteran status, or any other characteristic protected by law.   For information about our generous employee benefits package, visit:  Employee Benefits Overview   \n Job Description Details \n \n  View complete Job Description for this position   \n \n \n \n \n \n \n \n \n \n \n More Information \n \n \n \n General Campus Information \n \n University of California, Riverside \n \n 900 University Ave. \n \n Riverside ,  CA  92521 \n \n \n                                Tel:  (951) 827-1012 \n \n \n \n Career Opportunities \n                            •  UCR Libraries \n \n Campus Status \n                            •  Maps and Directions \n \n \n \n Department Information \n \n Human Resources \n 1160 University Ave. \n Riverside, CA 92521\n                                     \n Fax: (951) 827-6493\n                                     E-mail:  jobshelp@ucr.edu \n \n \n \n Related Links \n \n Human Resources Home \n Diversity \n About UCR \n \n \n \n \n \n \n \n \n Campuswide Navigation \n \n \n Home \n \n \n About UCR \n \n \n Academics \n \n \n Admissions \n \n \n Athletics \n \n \n Happenings \n \n \n Research \n \n \n Campus Resources \n \n \n Giving to UCR \n \n \n \n Footer \n \n \n \n Privacy Policy \n \n \n Terms and Conditions \n \n \n                            © 2010 Regents of the University of California\n                         \n \n                            Last modified: 2010-Apr-22\n                         \n \n \n \n \n   \n \n \n"
}