{
    "docno": "RJP236",
    "url": "https://www.facebook.com/AISESUCR/",
    "text": "\n UCR American Indian Science and Engineering Society Chapter - Home | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home About Posts Events Photos Videos Community See more of UCR American Indian Science and Engineering Society Chapter on Facebook Log In or Create New Account See more of UCR American Indian Science and Engineering Society Chapter on Facebook Log In Forgot account? or Create New Account Not Now UCR American Indian Science and Engineering Society Chapter Education  Community See All 119 people like this 126 people follow this About See All highlanderlink.ucr.edu/organization/ucraises Education Page Transparency See More Facebook is showing information to help you better understand the purpose of a Page. See actions taken by the people who manage and post content. Page created - March 9, 2017 People 119  likes Related Pages Jeff Gordon Counselor Tutor/Teacher American Indian Graduate Student Association at UC San Diego College & University Sacnas-ucr Nonprofit Organization ASA at UCR Nonprofit Organization Robogals USC Nonprofit Organization UC Riverside Student Workers Union UAW Local 2865 Political Organization UCSB American Indian & Indigenous Arts Collaborative - AIIAC Community Organization ACM-W : UCSC Chapter Science, Technology & Engineering Kali Simmons Musician/Band C•C•C Scroll Saw Artist Artist Native American Student Center at Cal Poly Pomona Campus Building CSEA Chapter 297 Education Carmen Harris, Real Estate Consultant Real Estate Agent CSULA Chemistry and Biochemistry Club Organization Enspired Visions Company Stockwell Law Firm PLLC Lawyer & Law Firm Department of Physics & Astronomy, Cal Poly Pomona School Multiple Threads Clothing (Brand) Mountain Unique by Gary Doss and Associates Commercial Real Estate Agency ImagiNative Stained Glass Local Business See More triangle-down Pages Liked by This Page Sherman Indian Museum UCR ARTSblock SACNAS Advancing Hispanics/Chicanos & Native Americans in Science UCR HUB University of California UC Riverside - Education Abroad UC Riverside Mathematics Department Intertribal Agriculture Council AMSA at UCR Global Medical Brigades at UCR UCR Center for Ideas and Society Sacnas-ucr AWIS UC Riverside University Honors at UC Riverside UCR Farmers Market UCR ARC Native Vote UCR Palm Desert UC Riverside Ethnic Studies California Native Vote Project See More triangle-down Pages Businesses Education UCR American Indian Science and Engineering Society Chapter English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 Posts UCR American Indian Science and Engineering Society Chapter October 17, 2019  ·  I’m participating in this year’s AIDS Walk Los Angeles, a 10K fundraising walk to fight the epidemic. Thank you for considering a donation! Every dollar we raise helps APLA Health stop new infections and support people living with HIV/AIDS. secure.aidswalkla.org Elise Green - AIDS Walk Los Angeles 2019 I’m participating in this year’s AIDS Walk Los Angeles, a 10K fundraising walk to fight the epidemic. Thank you for considering a donation! Every dollar we raise helps APLA Health stop new infections and support people living with HIV/AIDS. I’m participating in this year’s AIDS Walk Los Angeles, a 10K fundraising walk to fight the epidemic. Thank you for considering a donation! Every dollar we raise helps APLA Health stop new infections and support people living with HIV/AIDS. UCR American Indian Science and Engineering Society Chapter August 13, 2019  ·  It looks like you may be having problems playing this video. If so, please try restarting your browser. Close 59-year-old mom graduates from UCR and goes for a doctorate in psychology Posted by  UC Riverside 4,484 Views 4,484 Views UC Riverside August 10, 2019 Think it’s too late to follow that Ph.D. dream? Roseanne Carmen Rosenthal will tell you otherwise. Meet the 59-year-old mother of six and recent UCR grad conduc ... ting research on transgenerational effects of alcohol and the impacts of ingesting alcohol during pregnancy.   https://atu.cr/2MTOE0D   See More See All Photos See All Videos 2 1 See All See More \n \n \n"
}