{
    "docno": "RJP289",
    "url": "https://insideucr.ucr.edu/announcements/2020/09/25/covid-19-testing-campus",
    "text": "\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n COVID-19 Testing on Campus | Inside UCR \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n COVID-19   information, guidance, and resources . Information about  returning to campus . \n \n \n × \n \n \n \n \n \n \n \n \n \n \n \n \n \n Skip to main content \n \n University of California, Riverside \n \n \n \n \n Search \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n UC Riverside \n \n \n \n \n  Inside UCR  \n \n \n \n \n \n \n \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n Home \n \n \n Stories \n \n \n Awards & Honors \n \n \n Announcements \n \n \n ScotMemos \n \n \n Research Blog \n \n \n Events \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Breadcrumb \n \n \n \n \n \n \n \n \n \n Announcements \n \n \n September 25th, 2020 \n \n \n COVID-19 Testing on Campus \n \n \n \n \n \n \n \n \n \n \n Follow US: \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n COVID-19 Testing on Campus \n \n \n September 25, 2020 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Kim Wilcox, Deborah Deas, and Rodolfo Torres \n \n \n \n \n  September 25, 2020\n \n \n \n \n \n \n \n \n \n \n \n Dear Campus Community, \n We would like to thank everyone for their efforts to mitigate the impacts of COVID-19 on our campus over the past several months. Physical distancing, face coverings, limiting gatherings, and completing the Daily  Wellness Check  have all helped to ensure our collective health.    \n We have tried to take a careful and measured approach to dealing with the pandemic using incremental decision-making, addressing each challenge as the local and national context has evolved and relying on the latest scientific evidence and public health guidance.  \n Thus far, our approach has worked in large part due to everyone’s efforts. Our success in ramping up our research programs beginning in June is one important measure of that success.   \n As we  reported last week , we have created a new testing lab on campus that began operation in early September. Our lab’s testing capacity is expected to be approximately 3,000 tests per week. In addition, testing is available through  Riverside County  and private healthcare providers. UCR also has signed a memorandum of understanding with UCI Health in the event additional temporary testing capacity is needed. We are continuing discussions with partner organizations to explore other means of expanding our testing capacity on or near the campus. \n The exact protocol and frequency for COVID-19 testing will evolve based on changing circumstances, state or county public health guidance, and additional testing availability. But initially we are focusing our limited on-campus testing capacity on students living and learning on campus and essential workers on campus who have COVID-19 symptoms. \n While our campus population this fall quarter is nowhere close to what it would be during a typical fall, we still have people living, learning, and working on campus – and must deploy our testing capacity for the communities most susceptible to the spread of COVID-19. \n Below is a summary of the groups on campus who are required to undergo COVID-19 testing through our on-campus lab. These testing requirements reflect an attempt to reduce the likelihood of a COVID hotspot on our campus and are informed by the experience of other universities across the country as they have begun fall classes in these uncertain times.   \n Mandatory Symptomatic Testing  (Visit the CDC  website  for a list of symptoms) \n•    All residents in on-campus housing of any type \n•    All students taking in-person classes \n•    All student athletes (once back on campus) \n•    Students living in Riverside County \n•    Employees approved to regularly work on campus (examples include Residential Life, UCPD, Student Health, Housing and Dining, UCR Health, researchers, Athletics coaches and trainers, faculty/TAs teaching in-person classes, Early Childhood Services, etc.) \n Mandatory Asymptomatic Testing  \n•    All students living in campus residence halls and in Glen Mor  \n•    Student athletes (once back on campus) \n•    All students identified by case investigation, who may have had possible COVID-19 exposure \n In addition, other groups will be subjected to different testing strategies at the locations indicated below. \n Strongly Recommended Asymptomatic Testing (off campus through Riverside County’s Arlington Ave. site or other providers) \n•    Employees approved to work on campus who interact closely with students, or who are in higher density settings (examples include Residential Life, UCPD, Student Health, Housing and Dining, Early Childhood Services, etc.) \n•    Employees (listed above) identified by case investigation, who may have had possible COVID-19 exposure \n•    Athletics staff during competition, per NCAA/Big West Protocol \n Voluntary Asymptomatic Testing (on campus) \n•    Students living in lower density on-campus apartments and family housing \n•    Students taking in-person classes, not living on campus \n•    Medical students \n Voluntary Asymptomatic Testing (off campus through Riverside County’s Arlington Ave. site or other providers) \n•    Other employees approved to work on campus (researchers, Library, faculty/TAs teaching in-person classes, etc.) \n We will publish specific details on the schedules and locations of our on-campus testing sites on the UCR website once they are finalized, along with testing sites available through Riverside County. Please continue to visit the  UCR COVID-19  and  Campus Return  websites for updated resources and information.  \n Testing does not eliminate the risk of COVID-19, but is an essential complement to recommended public health measures. Please continue to be vigilant in following the guidance on face coverings, physical distancing, hand hygiene, and limited gatherings. We are deeply committed to the safety of all students and employees, near and far, and we will continue to monitor the situation and adapt accordingly. \n Once again, we thank the many individuals and teams across UCR who have had a hand in establishing and launching our testing lab. It reflects how our campus community has come together during such an unsettling time to serve our students and employees.  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Related Announcements \n \n \n \n \n \n \n \n \n \n Riverside County COVID-19 testing \n \n October 13, 2020 \n Read More » \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n University of California, Riverside \n \n 900 University Ave. \n            Riverside, CA 92521 \n Tel: (951) 827-1012 \n \n \n UCR Library \n Campus Status \n Campus Store \n Career Opportunities \n Diversity \n Maps and Directions \n Visit UCR \n \n \n \n \n \n University of California, Riverside \n \n               900 University Ave.\n             Riverside, CA 92521                          \n  tel: (951) 827-0000                         email:  webmaster@ucr.edu   \n \n \n  Find Us \n \n \n \n \n Follow US: \n \n \n \n \n \n \n \n \n \n \n \n Related Links \n \n \n UCR News \n \n Research Blog \n \n Inside UCR Archive \n \n Human Resources \n \n UC Path Portal \n \n Staff Assembly \n \n UC Newsroom \n \n \n \n \n \n \n \n \n \n \n \n \n \n Privacy Policy \n Terms and Conditions \n © 2021 Regents of the University of California \n \n \n \n \n \n \n \n \n \n \n Search \n × \n \n \n \n \n \n \n Let us help you with your search \n \n \n Enter your Search Criteria. \n \n \n \n Search All UCR \n \n \n Search This Site \n \n \n Cancel \n \n \n \n \n \n \n \n \n \n \n \n \n"
}