{
    "docno": "RJP215",
    "url": "http://www.oclc.org/content/dam/ext-ref/worldcat-org/terms.html",
    "text": "\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n WorldCat Terms and Conditions \n \n \n \n \n         \n \n     \n \n \n     \n \n \n \n \n Back \n \n OCLC WorldCat.org Services Terms and Conditions \n Thank you for visiting the OCLC WorldCat.org web site.Â  You may utilize WorldCat.org Services by agreeing to and complying with these OCLC WorldCat.org Services Terms and Conditions (these â\u0080\u009cTermsâ\u0080\u009d).Â  Your use ofÂ  WorldCat.org Services is governed by these Terms.Â  OCLC reserves the right, within its sole discretion, to determine   your eligibility to use WorldCat.org Services. \n \n 1. DEFINITIONS \n \n â\u0080\u009cWorldCat.org Servicesâ\u0080\u009d means the Data and other services made available to You by OCLC through the OCLC WorldCat.org web site. \n â\u0080\u009cYouâ\u0080\u009d or â\u0080\u009cYourâ\u0080\u009d refers to:Â  (i) an individual accessing and using WorldCat.org Services on his or her own behalf;Â  or (ii) an individual or entity on whose behalf WorldCat.org Services are being accessed and used by his/her/its authorized representative.Â   \n â\u0080\u009cAccountâ\u0080\u009d means your current access credentials which are recognized by OCLC as authentic.Â Â   \n â\u0080\u009cDataâ\u0080\u009d means bibliographic data and other information (including text, images and other content contributed to WorldCat.org Services by other users) made available to You by OCLC or its suppliers through WorldCat.org Services. \n â\u0080\u009cNon-Commercial Useâ\u0080\u009d means Your internal or personal use for purposes of resource discovery, learning, teaching, academic research, scientific research, private study, verification of bibliographic information and/or identification of materials to be ordered via interlibrary loan. \n â\u0080\u009cCommercial Useâ\u0080\u009d means:Â  (i) sale or resale of WorldCat.org Services (including, without limitation, sale or resale of rights therein under a licensing arrangement or otherwise); or (ii) use of WorldCat.org Services as part of or to facilitate a service for which You receive a fee (including, without limitation, fees from advertising placed on service interfaces).  \n â\u0080\u009cContentâ\u0080\u009d means text, images and/or other content You (by linking or otherwise) include in Your user profile (if any) or otherwise contribute to WorldCat.org Services. \n \n 2. AGREEMENT TO THESE TERMS \n Your use of WorldCat.org Services signifies Your agreement to these Terms.Â Â  Accordingly, You should read these Terms carefully prior to using WorldCat.org Services.Â  The Terms are available via a link appearing on the OCLC WorldCat.org web site and may also be made available for Your review as OCLC otherwise thinks appropriate.Â  OCLC may change these Terms at any time in its sole discretion. OCLC will issue notice of changes by email, a change notice posted on the OCLC WorldCat.org web site or any other means reasonably calculated to provide notice.Â  If any change is unacceptable, Your only recourse is to cease using WorldCat.org Services. Your continued use of WorldCat.org Services following OCLCâ\u0080\u0099s issuance of notification of a change to these Terms or posting of a new version of these Terms on the OCLC WorldCat.orgÂ  web site will constitute binding acceptance of the change or such new agreement (whichever applies).Â  \n 3. USE OF WORLDCAT.ORG SERVICES \n \n Data.Â   OCLC grants you a nonexclusive, nontransferable license to use Data solely for Non-Commercial Use.Â  The following activities are prohibited and you agree not to engage in (or permit) such activities: \n \n use of Data for Commercial Use, in any manner not expressly authorized by these Terms or in any unlawful manner; \n use of Data for cataloging; \n making more than one (1) copy per screen display; \n use of bots, spiders, or other automated information-gathering devices or programming routines to \"mine\" or harvest material amounts of Data; \n distribution, display or disclosure of Data except to the extent reasonably incidental to Non-Commercial Use; and \n permanent or long-term storage of Data (including, but not limited to, creation of or repackaging in a database containing material amounts of Data).Â  \n   \n Third-Party Data .Â  Certain Data made available to You through WorldCat.org Services is supplied by third-party database owners.Â  Your use of such Data is subject to:Â  (i) Section 3.A above; and (ii) the terms and conditions applicable to such Data set forth in Exhibit A to these Terms.Â  A third-party database owner has the right to assert or enforce any of the provisions of these Terms applicable to its data directly against You on its own behalf. \n Content .Â  If WorldCat.org Services afford You the opportunity to establish a user profile or otherwise contribute text, images and/or other content, the following requirements apply to the Content:Â  (i) You are responsible for complying with the requirements of all applicable copyright laws and other laws applicable to Content, as well as all liability and damages arising from Your failure to do so; (ii) You may not use or contribute Content that is illegal, inaccurate, obscene, threatening, defamatory, invasive of privacy, infringing of intellectual property rights, or otherwise injurious to third parties or objectionable or which consists of or contains software viruses, political campaigning, commercial solicitation, chain letters, mass mailings, or any form of \"spam\"; and (iii) You may not use a false e-mail address, impersonate any person or entity, or otherwise mislead as to the origin of Content.Â  OCLC reserves the right (but does not have the obligation) to remove, without liability, Content determined by OCLC in its sole discretion to violate the above requirements, but OCLC does not regularly review Content.Â  OCLC takes no responsibility and assumes no liability for or in connection with any Content.Â  You hereby grant to OCLC (including its subsidiaries and affiliates) a perpetual, irrevocable, nonexclusive, transferable, assignable, worldwide, fully paid up, royalty-free, license to:Â  (i) make, use, copy, reproduce, modify and exploit Content; (ii) create, use, copy, reproduce, modify and exploit derivative works of Content; (iii) publicly perform or display, import, broadcast, transmit, disclose, distribute (directly or through a third-party), license, offer to sell, and sell, rent, lease or lend Content (and any derivative works thereof); and (iv) sublicense or assign to third parties any or all of the foregoing rights, including the right to sublicense or assign to further third parties.Â  You also perpetually, irrevocably and free of charge grant other users of WorldCat.org Services all rights in and to Content (and derivative works thereof) necessary for use in accordance with these Terms and any additional terms and conditions described in Section 3.D below. You represent and warrant to OCLC (and its subsidiaries and affiliates) that You have all rights in Content necessary to grant the foregoing rights and that use of Content in accordance therewith will not infringe upon or otherwise violate the rights of any party.Â  You will immediately notify OCLC of any circumstances which may indicate a breach of the foregoing representations and warranties. Â Subject to the foregoing license grants and except as required by any additional terms and conditions described in Section 3.D below, You and/or Your suppliers retain ownership of all rights, title and interest in and to Content.Â   \n Other Services .Â  Other services made available to You through the OCLC WorldCat.org web site may be subject to additional terms and conditions which will be made available to You at the time such other services are available for Your use.Â  You acknowledge that the WorldCat.org web site may provide You with links to web sites or sources of content which are not under the control of and are not maintained by OCLC.Â  OCLC is not responsible for and does not endorse or guarantee the content or services available to You through those links.Â  Accordingly, You agree to pursue any claims you may have as a result of Your use of or reliance on such services or content solely against the relevant supplier.  \n Â OCLC may, without liability, determine, add to, delete from or change at any time (i) which Data and other services comprise WorldCat.org Services,Â  (ii) the technical and functional specifications, form and formats ofÂ  WorldCat.org Services; (iii) Your rights with respect to WorldCat.org Services; and (iv) any of these Terms.Â  Your continued use of WorldCat.org Services after any such determination, addition, deletion or changes signifies Your acceptance thereof.Â  OCLC may discontinue WorldCat.org Services, in whole or in part, at any time and for any reason without liability \n â\u0080\u009cOCLCâ\u0080\u009d, â\u0080\u009cWorldCatâ\u0080\u009d, â\u0080\u009cWorldCat.orgâ\u0080\u009d and the WorldCat logo are trademarks/service marks of OCLC Online Computer Library Center, Inc.Â  Third-party product, service and business names are trademarks/service marks of their respective owners.Â  OCLC and/or its suppliers own all rights, title and interest, including, without limitation, all intellectual property rights, in and to WorldCat.org Services.Â  Except as expressly provided for in these Terms, You acquire no rights in or to WorldCat.org Services. \n Acquisition and maintenance of Internet and other telecommunications connections, services, equipment and facilities necessary for You to access WorldCat.org Services are Your sole responsibility.Â  \n \n 4. MATERIAL BREACH \n OCLC may, in its sole discretion, take measures to suspend your access to WorldCat.org Services immediately upon your material breach of these Terms pending Your correction of such breach.Â  Egregious or habitual breaches of these Terms may result in permanent suspension of Your access to WorldCat.org Services.Â Â  \n 5. DISCLAIMERS AND LIMITATIONS OF LIABILITY \n \n You are responsible for all damages, liabilities, losses, costs and expenses (including attorneysâ\u0080\u0099 fees) incurred by OCLC, its subsidiaries and affiliates and/or their respective suppliers (including those incurred in connection with third-party claims) as a result of your breach of these Terms. \n WORLDCAT.ORG SERVICES ARE PROVIDED â\u0080\u009cAS ISâ\u0080\u009d AND YOUR USE OF AND RELIANCE ON WORLDCAT.ORG SERVICES [INCLUDING, WITHOUT LIMITATION, COPYRIGHT STATUS INFORMATION (IF ANY)]  IS SOLELY AT YOUR OWN RISK .Â  COPYRIGHT STATUS INFORMATION AVAILABLE THROUGH WORLDCAT.ORG SERVICES:Â  (i) IS DETERMINED BY OCLC OR ITS SUPPLIERS BY USING REASONABLE EFFORTS; (ii) IS PRESENTED SOLELY FOR INFORMATIONAL PURPOSES; (iii) DOES NOT CONSTITUTE LEGAL ADVICE; AND (iv) IS NOT TO BE CONSIDERED A SUBSTITUTE FOR YOUR INDEPENDENT VERIFICATION OF COPYRIGHT STATUS.Â  OCLC DOES NOT REPRESENT OR WARRANT THE COMPLETENESS, PERFORMANCE OR ACCURACY OF WORLDCAT.ORG SERVICES. \n OCLC, ITS SUBSIDIARIES AND AFFILIATES AND THEIR RESPECTIVE SUPPLIERS DISCLAIM ALL REPRESENTATIONS AND WARRANTIES, EXPRESS AND IMPLIED, CONCERNING WORLDCAT.ORG SERVICES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR USE AND NONINFRINGEMENT. IN NO EVENT SHALL OCLC, ITS SUBSIDIARIES OR AFFILIATES OR THEIR RESPECTIVE SUPPLIERS HAVE ANY LIABILITY WHATSOEVER FOR, AND YOU HEREBY EXPRESSLY RELEASE EACH FROM, DAMAGES OR LIABILITY OF ANY KIND ARISING FROM CLAIMS RELATED TO:Â  (i) WORLDCAT.ORG SERVICES (INCLUDING, WITHOUT LIMITATION, CLAIMS BASED ON INFRINGEMENT OF COPYRIGHT, PATENT, TRADE SECRET OR OTHER RIGHT, LIBEL, SLANDER OR INVASION OF PRIVACY OR ERRORS, INACCURACIES OR OMISSIONS IN WORLDCAT.ORG SERVICES); OR (ii) ANY ACT UNDERTAKEN OR OMISSION MADE IN CONNECTION WITH THIS AGREEMENT, IN EACH CASE, REGARDLESS OF WHETHER OR NOT THE RELEASED PARTY HAD BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.Â  If you are a California resident, You waive your rights under California Civil Code Â§ 1542, which states, \"A general release does not extend to claims which the creditor does not know or suspect to exist in his favor at the time of executing the release, which if known by him must have materially affected his settlement with the debtor.\"Â  Residents of other states and nations similarly waive their rights under analogous laws, statutes, or regulations.Â  Some states do not permit the exclusion of warranties, so the above warranty exclusions may not apply to You. \n Neither party shall have any liability or obligation to the other for indirect, incidental, consequential or exemplary damages (including, without limitation, lost profits, loss of business, or loss of or damage to data) whether based on contract, tort or any other legal theory and regardless of whether a party foresaw such damages.Â  \n \n 6. MISCELLANEOUS \n \n These Terms constitute the complete, final and exclusive statement of the parties' agreement with respect to the subject matter hereof and, except as specified in Section 3.B above, are not intended to confer upon any person other than the parties hereto any rights or remedies. No purchase orders or other forms You submit shall apply to modify or supplement these Terms. These Terms may be modified only by means of a written document executed by each of the parties. \n These Terms shall be governed by and construed in accordance with the laws of the State of Ohio and the United States of America, without regard to their respective conflict of laws principles. The United Nations Convention on Contracts for the International Sales of Goods shall not apply. \n You may not assign or otherwise transfer your rights or obligations under this Agreement. OCLC may assign its rights and/or delegate its obligations under this Agreement by posting notice of such assignment and/or delegation on the OCLC WorldCat.org web site at least thirty (30) days prior to the effective date thereof.Â   \n OCLC and/or its suppliers shall not be liable for any failure or delay in performance hereunder due to any cause beyond its reasonable control including, but not limited to, acts of God or public enemy, fire, explosion, accident, strikes, governmental actions, delay or failure of suppliers, or delay or failure of the OCLC systems or other difficulties with telecommunications networks.Â Â   \n WorldCat.org Services may not be accessed or used by entities or individuals who are or become subject to United States trade restrictions.Â  WorldCat.org Services may be used only in full compliance with U.S. export regulations. You shall be the exporter and importer of record in connection with WorldCat.org Services as delivered by OCLC to You outside the United States, and shall pay and/or comply with all applicable export and import laws, customs, regulations tariffs, duties and fees, and procurement, data and technology transfer laws. OCLC's obligations hereunder are contingent upon necessary export licenses being obtained from federal agencies of the United States. \n Notices required to be given pursuant to these Terms may be provided by email:Â  (i) to You, to an email address or mailing address that OCLC reasonably associates with You; and (ii) to OCLC, to the following OCLC mailing address: OCLC Online Computer Library Center, Inc, 6565 Kilgour Place, Dublin, Ohio, USA 43017-3395, Attention: Legal Department. \n Any waiver of any provision of these Terms must be in writing and signed by the party against whom the waiver is to be enforced.Â  Â    \n If any provision of these Terms is held to be invalid or unenforceable, such provision shall be deemed superseded by a valid enforceable provision that most closely matches the intent of the original provision and the remaining provisions shall be enforced. \n Â OCLC's collection and use of any personal information submitted via the OCLC WorldCat.org web site (if any) is governed by  OCLC's Privacy Statement .   \n Â OCLC may remove or purge data stored with WorldCat.org Services more than thirty (30) days (if any), without notice or liability.Â  \n \n EXHIBIT A \n TERMS AND CONDITIONS APPLICABLE TO THIRD-PARTY DATABASES \n ERICâ\u0080\u0094United States Department of Education \n Some material in the ERIC database is from copyrighted sources of the respective copyright holders. Users of the bibliographic records from the ERIC database are responsible for compliance with any copyright, patent or trademark restrictions and are referred to the copyright, patent or trademark notices appearing in the original sources, all of which are hereby incorporated by reference. \n Swets & Zeitlinger, B.V. \n Data supplied to WorldCat.org Services by Swets & Zeitlinger, B.V. may not be collectively distributed to any commercial online vendor. \n MEDLINEâ\u0080\u0094National Library of Medicine (NLM) \n Subject matter coverage:Â  All areas of medicine, including clinical medicine, dentistry, education, experimental medicine, health services administration, nursing, nutrition, pathology, psychiatry, toxicology and veterinary medicine. \n NLM represents that the data provided through WorldCat.org was formulated with a reasonable standard of care. Except for this representation, and as otherwise specifically provided in this Exhibit A, NLM makes no representation or warranties, expressed or implied. This includes, but is not limited to, any implied warranty of merchantability or fitness for a particular purpose, with respect to the NLM Data, and NLM specifically disclaims any such warranties and representations. \n You agree to provide those details regarding Your use of NLM Data as are reasonably requested by OCLC and/or the National Library of Medicine. \n Your duplication and redistribution of NLM Data must conform with the Terms (including this Exhibit A), applicable fair use guidelines and applicable United States and international copyright laws (collectively, â\u0080\u009cApplicable Restrictionsâ\u0080\u009d).Â  Unless otherwise prohibited by Applicable Restrictions, (i) individuals may download reasonable amounts of NLM Data for personal use and may provide others with a single copy of NLM Data downloaded; and (ii) an organization or institution may download small amounts of NLM Data for internal use and redistribution within its organization or institution.Â Â  For purposes of subpart (ii) of the foregoing sentence, a â\u0080\u009csmall amountâ\u0080\u009d is about 1,000 records per month or 12,000 records for each year of coverage.Â  Since NLM makes corrections and enhancements to and performs maintenance on these records at least annually, You should plan to replace or correct the records once a year to ensure that they are still correct and searchable as a group. \n NLM Data is produced by a U.S. government agency and as such the contents are not covered by copyright domestically. They may be copyrighted outside the U.S.Â  Some NLM Data is from copyrighted publications of the respective copyright claimants. You are solely responsible for compliance with any copyright restrictions and are referred to the publication data appearing in the bibliographic citations, as well as to the copyright notices appearing in the original publications, all of which are incorporated by reference. You should consult legal counsel before using NLM Data to be certain that Your plans are in compliance with these Terms and appropriate laws.Â  All NLM Data must be identified as being derived from NLM databases. \n â\u0080\u009cINSIDE SERIALSâ\u0080\u009d Databaseâ\u0080\u0094The British Library (BL) \n Certain records in this database are  Â© COPYRIGHT THE BRITISH LIBRARY BOARD: ALL RIGHTS RESERVED \n The British Library owns the entire right in the records in this database that include the â\u0080\u009cBL Shelfmarkâ\u0080\u009d or â\u0080\u009cBL Stock Locationâ\u0080\u009d field.Â  Any rights that subsist in the bibliographic components of the database remain the property either of the British Library Board, individual publishers or any other organisation contributing to the database. This component of the database may not be used, sold, licensed, transferred, copied or reproduced in whole or in part in any manner or form or in or on any media to any person without the prior written consent of the British Library. \n You may use records, metadata and holdings information supplied by The British Library (\"BL Data\") only for the personal, non-commercial purpose of assisting You with locating an item in a library of Your choosing. You acquire no ownership rights to any BL Data or portions thereof.Â  No part of any BL Data may be used, disclosed, reproduced, transferred or transmitted in any form except as expressly permitted by the Terms (including this Exhibit A).Â  Use of BL Data for cataloging purposes is expressly prohibited. You may not resell or otherwise make available any application which facilitates access to or the searching, retrieval and/or browsing of BL Data. You may not omit or obscure any notice of a limitation of warranty, disclaimer, copyright, patent, trademark, trade secret, usage limitation or any logo, splash screen or any other terms and/or conditions intended to be displayed in BL Data by The British Library or OCLC. \n Google Maps API â\u0080\u0093 Google Inc. \n Data supplied to WorldCat.org Services by Google Inc. through the Google Maps API is subject to Googleâ\u0080\u0099s Terms of Use which may be found at  http://code.google.com/apis/maps/terms.html .Â  Where You use the mapping functionality of WorldCat.org Services as provided by Google, You agree Your use is subject to Googleâ\u0080\u0099s Terms of Use. \n Google Book Search API â\u0080\u0093 Google Inc. \n Where You access Google Book Search content through the â\u0080\u009cpreviewâ\u0080\u009d feature of WorldCat.org Services, You agree that You may not: \n \n modify or replace the text, images, or other elements of the Google Book Search content; \n modify, replace or otherwise disable the functioning of links to Google or third party websites provided with the Google Book Search content; \n \"crawl,\" \"spider,\" index or in any non-transitory manner store or cache Google Book Search content or any part, copy or derivative thereof; \n transfer, sell, lease, syndicate, sub-syndicate, lend, or use for co-branding, timesharing, service bureau or other unauthorized purposes Google Book Search content or any part, copy or derivative thereof; \n use any robot, spider, site search/retrieval application, or other device to scrape, retrieve or index any portion of Google Book Search content or to collect information about users for any unauthorized purpose; \n falsify or delete any author attributions, legal or other proper notices or proprietary designations or labels of the origin or source of Google Book Search content; \n restrict or inhibit any other person from using and enjoying Google Book Search content; \n remove any copyright, trademark or other proprietary rights notices contained in or on Google Book Search content; or \n reverse engineer the Google Book Search API. \n \n Terms updated as of September 24, 2009 \n \n \n \n \n \n \n"
}