{
    "docno": "RJP281",
    "url": "https://ehs.ucr.edu/coronavirus/staff",
    "text": "\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Staff & Faculty | Environmental Health & Safety \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Skip to main content \n \n Planning Budget & Administration \n \n \n \n \n \n \n Report a Incident, Injury or Safety Concern \n \n \n Report a COVID-19 or Public Health Concern \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n UC Riverside \n \n \n \n \n  Environmental Health & Safety  \n \n \n \n \n \n \n \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n About EH&S \n \n \n Organizational Chart \n \n \n Programs & Policies \n \n \n Staff Directory \n \n \n Who Do I Call? \n \n \n \n \n How Can We Help? \n \n \n Programs & Policies \n \n \n Food Permit Request \n \n \n Hazardous Waste Pick Up \n \n \n Log into Chemicals, INSPECT, LHAT, & WASTe Apps \n \n \n Personal Protective Equipment (PPE) \n \n \n \n \n Programs & Services \n \n \n Training \n \n \n COVID-19 Prevention Training \n \n \n \n \n Report \n \n \n COVID-19 Concern \n \n \n Safety Concern \n \n \n Work Related Injury/Illness \n \n \n \n \n \n \n \n \n \n \n Report a Incident, Injury or Safety Concern \n \n \n Report a COVID-19 or Public Health Concern \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Face Coverings are required while on campus. Staff/Faculty may request a  face covering from EH&S . Students may request a  face covering from The Well . \n \n \n × \n \n \n \n \n \n \n \n \n \n \n Breadcrumb \n \n \n \n \n \n \n \n \n \n Coronavirus \n \n \n Staff & Faculty \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Staff & Faculty  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n   \n Return to Work Protocols \n Find out  what you need to know  before returning to work/campus, including training, self monitoring symptom tool, and more. \n Keep Working \n Resources and Tips for Telecommuting:  https://keepworking.ucr.edu/ \nRead the  Announcement Regarding Relocation of University Equipment to Remote Works Sites . \n Keep Teaching \n Resources and tools for teaching remotely:   https://keepteaching.ucr.edu/ \n Research \n EH&S resources and guidance for  research operations . \n Instructors \n Additional  FAQ's for Instructors \n Disability Management \n Guidance on  reasonable accommodations  during COVID-19. \n AB 685 - Request for Anonymity on COVID Notification to Unions \n \nAB 685 requires the University of California to notify exclusive union representatives of the names of employees who have tested positive for COVID-19 and who worked onsite during the infectious period. Under 8 CCR 14300.29(b)(7), employees may  request  that their names not be included in such notifications so long as such a request is voluntary and independent. \n Submit Request  \n Frequently Asked Questions: \n \n \n \n \n \n \n \n \n \n \n \n            Where can I find information on employee leave?     \n \n Guidance on COVID-19 human resources questions is available  here . \n \n \n \n \n            What is the status of campus services including the Bookstore, Card Services, and Mail Service?     \n \n The status of campus services is as follows:  \n UCR Bookstore \n  Books can be ordered online only. For general questions, call x2-4213 or x2-4456, or email  sm8106@bncollege.com \n Highlander Service Station \n Closed until further notice. For academic printing or copying needs, email  printingrequest@ucr.edu . For general questions, call x2-4443 or x2-4444, or email  servicestation@ucr.edu   \n Card Services \n Staff will work remotely to support essential card related services & data. R'card needs may be handled by appointment and/or with contactless delivery by visiting  https://ucrcard.ucr.edu . For general questions, call x-2-2273 or x2-1237 or email  servicestation@ucr.edu . \n Mail Services \n As an essential function, inbound/outbound mail is still being processed daily between 8am and 5pm. Adjusted delivery routes are in place for departments in need of service. Front lobby/post office will be closed to customers, however pick-up and drop off of department mail can be scheduled with the Mail Services team. Departments should call x26245 or email  mailservices@ucr.edu  to schedule pick-up appointments and/or have their department added to the delivery schedule.  \n Receiving Services \n As an essential function, processing of inbound/outbound shipments and campus deliveries is occurring daily between 8am and 5pm. Delivery of items on campus is based on accessibility to the building/department that ordered. Receiving Services is still providing the following items/services: gas cylinders, research related alcohol and IDT. Please visit https://cbs.ucr.edu to order (forms under ‘Receiving Services’ menu). Will call pickups are also available at the loading dock in the Corporation Yard. For general questions, please call x23134 or email  receivingservices@ucr.edu   \n ScotSupply \n As part of the CBS re-organization plan, this unit was closed at the end of FY20. In order to properly support important research on campus, limited items and services from ScotSupply have been retained and are now part of Receiving Services. Please refer to the ordering information in the Receiving section.  For general questions, call x2-5542 or email  scotsupply@ucr.edu .  \n ScotSurplus \n Closed to walk-in traffic. Staff is available by appointment only to meet campus needs. Public surplus sales are cancelled until further notice. Surplus, Shredding and e-Waste pick-ups are still available. Please visit https://cbs.ucr.edu/shreddinge-wasterecycling to schedule a shredding or e-Waste pick-up. To make an appointment or schedule a Surplus pickup, please call x25543 or email  scotsurplus@ucr.edu .  \n Digital Print Services \n For academic printing or copying needs, please email printingrequest@ucr.edu. For UCR business cards, letter head, or posters please visit \nhttps://cbs.ucr.edu to order (forms under ‘Digital Print Services’ menu). Technician still available for Copier Program repairs and service. For general questions, please call x24318 or 25097 or email  printingrequest@ucr.edu . \n Auxiliary Design Services \n Staff working remotely (on site as needed) to support critical design and digital content needs. For urgent design or poster printing needs, please email  auxiliarydesign@ucr.edu  or visit  https://cbs.ucr.edu/auxiliary-design-services   \n Central Business Services Administration \n Limited CBS leadership will be working on campus during closure and most will be working remotely. Our administration office, Corp Yard Building B, will be closed and locked. Please contact CBS leadership for assistance. \n \n \n \n \n            Is there guidance on parking, permits, fleet rentals, and alternative transportation during the campus shutdown?     \n \n Please refer to  UCR Transportation's FAQs  regarding parking, parking permits, and fleet rentals during the campus shutdown. \n \n \n \n \n            How is UCR responding to COVID-19?     \n \n The university is in  Phase 2  of it's COVID-19 response.  \n University leadership is working with the UC Office of the President, Riverside County Public Health, our fellow UC campuses, clinical partners, and elected officials to monitor the situation, ensure all appropriate precautions are taken, and respond quickly and effectively as matters arise.  \n \n \n \n \n            May UCR quarantine or isolate students who were possibly exposed to, or who have contracted, COVID-19?      \n \n Yes. UC enacted a Policy on Safeguards, Security and Emergency Management in January 2006 that contemplates the need for chancellors to take extraordinary measures in the event of “a natural or man-made disaster, a civil disorder which poses a threat of serious injury to persons or damage to property,” or other “seriously disruptive events.”8 Pursuant to this policy, UC may take appropriate steps to protect the health and safety of its students in the face of a known serious health crisis like a serious outbreak or pandemic. \n \n \n \n \n            How is UCR disinfecting surfaces?     \n \n UCR is taking extensive measures to prevent the spread of COVID-19. Examples include: \n - Deployed hand sanitizers in university-owned housing, dining areas, and entrances to buildings; \n - Began using a new CDC-approved chemical disinfectant, after review and approval by Environmental Health and Safety, across the campus; \n - Increased cleaning in university-owned housing of high-touch areas including lobbies, lounges, restrooms, and elevators; and  \n - Increased cleaning in campus General Assignment classrooms and adjacent restrooms. \n \n \n \n \n            What should I do if I am planning an event?     \n \n All in-person, non-essential gatherings on campus are suspended, until further notice \n \n \n \n \n            Is there a duty to report COVID-19 cases to state or local health authorities?     \n \n Yes. Generally, health care providers — including doctors, nurses, physician assistants, among others — who know of, or are in attendance on, a case or suspected case of COVID-19 are required to report it to the local health department immediately, by telephone, in accordance with internal administrative procedures. Where no health care provider is in attendance, any individual who knows of, or suspects that, someone has COVID-19 is permitted to report it to the local health department. Local health departments, in turn, notify the CDPH. \n Contact information for the local health officers may be found at the  CDPH website . \n \n \n \n \n            Guidance for all Transportation-related activities including parking, permits, biking, buses, and campus transportation issues     \n \n Please refer to the  UCR Transportation FAQ  for answers on questions such as: \n Parking on Campus during Shutdown including Visitor Parking \n Parking Permits, Refunds, and Citations \n Renting and maintaining Fleet vehicles \n Buses, Biking, and Carpool/Vanpool \n Parking for Student Employment \n And many more! \n \n \n \n \n \n            Which campus buildings are being serviced by custodial staff?     \n \n Student Health Services, the UC Intellicenter, the UCPD building, and housing and dining facilities are receiving regular custodial services. Many academic buildings on campus are receiving limited cleaning services. For a full list, visit  https://facilities.ucr.edu/ \n \n \n \n \n            How is maintenance support, landscape services, trash pickup, and recycling impacted by the campus closure?      \n \n Maintenance staff will be on site Monday-Friday from 7 a.m. to 3 p.m. and will be available for emergencies and to monitor building conditions. Landscape Services will manage only emergency, weather-related situations. Exterior trash containers and dumpsters will be emptied weekly; housing and dining trash will be serviced as needed. Recycling will not be supported during the COVID-19 closure. For more information, including emergency contact information, visit  https://facilities.ucr.edu/ .  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n            Are there steps that leaders, managers, and supervisors can take to prepare for an outbreak of COVID-19?     \n \n The Riverside County Public Health order requires UC Riverside to minimize the number of people on campus while maintaining the critical functions of the university. The campus closure is intended to remove UCR employees from the physical campus through April 3 unless they are identified as essential personnel who perform critical functions that can only be conducted on-site. All others will either remote work or, if their jobs cannot be done remotely, are eligible for 14 days of administrative leave, as indicated in yesterday’s message.   \n For essential personnel supporting critical campus functions on campus, the  CDC  recommends social distancing measures, which include but are not limited to: \n Supervisors implementing flexible work hours (e.g., staggered shifts) to minimize person-to-person contact. \n Maintaining distance (approximately 6 feet or 2 meters) from others when possible. \n Employees wishing to  briefly  return to campus to retrieve materials needed to work remotely must contact their department head/chair for approval in advance. They should also contact their supervisor to secure access to their office if needed. \n If this approach is not feasible for some reason, supervisors may contact the Central Plant at 951‑827‑4677 between the hours of 7:00 a.m. – 2:00 p.m. to provide access to offices/labs for personnel to retrieve personal items. After March 17 or after-hours, UCR Police may be contacted at 951‑827‑5222 for service. \n \n \n \n \n            What steps should be taken if an employee becomes ill with fever, cough or other concerning symptoms?     \n \n Review the  When Do You Return To Campus guidance  document. \n Anyone sick and believed to be at risk for COVID-19 infection should be advised to seek medical assistance and follow the CDC recommendations: \n Stay home except to get medical care. \n Separate yourself from other people in your home and avoid sharing personal household items. \n If you have a medical appointment, call the health care provider and tell them that you are concerned about the possibility of COVID-19 infection before going to the doctor’s office. \n Wear a facemask when you are around other people. \n Cover your coughs and sneezes with a tissue. \n Clean your hands often with soap and water for at least 20 seconds, or use hand sanitizer that contains at least 60% alcohol. \n Avoid sharing personal household items. \n Seek prompt medical attention if your illness is worsening. \n If you are placed under active monitoring, or facilitated self-monitoring, follow the instructions provided by your local health department or occupational health professional, as appropriate. \n Consult with your health care provider before discontinuing home isolation. \n \n \n \n \n \n            Should an instructor require a student who is out sick to provide a health care provider’s note?     \n \n Verification of student illness is at the discretion of each instructor. Instructors should use a consistent practice to avoid bias and discrimination in their approach. Students who are uncomfortable providing health information to instructors may work through Student Affairs Case Management. \n  \n \n \n \n \n            May UCR prohibit an employee from coming to work if the employee is known to have contracted COVID-19 themselves, or to have had close contact with someone who has?     \n \n Yes. UC is obligated to provide a safe workplace and may take necessary and reasonable steps to minimize health risks for its employees, such as requiring that employees not come to work if they have COVID-19. \n If any employment actions are taken as a result of COVID-19, such as requiring that employees not come to work, such actions must be consistent with federal and state laws prohibiting discrimination in the workplace. \n Review the  When Do You Return To Campus guidance  document. \n \n \n \n \n            What additional steps should be taken if an employee is suspected to be ill with COVID-19 at work?     \n \n Managers and supervisors should encourage employees to take leave and seek medical assistance from their primary care physician. \n If an employee declines to take leave, managers and supervisors should consult their local human resources (HRBP) or academic personnel offices for assistance in determining whether there is objective evidence of a suspected case of COVID-19. If possible, managers and supervisors should ask on-site employee health services, if available, to assist in making this determination. If there is objective evidence that an employee has acute respiratory illness and that employee refuses to take leave, a manager or supervisor may, over the objection of the employee, require that the employee leave the workplace. In such circumstances, the absence should be recorded as “approved.” Managers and supervisors should seek assistance from their local human resources (HRBP) or academic personnel offices before taking any action, to ensure that all appropriate options have been considered. Action should not be taken based solely on a manager’s or supervisor’s subjective assessment of an employee’s medical condition. \n \n \n \n \n \n \n \n \n \n \n \n \n Quick Links \n \n \n Campus Return \n \n Hotline \n \n UCR Daily Wellness Check Survey \n \n Human Resources COVID-19 Resources \n \n Student Health Services \n \n Campus Emergency Status \n \n Keep Teaching \n \n Keep Learning \n \n Keep Working \n \n Keep Researching \n \n Coronavirus Resources \n \n Face Covering Request \n \n Research Ramp Up \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Contact Us \n ehsPublicHealth@ucr.edu \n Report a Concern \n \n \n \n Request \n Disinfectant Kit \n Face Covering \n \n \n \n Resources \n Campus Return \n Research   \n Telecommute   \n Travel \n \n \n \n Health \n Daily Wellness Check  survey \n Symptom monitoring and reporting procedures  (SOP) \n Testing ( on-campus  |  off-campus ) \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n University of California, Riverside \n \n 900 University Ave. \n            Riverside, CA 92521 \n Tel: (951) 827-1012 \n \n \n UCR Library \n Campus Status \n Campus Store \n Career Opportunities \n Diversity \n Maps and Directions \n Visit UCR \n \n \n \n \n \n University of California, Riverside \n \n               Environmental Health & Safety \n             900 University Ave.              Riverside, CA 92521              \n  tel: (951) 827-5528                  fax: (951) 827-5122          email:  ehs@ucr.edu   \n \n \n  Find Us \n \n \n \n \n \n \n Related Links \n \n \n Coronavirus Resources & Updates \n \n Customer Service Satisfaction Survey for EH&S \n \n Emergency Management \n \n Fire & Life Safety \n \n Risk & Safety Solutions Web Application Log In \n \n Risk Management \n \n UC Police Department \n \n UC Risk & Safety Training \n \n \n \n \n \n \n \n \n \n \n \n \n \n Privacy Policy \n Terms and Conditions \n © 2021 Regents of the University of California \n \n \n \n \n \n \n \n \n \n \n × \n \n \n \n \n \n \n Let us help you with your search \n \n \n Enter your Search Criteria. \n \n \n \n Search All UCR \n \n \n Search This Site \n \n \n Cancel \n \n \n \n \n \n \n \n \n \n \n \n \n"
}