{
    "docno": "RJP200",
    "url": "https://guides.lib.ucr.edu/ebooks/IANEL",
    "text": "\n \n \n \n Internet Archive Open Library - Ebooks at UCR - Research Guides at University of California, Riverside Libraries \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Skip to main content \n \n    It looks like you're using Internet Explorer 11 or older. This website works best with modern browsers such as the latest versions of Chrome, Firefox, Safari, and Edge. If you continue with this browser, you may see unexpected results.\n \n \n \n \n \n \n \n \n \n \n \n UCR Library\n\t\t\t\t\t\t \n \n \n Research Guides\n\t\t\t\t\t\t \n \n \n Tools\n\t\t\t\t\t\t \n \n \n Ebooks at UCR\n\t\t\t\t\t\t \n \n Internet Archive Open Library\n\t\t\t\t\t \n   \n \n \n \n \n \n \n Search this Guide \n \n Search \n \n \n \n   \n \n \n Ebooks at UCR: Internet Archive Open Library \n \n Explains and lists what UCR has access to: e-packages and individual titles.  E-book information table. \n \n \n \n \n \n \n \n \n \n Overview \n \n \n \n \n Ebook Central \n \n \n \n \n EBSCOhost \n \n \n \n \n Internet Archive Open Library \n \n \n \n \n HathiTrust and ETAS \n \n \n \n \n Overdrive \n \n \n \n \n O'Reilly Learning (OHE) \n \n   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Internet Archive Open Library\n                                 \n \n \n \n The Internet Archive Open Library  is a collection of books available on a limited basis. \n UCR does not license or subscribe to this resource, as it is openly available. However, it is a significant collection and worth mentioning.  It is also a little complicated to use, so  this guide  might be helpful. \n Books are available to \"borrow\" and read once one has created an account and logged in.  However, downloading books requires users to utilize DRM software such as Adobe Digital Editions or Bluefire. \n \n \n \n \n \n \n \n \n \n Check out books\n                                 \n \n \n \n Unless you make an account and \"borrow\" a book, you might only be able to see a limited preview.  \n \n Make an account by clicking on  SIGN UP  on the top bar.  or log in if you have an account \n Click on  Read  under the book \n Click on  Borrow for 1 hour  \n If you need it for longer ,  you can then  Borrow for 14 days  (see instructions on downloading in the Downloading Box) \n \n A book may only be checked out by one user at a time and one user may only check out 10 books at a time. \n   \n   \n \n \n \n \n \n \n \n \n \n \n \n \n \n Reading Online\n                                 \n \n \n \n It is possible to either read IANEL books online or download them. The download process is cumbersome, and reading online might be the best option.  Enhance your reading experience with a few tips: \n \n Toggle \"fullscreen\" to make the actual book more prominent on your screen \n Select the number of pages you want to display at once \n Use the arrow keys to advance pages (The arrow keys on your keyboard work and might be easier) \n Zoom in if you find yourself straining to read the text \n If you are visually impaired, experiencing eyestrain, or would like to be able to multitask, try the read-aloud function.  It isn't perfect, but it is quite good. \n \n The above features can be found on this preferences bar in the lower right corner. \n \n \n \n \n \n \n \n \n \n \n Downloading into Adobe Digital Editions and/or Bluefire\n                                 \n \n \n \n If full book download is an option, it is possible that special software and authorization will be required. This software is to read files that have Digital Rights Management, a precaution some publishers put in place to protect the books from being redistributed widely on the internet.  This is the case with  ﻿ Ebook Central and EBSCOhost Books, as well as books from a few other sources. \n \n Download a free DRM Capable Application\n\t \n PC or MAC  -  Adobe Digital Editions (ADE) \n IOS or Android  - Bluefire (In Apps Store or Google Play) \n \n \n Open the file in ADE or Bluefire\n\t \n The first time you download and open a book, specify ADE or Bluefire and select Do this Automatically for files like this from now on. \n \n \n \n \n \n \n \n \n \n \n \n \n Using Adobe Digital Editions\n                                 \n \n \n \n \n When downloading your book, there may be an option to select PDF or EPUB. PDF preserves the original page formatting and numbering. EPUB scales better to smaller screens. Original page numbers sometimes show in the margins in EPUBs. \n You can open and close the side navigation/TOC menu by clicing on the ico that looks like a list. \n The easiest way to \"turn the page\" on PDF books is to use the mouse wheel. Clicking on the arrows is the only way to move forward and backward in an EPUB. \n You will always have the option to zoom/change text size and make bookmarks, but other features are available depending on how the book was created and the DRM.\n\t \n Highlight -  Select text and right click.  \n Bookmark  - click on the bookmark icon (near Library on the top menu) \n Annotate -  Right click and choose  Add note to text \n Zoom -  Choose the icon that looks like a piece of paper near the text search box \n Copy  (if possible) - Select text and right click -> copy, or ctrl+c \n Print  (if possible) - Choose File and then Print. Make sure to select the right pages. \n \n \n \n Note: It is not possible to export annotations, highlights etc., however they are saved in an annotation file on your computer.  Ask for help if you need it. \n \n \n \n \n \n \n \n \n \n Using Bluefire\n                                 \n \n \n \n \n Get the Bluefire app (free from the app store or Google Play), if you don't have it. \n Copying is done in the normal IOS or Android fashion. \n EndNote links are a little slow, and you have to hit them pretty exactly. \n Show page numbers in the margins to keep track of page numbers from original book. \n Bookmarks cannot be exported, but they do stay in subsequent checkouts. Delete the expired version before downloading a new one, to make sure this works. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n   <<  Previous:  EBSCOhost Next:  HathiTrust and ETAS >> \n \n \n \n \n \n \n Last Updated:   May 25, 2021 11:39 AM   \n \n URL:   https://guides.lib.ucr.edu/ebooks   \n \n  Print Page   \n \n \n Login to LibApps   \n \n \n \n \n \n Subjects:  \n General and Multidisciplinary Research \n \n \n Tags:  \n ebooks \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n"
}