{
    "docno": "RJP240",
    "url": "https://www.facebook.com/ucrlibrary/posts",
    "text": "\n UC Riverside Library - Posts | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home About Email Signup Posts Events Community Photos Videos Reviews Groups Live See more of UC Riverside Library on Facebook Log In or Create New Account See more of UC Riverside Library on Facebook Log In Forgot account? or Create New Account Not Now English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 UC Riverside Library June 9 at 12:00 PM  ·  Join us this spring quarter for monthly Geospatial / GIS Meetups on Apr. 20, May 18 & June 15 from 12-12:50 p.m.   https://gis-meetups-spring.eventbrite.com  Tentative topics:  April 20: Soil mapping with remote sensing and machine learning  May 18: GIS in support of public safety ...  June 15: TBD   See More UC Riverside Library June 9 at 11:34 AM  ·  We would like to recognize all of our library student employees, and celebrate those who will graduate with UC Riverside’s Class of 2021:  Haneen Abbas, Sabrina Aguilera, Hugo Arcos, Samantha Berrospe, Daphne Burnett, Nicholas Carter, Martin Cruz, Daniel Garcia, Ted Kim, Tim Koo, Terry Mach, Michaela Miller, Brenda Nguyen, Carol Rodriguez, Daysia Rodriguez, Sandra Samayoa, Jonathan Sanchez, Mina Shiratsuchi, Manasi Soni, Kathy Tran, Phyllis Ung, Lisette Ureno, Jasmine Vaquera, ...  Sebastian Vizcarra, Xeng Yang, and Jennifer Zhou.  Congratulations from all of us here at the UCR Library!   https://library.ucr.edu/…/celebrating-our-class-of-2021-lib…  PS: Please come visit us soon, sometime after campus reopens. We miss you already!   See More It looks like you may be having problems playing this video. If so, please try restarting your browser. Close Class of 2021: Library Student Employees Tribute Posted by  UC Riverside Library 11 Views UC Riverside Library June 8 at 1:00 PM  ·  Join us this spring quarter for The Carpentries' Hacky Hours every Wednesday from 1-3 p.m., beginning March 31.  Save your seat:  https://hackyhours-spring.eventbrite.com  These drop-in sessions are co-organized by UCR GradQuant and the UCR Library.   # rsworkshops   # ucriverside ...   # ucr   # ucrlibrary   # rside   See More UC Riverside Library June 4 at 10:29 AM  ·  UCR Library News | June 2021 -  https://mailchi.mp/c424d7b17063/june2021  Celebrating our Class of 2021 library student employees & graduates; limited in-person services coming in June; a new drive-up book return has been installed in Lot 1; Finals Week Stress Relief events and activities for spring quarter; and more! UC Riverside Library June 3 at 12:00 PM  ·  Join us this spring quarter for Digital Scholarship Meetups every other Friday from 12 - 1 p.m., beginning April 9.  Save your seat:  https://ds-meeteups-spring.eventbrite.com  Drop by to share & learn about digital research, pedagogy & publishing @ UCR. UC Riverside Library June 2 at 12:00 PM  ·  Join us this spring quarter for monthly Geospatial / GIS Meetups on Apr. 20, May 18 & June 15 from 12-12:50 p.m.   https://gis-meetups-spring.eventbrite.com  Tentative topics:  April 20: Soil mapping with remote sensing and machine learning  May 18: GIS in support of public safety ...  June 15: TBD   See More UC Riverside Library  was live. June 2 at 11:59 AM  ·  Where do you go if you have questions about books, how to do research, or how to find other resources in the library? You may already know about “Ask a Librarian” or “Chat with a Librarian\" -- but now you can even “Zoom” with a librarian over lunch! To register, please visit:  https://www.eventbrite.com/e/lunch-with-librarians-tickets-… It looks like you may be having problems playing this video. If so, please try restarting your browser. Close Lunch with Librarians - Peek Inside the Library Posted by  UC Riverside Library 338 Views 338 Views UC Riverside Library June 1 at 1:00 PM  ·  Join us this spring quarter for The Carpentries' Hacky Hours every Wednesday from 1-3 p.m., beginning March 31.  Save your seat:  https://hackyhours-spring.eventbrite.com  These drop-in sessions are co-organized by UCR GradQuant and the UCR Library.   # rsworkshops   # ucriverside ...   # ucr   # ucrlibrary   # rside   See More UC Riverside Library May 31 at 10:00 AM  ·  Today, the UCR Library honors the US Veterans who made the ultimate sacrifice.   # memorialday   # memorialday2021 UC Riverside Library May 29 at 9:00 AM  ·  The UCR Library catalog will be down from 6 p.m. PST on May 29 to 6 p.m. on May 30 for data migration. During this temporary outage, library patrons can use the Melvyl catalog to search for library resources.  See other service notifications here:   https://library.ucr.edu/about/service-notifications UC Riverside Library May 28 at 10:00 AM  ·  The UCR Library will be closed on Monday, May 31 in observance of Memorial Day. Services will resume on Tuesday, June 1.   # memorialday   # memorialday2021 UC Riverside Library May 27 at 3:00 PM  ·  Hey, Highlanders! You know how we like to hook you up with ALL the goodies during Finals Week Stress Relief. This quarter, the UCR Library has partnered with @ucrhub_programs to offer you even MORE chances to win during our FWSR Instagram giveaway. Like & follow both our profiles to get notifications, and visit  instagram.com/ucrlibrary  next Tuesday at 9 a.m., when the first comment-to-win post will go live. (Commenting here won't enter you to win.  🙁 ) Currently-enrolled UCR st ... udents will have 24 hours to enter, and NINE different chances to win a $25 Amazon or Visa gift card, between June 1 - 11, 2021!  🎁   💳   💰 💵  .  .  .  Good luck, both on the contest and on your finals!  🤞  We believe in you.  ❤️  You've got this!  🙌  .  .  .   # finalsweekstressrelief   # fwsr   # ucriverside   # ucr   # rside   # commenttowin   See More UC Riverside Library May 27 at 10:00 AM  ·  Join us this spring quarter for Lunch with Librarians, one meetup each month on Apr. 12, May 11, June 4 from 12-1 p.m.  Each meetup will start with a 15-minute presentation and then be open for general Q&A. For a list of topics & to save your seat:  https://lunch-with-librarians-spring.eventbrite.com UC Riverside Library May 26 at 10:31 PM  ·  Have you heard that the library has a new drive-up book return? Yep! It’s on the south side of Lot 1, beside the emergency call box on West Campus Drive. Now you can return library books without having to pay for parking! It looks like you may be having problems playing this video. If so, please try restarting your browser. Close New drive-up book return Posted by  UC Riverside Library 29 Views UC Riverside Library May 25 at 1:00 PM  ·  Join us this spring quarter for The Carpentries' Hacky Hours every Wednesday from 1-3 p.m., beginning March 31.  Save your seat:  https://hackyhours-spring.eventbrite.com  These drop-in sessions are co-organized by UCR GradQuant and the UCR Library.   # rsworkshops   # ucriverside ...   # ucr   # ucrlibrary   # rside   See More UC Riverside Library May 24 at 10:00 AM  ·  The UCR Library catalog will be down from 6 p.m. PST on May 29 to 6 p.m. on May 30 for data migration. During this temporary outage, library patrons can use the Melvyl catalog to search for library resources.  See other service notifications here:   https://library.ucr.edu/about/service-notifications UC Riverside Library May 21 at 5:00 PM  ·  Want to join the UCR Library team? We just posted an open position, Director of Teaching and Learning. See our other career opportunities & apply here:  https://library.ucr.edu/about/jobs UC Riverside Library May 21 at 12:00 PM  ·  Join us this spring quarter for Lunch with Librarians, one meetup each month on Apr. 12, May 11, June 4 from 12-1 p.m.  Each meetup will start with a 15-minute presentation and then be open for general Q&A. For a list of topics & to save your seat:  https://lunch-with-librarians-spring.eventbrite.com UC Riverside Library May 21 at 10:00 AM  ·  Join us for a game  of Kahoot! and socialize with your fellow Highlanders and the library's Finals Week Stress Relief committee. Three games on June 3, three chances to win Amazon gift cards and other cool prizes! Open to currently enrolled UCR students.  https://kahoot-spring.eventbrite.com See More \n \n \n"
}