{
    "docno": "RJP276",
    "url": "https://ehs.ucr.edu/coronavirus/events",
    "text": "\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Events & Gatherings | Environmental Health & Safety \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Skip to main content \n \n Planning Budget & Administration \n \n \n \n \n \n \n Report a Incident, Injury or Safety Concern \n \n \n Report a COVID-19 or Public Health Concern \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n UC Riverside \n \n \n \n \n  Environmental Health & Safety  \n \n \n \n \n \n \n \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n About EH&S \n \n \n Organizational Chart \n \n \n Programs & Policies \n \n \n Staff Directory \n \n \n Who Do I Call? \n \n \n \n \n How Can We Help? \n \n \n Programs & Policies \n \n \n Food Permit Request \n \n \n Hazardous Waste Pick Up \n \n \n Log into Chemicals, INSPECT, LHAT, & WASTe Apps \n \n \n Personal Protective Equipment (PPE) \n \n \n \n \n Programs & Services \n \n \n Training \n \n \n COVID-19 Prevention Training \n \n \n \n \n Report \n \n \n COVID-19 Concern \n \n \n Safety Concern \n \n \n Work Related Injury/Illness \n \n \n \n \n \n \n \n \n \n \n Report a Incident, Injury or Safety Concern \n \n \n Report a COVID-19 or Public Health Concern \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Face Coverings are required while on campus. Staff/Faculty may request a  face covering from EH&S . Students may request a  face covering from The Well . \n \n \n × \n \n \n \n \n \n \n \n \n \n \n Breadcrumb \n \n \n \n \n \n \n \n \n \n Coronavirus \n \n \n Events & Gatherings \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Events & Gatherings \n \nIn keeping with  State Guidance for Higher Education , it is required that event sponsors consider converting events to remote/virtual whenever possible. Business-related events should only be conducted when the purpose is best served by an in-person engagement. It is the responsibility of the UCR department sponsoring and/or hosting the event to  comply with the requirements listed in the  Event/Gathering Safety Checklist  and by following UC Riverside, UC Office of the President, California Department of Public Health, Riverside County, and Center for Disease Control and Prevention (CDC) guidelines. \n Definition \n University-Sponsored Event:  Any event that is held either on campus or at an off-site venue that is sponsored, co-sponsored, and/or funded by the university.  \n Recommendations:  \n COVID-19 preparedness is an evolving situation and, should the situation change, UCR will issue additional guidance regarding events/gatherings. Please let your participants know that you might need to cancel at the last minute and that they should consider making contingency plans. Individual departments and campus units may cancel specific events/gatherings at their discretion for business reasons or if they anticipate significant cancellations.  \n Process for Requesting Approval    \n All meetings and events must be  approved by their respective Unit Head in advance  of the meeting or event. For space reservations, follow the same reservation process used prior to the pandemic. \n Gathering Parameters and Occupancy Limits \n For more information, refer to  Campus Planning Framework . \n Guidance for all Events/Gathering Regardless of Attendee Count (see planning framework for the most up to date guidelines for indoor and outdoor gatherings) :  \n All event planners should consider the use of online technology for small meetings and events if it is feasible (e.g., teleconferencing, Zoom, Teams, etc.). When not feasible, event planners are responsible for the following preventative measures:\n\t Notify participants that events can be canceled at any time, depending on how the pandemic evolves. \n Design events to ensure proper social distancing and maintaining physical distancing between attendees \n Design events to ensure easy access to restroom facilities with sinks and/or alcohol-based sanitizer for proper hand hygiene for all attendees. \n Maintain an attendance list  of the meeting or event that includes names and contact information (phone number and/or email) for  one month. \n Adhere to  campus  face covering guidance. Provide face coverings to those who do not bring their own. \n Ensure event/gathering spaces and high-touch areas are cleaned after each event. \n Ensure that non-local attendees review and adhere to  UCR travel restrictions . \n \n For a gathering of any size, remind attendees that if they have any COVID-19 symptoms, including any respiratory symptoms or are feeling unwell in any way, they should not attend the meeting or event. If attendee begins to feel unwell while attending the event/gathering, Event Planners must ask the individual to leave the premises. If attendees test positive after attending the event, attendees should notify the COVID-19 Wellness Hotline at (844) 827-6827.  \n Consider moving events to larger venues to maintain proper distancing between tables, chairs, etc. \n Consider modifying or postponing high-touch, hands-on activities. \n When food and drinks must be provided, use individually wrapped items like bag lunches, individual water bottles, etc. Do not serve food where multiple hands will touch the food or serving utensils (e.g., buffet style, fruit platters, etc.). If buffet style dining is offered, food and drink must be served to guests (no self-service) and all guests must maintain physical distancing and face coverings. Event attendees and workers are only permitted to eat and drink in designated areas. For more information on catering options, refer to  Dining Services .  \n  Position venue room doors open and tightly control entry and exits to prevent concentrations of people at entry and exit. \n Consider density of guests in common spaces and bathrooms related to the event site when planning the event. \\Consider assign seating to control mixing and permit physical distancing of at least 6 feet between people.  \n Departments consisting of staff working on-campus that are gathering for critical/fundamental business purposes and/or trainings must have the following: \n\t Department has an approved worksite specific plan (WSSP) on file with EH&S. \n  All employees participating in the gathering have completed UCR-required COVID-19 Prevention training and the daily wellness survey. \n  All campus-wide COVID-19 guidance is adhered to for the duration of the gathering (face coverings, physical distancing, disinfecting/sanitization measures, etc.) \n \n Event planners are fully responsible for additional costs associated with Facilities Services, venue management and any other fees required for COVID-19 event safety such as, but not limited to, extended cleaning services, testing, security, staffing, etc.  \n Utilize this guideline complete the required risk assessment and physical space assessment to ensure all COVID-19 prevention measures stipulated in this guidance are achieved. \n All events must follow existing  campus policies .  \n EXCEPTIONAL APPROVAL: \n OFF-CAMPUS UNIVERSITY-SPONSORED EVENTS \nAt this time, off-campus university-sponsored events are not permitted unless express permission from Campus Executive Leadership. Complete this form which will be routed to the appropriate office for approval. \n NON-UNIVERSITY SPONSORED EVENTS \nUCR may host events operated by an external organization on a limited basis, only with the express permission from Campus Executive Leadership. Complete this form which will be routed to the appropriate office for approval. \n Responsibilities: \n EVENT PLANNER:  The Event Planner is responsible for ensuring COVID-19 prevention measures outlined in this guidance is followed and obtaining approval for the event/gathering from Unit Head. \n\n\t Obtain approval.   The Event/Gathering must be approved by Unit Head before the event/gathering can take place.   \n Submit a Reservation.  Submit a space reservation via the same process before the pandemic. \n Share the Plan.   Share expectations with event/gathering attendees.  \n Implement the Plan.   All Event Planners will be responsible for conducting periodic compliance monitoring measures such as spot checks of approved spaces to ensure that practices are compliant with this guidelines. \n \n UNIT HEADS:  All Unit Heads must assess the necessity for the event/gathering and ensure the plans meet COVID-19 prevention plan requirements. Units Heads must also be prepared to address compliance issues associated with not following approved plans. \n ATTENDEES:   All attendees must be made follow all COVID-19 prevention measures.   All attendees including staff must familiarize themselves with this guideline and follow the COVID-19 prevention plan procedures.  \n\t  \n \n \n \n \n \n \n \n \n \n \n \n \n \n Event/Gathering Safety Checklist  \n \n \n \n \n Campus Planning Framework \n \n \n \n \n UCR Events Calendar \n \n \n \n \n Campus Return \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n   \n Athletics \n February 10, 2021 :  UCR To Proceed with Spring Sports \n Campus Operations \n October 23, 2020:  UCR announces continuation of modified operations through winter quarter   September 4, 2020 :  Update on fall quarter campus plans June 4, 2020 :  Planning for Fall Quarter April 2, 2020:   Campus Closure Extended to June 19 March 25, 2020:  Campus Closure Building Access March 18, 2020:  Campus Closure Extended to April 30 March 19, 2020:   Academic Continuity and Campus Operations  \n Events \n May 7, 2021:   Update on In-Person Commencement May 22, 2020 :  Class of 2020 Online Celebration Date and Time Announced April 21, 2020:   Commencement 2020 Update April 15, 2020:   Highlander Orientation to be done remotely April 3, 2020:   Commencement 2020 update to campus \n Instruction \n All classes will continue to be available in remote formats, and any class approved to be offered in-person will accommodate students who cannot attend on-campus with a remote option. \n Only about 35 labs, field courses, and visual and performing arts courses will be offered in-person this fall. We will also provide a remote option for each of these classes. \n Undergraduate research  also must be conducted remotely in fall. If you are a graduate teaching assistant with questions about your teaching assignment for fall quarter, please contact your department or program. The Graduate Division also will post written guidance on its  website  for graduate students who plan to teach in the fall. \n Related Announcements: \n January 5, 2021:   Spring Quarter will continue to be remote November 30, 2020:  Campus update on winter quarter instruction October 2, 2020 :  Instructional planning for winter quarter September 1, 2020:   Campus Update on Fall Quarter Instruction August 6, 2020:   Provost's Update on Fall Quarter Instructional Planning June 17, 2020:   UCR Announces Fall Quarter Instruction Plans March 31, 2020 :  Remote instruction continuing for UCR Summer Sessions \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n University of California, Riverside \n \n 900 University Ave. \n            Riverside, CA 92521 \n Tel: (951) 827-1012 \n \n \n UCR Library \n Campus Status \n Campus Store \n Career Opportunities \n Diversity \n Maps and Directions \n Visit UCR \n \n \n \n \n \n University of California, Riverside \n \n               Environmental Health & Safety \n             900 University Ave.              Riverside, CA 92521              \n  tel: (951) 827-5528                  fax: (951) 827-5122          email:  ehs@ucr.edu   \n \n \n  Find Us \n \n \n \n \n \n \n Related Links \n \n \n Coronavirus Resources & Updates \n \n Customer Service Satisfaction Survey for EH&S \n \n Emergency Management \n \n Fire & Life Safety \n \n Risk & Safety Solutions Web Application Log In \n \n Risk Management \n \n UC Police Department \n \n UC Risk & Safety Training \n \n \n \n \n \n \n \n \n \n \n \n \n \n Privacy Policy \n Terms and Conditions \n © 2021 Regents of the University of California \n \n \n \n \n \n \n \n \n \n \n × \n \n \n \n \n \n \n Let us help you with your search \n \n \n Enter your Search Criteria. \n \n \n \n Search All UCR \n \n \n Search This Site \n \n \n Cancel \n \n \n \n \n \n \n \n \n \n \n \n \n"
}