{
    "docno": "RJP206",
    "url": "https://www.hathitrust.org/htrc",
    "text": "\n \n Our Research Center | www.hathitrust.org | HathiTrust Digital Library \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Skip to main content \n \n \n \n \n \n \n \n \n \n Home \n \n \n  Menu \n \n \n About  \n \n \n Welcome to HathiTrust \n \n \n Our Partnership \n \n \n Our Digital Library \n \n \n Our Collaborative Programs \n \n \n Our Research Center \n \n \n News & Publications \n \n \n \n \n Collections \n \n \n Help \n \n \n Feedback \n \n \n \n \n \n \n \n  Search  HathiTrust \n \n \n Log in \n \n \n \n \n \n \n \n \n \n \n HathiTrust Digital Library \n \n \n \n \n \n \n \n \n Search full-text index \n \n \n \n Search Field List \n \n All Fields \n Title \n Author \n Subject \n ISBN/ISSN \n Publisher \n Series Title \n \n \n \n \n \n Available Indexes \n \n Full-text \n \n Catalog \n \n \n \n Full view only \n \n \n \n \n \n  Search HathiTrust \n \n \n \n \n \n \n Advanced full-text search \n \n \n Advanced catalog search \n \n \n Search tips \n \n \n \n \n \n \n \n \n \n \n \n Main menu Our Membership \n Our Digital Library \n Our Collaborative Programs \n Our Research Center \n Help \n Welcome to HathiTrust! \n     \n About  › Our Research Center \n Our Research Center \n \n \n \n \n The HathiTrust Research Center (HTRC) enables computational analysis of the HathiTrust corpus. It is a collaborative research center launched jointly by Indiana University and the University of Illinois, along with HathiTrust, to help meet the technical challenges researchers face when dealing with massive amounts of digital text. It develops cutting-edge software tools and cyberinfrastructure to enable advanced computational access to the growing digital record of human knowledge.  Leveraging data storage and computational infrastructure at Indiana University and the University of Illinois at Urbana-Champaign, the HTRC builds tools and services for scholars to perform research using data from the HathiTrust Digital Library. The Center is breaking new ground in the areas of text mining and non-consumptive research, allowing scholars to fully utilize HathiTrust content while preventing intellectual property misuse within the confines of current U.S. copyright law. HTRC tools and services HTRC has developed a suite of tools and services for text data mining including web-based algorithms, freely-accessible datasets, and secure computing capsules. Access them from  HTRC Analytics . For more information, you can: Read a brief overview of the HTRC's  Collections and Tools  Find tutorials and detailed documentation in the  HTRC Documentation   Review the code that makes it all run on the  HTRC GitHub Learn More About Governance Architecture and Organization Access and Use Timeline and Deliverables Partnering in Research Non-Consumptive Use Policy Stay in touch Contact Us:  htrc-help@hathitrust.org . Join the User Group email list ( htrc-usergroup-l @ list.indiana.edu ) or Announcement email list ( htrc-announce-l @ list.indiana.edu ).    News and Updates \n \n \n \n \n \n   HTRC Awards 4 SCWAReD ACS Projects   \n \n   SCWAReD Advanced Collaborative Support Program: Call for Proposals   \n \n   ACS Request for Proposals: Spring 2020   \n \n   HathiTrust Research Center Awards Five ACS Projects   \n \n   ACS Request for Proposals: Spring 2019   \n \n   HathiTrust Research Center Executive Management Team Adds 4 New Members   \n \n   HathiTrust Research Center Awards Six ACS Projects   \n \n   Deadline Extended: HathiTrust Research Center (HTRC) Seeks Proposals for Advanced Collaborative Support (ACS) Projects   \n \n   Big (and Open) Data for Scholarship of All Sizes: A New Release of the HathiTrust Research Center Extracted Features Dataset   \n \n   Data to Insight Center to Host \"Data Quality in Era of Big Data\" Workshop   \n \n   HathiTrust Research Center Awards Four ACS Projects   \n \n   ACS Request for Proposals: Spring 2016    \n \n   HathiTrust Research Center Awards Three ACS Projects   \n \n   HTRC Services v3.0 in Beta Test through Jan 30 2015   \n \n   RFP: Advanced Collaborative Support for the HathiTrust Research Center   \n \n   Save the date! HTRC UnCamp, March 30-31, 2015   \n \n   HathiTrust Research Center Seeks a Manager of Operations and Lead R&D Architect   \n \n   HathiTrust Research Center Awarded Grant from National Endowment for the Humanities   \n \n   HTRC Alpha Release of Extracted Features Dataset   \n \n   HathiTrust Research Center Awards Four Prototyping Project Grants   \n \n \n \n \n \n \n \n    More News and Updates   \n \n \n Papers and Presentations \n \n \n \n \n \n   Introduction to the Hathi Trust Research Center Portal for Text Mining Research   \n \n   The HathiTrust Research Center: Big Data Analytics in a Secure Data Framework   \n \n   Sharing Collections through Shared Stewardship: A HathiTrust Progress Report   \n \n   Large-scale Text Analysis Through the HathiTrust Research Center   \n \n   Rethinking HathiTrust Metadata to Support Workset Creation for Scholarly Analysis   \n \n   HathiTrust Research Center: Technical Challenges   \n \n   Unlocking the Secrets of 3 Billion Pages: Introducing the HathiTrust Research Center   \n \n   Bridging Digital Humanities Research and Large Repositories of Digital Text   \n \n   HathiTrust and HTRC: the Changing Digital Library   \n \n   HathiTrust Research Center: The Workset Creation for Scholarly Analysis (WCSA) Prototyping Project   \n \n \n \n \n \n   \n 1 of 3 \n next › \n \n \n \n    More Papers and Presentations   \n \n \n Conferences and Meetings \n \n \n   \n \n \n \n \n \n   HathiTrust Research Center (HTRC) UnCamp 2018   \n \n   HTRC UnCamp 2015   \n \n   HTRC UnCamp 2013   \n \n   HTRC UnCamp 2012 Final Agenda and Presentations   \n \n \n \n \n \n   \n Printer-friendly version \n \n \n \n \n \n \n \n \n Search form \n \n Search About HathiTrust  \n \n \n \n \n \n   \n \n \n Our Research Center \n \n \n Governance \n Access and Use \n News and Updates \n Background and Activities \n Papers and Presentations \n Partnering in Research \n Collections and Tools \n HathiTrust Reseach Center Workshops \n Non-Consumptive Use Policy \n Call for Proposals \n Data Capsule Terms of Use \n Advanced Collaborative Support Program \n Conferences and Meetings \n \n \n \n \n   \n \n \n \n \n \n \n Home \n \n \n About \n \n \n Collections \n \n \n Help \n \n \n Feedback \n \n Accessibility \n \n Take-Down Policy \n \n \n Privacy \n \n \n Contact \n \n \n \n \n \n \n \n"
}