{
    "docno": "RJP280",
    "url": "https://heretohelp.ucr.edu/employee-resources/remote-work",
    "text": "\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Remote Work | Human Resources \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Skip to main content \n \n University of California, Riverside \n \n \n \n \n \n \n A-Z Listing \n \n \n Find People \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n UC Riverside \n \n \n \n \n  Human Resources  \n \n \n \n Helping employees maximize their potential \n \n \n \n \n \n \n \n \n \n \n \n About Us \n \n \n Campus Conversations - HR Summary \n \n \n Contact Us \n \n \n UCR Organizational Charts \n \n \n Org. Chart Submittal Guidelines \n \n \n \n \n \n \n HR News & Events \n \n \n HR Events \n \n \n HR News and Updates \n \n \n \n \n UCR Jobs \n \n \n HR Departments \n \n \n Employee and Organizational Development \n \n \n UCR Core Competency Model \n \n \n Course Catalog \n \n \n Leadership Skills Development \n \n \n Building Core Supervisory Competencies \n \n \n Management Skills Assessment Program \n \n \n People Management Certificate  \n \n \n \n \n My UC Career \n \n \n Online Learning Resources \n \n \n Professional Development Monthly \n \n \n Highlander Mentor Connection \n \n \n Transferable Skills Library \n \n \n UC Coro \n \n \n UC Women's Initiative for Professional Development \n \n \n UC Learning Center \n \n \n \n \n Employee and Labor Relations \n \n \n Collective Bargaining \n \n \n Collective Bargaining Agreements \n \n \n Union Contracts and Representative Contacts \n \n \n \n \n Corrective Action \n \n \n ELR Unit Assignments \n \n \n Employee Complaint Process \n \n \n Supervisor Resources \n \n \n \n \n Equal Employment and Affirmative Action  \n \n \n Talent Acquisition \n \n \n Contact Us \n \n \n College to Career Program \n \n \n Recruitment Policies & Procedures \n \n \n Remployment of UC Retired Employees into Staff Positions \n \n \n Rehire Retiree Pool Program \n \n \n Temporary Employment Services \n \n \n Temporary Worker Guidelines \n \n \n \n \n UCR Jobs \n \n \n UCR New Staff Orientation \n \n \n \n \n Total Compensation \n \n \n Benefits \n \n \n Chancellor's Recognition Program \n \n \n DBR Resources \n \n \n COVID-19 - Health Plan Updates \n \n \n \n \n Faculty Staff Assistance Program \n \n \n Health Care Facilitator \n \n \n Health and Welfare Plans \n \n \n New Faculty and Staff \n \n \n Retirement Gift Program \n \n \n Senior Managment Group Benefits \n \n \n UC Disability Benefits \n \n \n UC Retirement Benefits \n \n \n \n \n Classification & Compensation Services and Contracts \n \n \n Career Tracks \n \n \n Carrer Tracks Structure \n \n \n \n \n Classification of Positions & Process Overview \n \n \n Reclassification of Filled Positions \n \n \n Job Description Guidelines \n \n \n \n \n Series Concepts and Specifications/Job Standards \n \n \n \n \n Compensation \n \n \n Compensation - Philosophy \n \n \n Equity Increase & Equity Reviews \n \n \n Fair Labor Standards Act \n \n \n Other Compensation Actions \n \n \n Overtime \n \n \n Staff Appreciation & Recognition Plan \n \n \n Senior Managment Group \n \n \n \n \n \n \n Workplace Health and Wellness \n \n \n \n \n Resources \n \n \n Coronavirus (COVID-19) - Staff Information and Resources \n \n \n UCR COVID-19 Employee Emergency Fund \n \n \n UCR COVID-19 Symptom Monitoring and Reporting Procedures for Covered Employees and Supervisors \n \n \n Changes to UC Benefits / FSA Programs \n \n \n COVID-19 - UCR Staff Q & A \n \n \n Supervisor Guidance - New Hires During Campus Closure \n \n \n \n \n Employee Resources \n \n \n HR Tools \n \n \n Human Resources Management System \n \n \n HRMS FAQs \n \n \n \n \n \n \n Performance Management \n \n \n Pay for Performance \n \n \n Merit Program Guidelines \n \n \n Performance Management Timeline \n \n \n Performance Management FAQs \n \n \n Performance Management Resources \n \n \n Human Resources Business Partners \n \n \n SMG Performance Management \n \n \n Supervisor's Role \n \n \n Employee's Role \n \n \n \n \n Remote Work \n \n \n Supervisor Resources \n \n \n Supervisor Guidance - New Hires During Campus Closure  \n \n \n Employee Recognition \n \n \n Chancellor's Recognition Program \n \n \n Retirement Gift Program \n \n \n Staff Appreciation & Recognition Plan \n \n \n Staff Assembly Recognition Programs \n \n \n \n \n Layoff Information: Supervisors \n \n \n Working With Vets, Military Members & Military Families \n \n \n \n \n \n \n Policies \n \n \n A-Z Policies and Procedures Finder \n \n \n \n \n UCPath @UCR \n \n \n Forms and Documents \n \n \n Accommodations \n \n \n Benefits \n \n \n Education & Development \n \n \n Employee & Labor Relations \n \n \n General Administration \n \n \n Leave of Absence \n \n \n Performance Management \n \n \n Salary Information \n \n \n Talent Acquisition/Diversity Outreach \n \n \n Work/Life \n \n \n \n \n \n \n \n \n \n \n A-Z Listing \n \n \n Find People \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Breadcrumb \n \n \n \n \n \n \n \n \n \n Employee Resources \n \n \n Remote Work \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n   \n   \n Remote Work \n UCR strives to be an employer of choice, providing flexibility in line with today’s workforce needs \n At UCR we also want to unearth new discoveries, deliver a high-quality educational experience, and provide services in support of student success. Ultimately, we need to consider work location in the context of both individual performance and community. How location impacts colleagues, professional development, our collegial network, output, space constraints, and sustainability goals are all to be considered. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n   \n \n \n \n \n \n \n \n \n \n \n \n \n What We Learned \n On March 13, 2020, we received notice that we were to limit all campus activities to personnel supporting essential activities and all other personnel were required to work remotely. In a short period of time, we learned that many jobs could be performed effectively in a remote setting. \n For some, the flexibility of working from home afforded opportunities for better work-life balance while performing their jobs, and for others there were challenges to overcome. Our faculty, staff, and students have been incredibly productive over the past 14 months. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n   \n \n \n \n \n \n \n \n \n \n \n \n \n Moving Forward with Flexibility: \n As we expand on-campus operations, we intend to do so through a model of shared responsibility. We must be inclusive, thoughtful, and strategic in considering how to best move forward. It is also important to consider that what has worked while the majority of campus and instruction was remote, may not work when we return to more normal campus density and in-person instruction. \n The campus is committed to remote delivery for spring and summer quarters, and we now estimate approximately 85% in-person instruction for fall 2021. It is important to evaluate what staffing is needed on campus in order to serve the students, faculty and staff for a repopulation of the campus. Units that must have staff on campus for the fall quarter, as determined by unit leadership, will need to assure some gradual transition back to campus for their staff, well in advance of the fall quarter start date. \n Alternative (Flexible) Work Schedules Guidelines \n Systemwide Human Resources has recognized the need to provide written guidance for locations to make the best decisions they can regarding flexible work, and has prepared “Guidance Regarding Flexible Work for Staff.” \n Memo Cheryl A. Lloyd, Interim Vice President, Systemwide Human Resources \n Guidance Regarding Flexible Work for Staff \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n   \n   \n   \n \n \n \n \n \n \n \n \n \n \n \n \n Local Decision Making:\n\n The  Chancellor has asked  every vice chancellor and dean begin conversations within their units to determine needs and plans. The campus will not impose work location decisions on any college, school, or unit, but will instead support local decisions that serve the interest of our mission. \n Between now and July 1, most staff will likely continue in their current work arrangements as they have during the pandemic. Between July and the start of fall quarter, 2021, a return to campus will be implemented based on several guiding principles, which will be developed through a process that allows for feedback as well as consideration of the specific duties and responsibilities for the individual work units.   \n Timing for any return to campus will be driven by operational needs and the recognition that these needs differ across units and some employees may return to campus sooner than others. \n Discussions should occur between the employee and their supervisor(s), and in order to help address overall consistency and equity within the organizational unit, it is recommended that the chain of command of supervisors be involved. These discussions should be initiated as soon as possible, if they have not already been ongoing. As we work through this transition to normal operations, we will continue to look at effective options to increase consistency across organizational units within the campus. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n   \n   \n \n \n \n \n \n \n \n \n \n \n \n \n A Deliberate Process: \n We do not anticipate an abrupt return to campus as the pandemic comes under control. This transition back to campus also will not be without challenges, however we know will get there through a collaborative process that embodies a shared sense of responsibility. Managers will do their best to provide 30 days advance notice of changes to current work arrangements and afford flexibility for staff.  \n A work schedule that includes some hybrid (or use flexible) remote options can be beneficial for employee recruitment and retention, and employee engagement and well-being, if feasible relative to addressing institutional requirements. However, in some cases an all-remote work schedule may not be optimal for the department and University. The specific duties and responsibilities of a position dictate whether remote work is an option. \n Supervisors and employees should work together to assess flexible workplace options, manage workload, set expectations, and maintain communications, whether the employee is working in a remote or hybrid-remote environment, or utilizing another flexible arrangement. \n The guidance will likely continue to change based on new information. It is difficult to project what the public health guidance will be for September. We will continue to follow the public health guidance relative to parameters for a safe campus operation. The fall quarter may be a transition from a pandemic to a more normal environment, and we encourage employees and supervisors to continue to evaluate and discuss the work schedule through the fall and beyond. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Remote Work Resources \n \n \n \n \n \n \n \n   \n Alternative (Flexible) \nWork Schedules \n \n \n \n \n \n \n \n Each day staff face the challenge of balancing their family and work responsibilities. Our campus is committed to policies and programs that enable staff to be productive members of the campus community and to meet their family care obligations. Alternate Work Schedules are a part of the campus Work/Life program and allow staff and departments some flexibility in defining when, where and how work is done. This flexibility is a critical driver of employee well-being and performance and is responsive to the changing professional and personal demographics of the multi-generational workforce. \n The alternate work schedules available at UCR include the compressed workweek, flextime and telecommuting. When properly managed, alternate work schedules have been shown to increase productivity, increase employee engagement and retention, provide extended coverage and cross training opportunities, and decrease unplanned absences. In addition, it promotes diversity, and has a positive impact on workplace culture and employee morale. For many people, even a small amount of flexibility can make a tremendous difference in successfully balancing responsibilities at work and at home. Flexible work arrangements are not an employee entitlement or requirement, but a work assignment mutually agreed to by the employee, supervisor and department head. The arrangement must be in the best interest of the University. The focus in flexible work arrangements must be on results. \n Eligibility \n Non-represented employees are eligible to request alternate work schedules. Represented employees may participate as allowed by their respective collective bargaining agreements. An employee initiates the request for an alternate work schedule by submitting a proposal to their supervisor and/or unit/department head. \n Forms and Documents \n The Alternative Work Schedule Considerations \n The Alternative Work Schedule Considerations provides a list of items to consider when arranging for an alternative work schedule:  Alternative (Flexible) Work Schedule Considerations \n Alternative (Flexible) Work Schedules - Exempt Employees  \n This local Compressed Workweek Guideline for exempt employees, is designed for departments to use as a tool to efficiently implement compressed workweek schedules:   Compressed Workweek Guideline – Exempt Employees \n This Alternative Work Schedule Agreement for exempt employees specifies the conditions applicable to an alternative work schedule arrangement:   Alternative (Flexible) Work Schedule Agreement – Exempt Employees \n Alternative (Flexible) Work Schedules - Non-Exempt Employees  \n This local Compressed Workweek Guideline for non-exempt employees, is designed for departments to use as a tool to efficiently implement compressed workweek schedules :  Compressed Workweek Guideline – Non-Exempt Employees \n This Alternative Work Schedule Agreement for non-exempt employees specifies the conditions applicable to an alternative work schedule arrangement:   Alternative (Flexible) Work Schedule Agreement – Non-Exempt Employees \n Alternative (Flexible) Flextime Schedule Guidelines \n This local  Flextime Guideline for both exempt and non-exempt employees is designed for departments to use as a tool to efficiently implement flextime schedules:   Flextime Guideline for Exempt & Non-Exempt Employees \n \n   \n \n \n \n \n \n \n   \n Telecommuting \nGuidelines & Agreement \n \n \n \n \n \n \n \n Telecommuting Policy \n \n UCR Local Procedure - Telecommuting Procedure for Staff Member \n \n Telecommuting Forms and Documents \n Selection Criteria for Successful Telecommuting Guidelines \n Mandatory Telecommuting agreement \n Authorization to Use University Property in an Off-Campus Location  \n \n   \n \n \n \n \n \n \n   \n Stay \nConnected \n \n \n \n \n \n \n As a first step in preparing for employees to return to campus please review the  Coronavirus  and  Campus Return  sites and follow all necessary steps for a safe return including COVID-19 training, masking, proper hand hygiene and completing the daily wellness check. All supervisors must complete and submit an online  Work Site Specific Plan . This is the requirement as of the date of these guidelines, but it may change with more direction from the state and CalOSHA. \n   \n \n \n \n \n \n \n   \n Working Healthy \nat Home \n \n \n \n \n \n \n \n Working Healthy at Home \n A series of tips, resources and webinars from the UCR Faculty/Staff Wellness Program and Healthy Campus aimed to help you and your family navigate challenges with staying healthy while working from home. \n \n \n Working Healthy at Home - How to get started \n Taking Care of Your Behavioral Health \n Resources for Equipment-Free Workouts \n How to Boost Your Mood - Happiness Hacks \n Taking Care of Your Behavioral Health \n Prevention and Safety Reminders \n Stay Well Tips from Environmental Health & Safety \n Ergonomic Tips for Working Remotely \n Healthy Snacks, Meals and Grocery List \n Gardening Tips \n Eating Towards a Healthy Immune System \n \n \n Ways to Social and Keep Your Distance \n Working from Home With Kids \n Healthy Foods You Can Use \n Ways to Maximize Working Remotely \n COVID-19 Prevention & Well-Being Newsletter \n Plan, Shop, Save and Cook Healthy Eating at Home \n Getting Through the Tough Times \n Financial Wellness \n Healthy Tips You Can Do at Home \n Suicide Prevention and  Recovery Month \n Tips for Working/Studying at Home - Micro Lifts \n \n \n Mental Health \n \n Taking Care of Your Health and Well-Being During COVID-19 -  UCR Healthy Campus is offering a webinar series with expert leaders to provide us with information, tools, and resources, as we transition into this new way of life. \n \n Webinar 1 - Dealing with Uncertainty in the Era of COVID-19 \n Webinar 2 - Attending to Your Health and Well-Being during COVID-19 \n Webinar 3 - Staying Mentally Well in the Age of COVID \n Webinar 4 - Thinking About Students’ Social and Emotional Health in COVID-19 \n \n \n Ergonomics \n \n Working Remotely provides useful tips and simple strategies to improve your ergonomics and your work-from-home (or from any remote location) experience. \n \n Ergonomics - Working Remotely \n YouTube Video - Working from Home \n \n Working Remote Tips \n \n   \n \n \n \n \n \n \n \n   \n IT Resources \nWorking Remotely \n \n \n \n \n \n \n \n To support staff who may begin working remotely in light of COVID-19 and UC Riverside’s commitment to ensuring a safe and healthy environment for the Highlander community, Information Technology Solutions (ITS) has compiled a list of basic IT resources on the  Keep Working webpage . These resources provide information on how to access and use essential IT tools when working remotely. \n Clarification On Remote Work Options for Staff \n \n   \n \n \n \n \n \n \n \n   \n HR \nResources \n \n \n \n \n \n \n \n HR Resources for Working Remotely \n F aculty Staff Assistance Program \n Employee & Organizational Development - Professional Development Monthly (see remote/hybrid online Resources) \n How to Do Hybrid Right (Harvard Business Review) \n Tips for Working Healthy at Home  \n UCR HR Ergonomics \n \n   \n \n \n \n \n \n \n   \n Reimbursable Expenses/ \nItems Purchased for \nRemote Work \n \n \n \n \n \n \n \n Reimbursable Expenses/Items Purchased for Remote Use \n Employees working from home or other alternate locations are not on travel status and not eligible for meal reimbursement. Similarly, meals taken at home or other alternate locations (or delivered) during a Zoom business meeting are not reimbursable based on guidance received from the UC Office of the President, per policies G-28 and BUS-79. \n Only business-related non-inventorial equipment that can be returned to the office at the end of the arrangement should be purchased using normal procurement methods, and either picked up by the employee or shipped to their home address.  Department financial officer/managers must have processes in place to track the location of these assets and ensure their return at the end of the remote assignment. \n If any purchased item needs to be installed, charges related to the installation are the responsibility of the employee. \n Other expenses (e.g. utilities, rent, furniture, etc.) related to remote work are not eligible for direct purchase nor reimbursable. \n Departments will evaluate on a case-by-case basis where the direct purchase and/or reimbursement is necessary for employees with specific needs not already met with existing resources and only allowable if the University-issued office equipment (e.g., computer, printer, keyboard) cannot be relocated or the employee does not already have personal equipment at the alternate worksite to enable them to perform their work duties. \n An employee may request reimbursement for the business use of an internet or similar service if it is needed for the employee to perform their job duties and it would not be practicable or cost-effective for the University to separately purchase and the internet or similar service does not currently exist in the employee’s alternate remote workspace. Reimbursement shall be made for partial business use of internet, cellular or similar services purchased with an employee’s own funds if the individual incurs additional charges over the plan limit related solely to the business use. An employee may request reimbursement for the business use of a cellular phone or similar device purchased with the employee’s own funds if the individual incurs additional charges. In such a case, the reimbursement will be at the excess minute rate, contingent upon receipt of supporting documentation. No reimbursement will be made for business calls or a percentage of total business calls made within the package minutes covered under the employee’s plan. \n Expenses will be reimbursed only if the manager agrees to the purchase in advance. Below are University of California policies on reimbursable expenses: \n Travel Regulations \n Expenditures for Business Meetings, Entertainment, and Other Occasions \n Guidelines for the Purchase and Use of Cellular Phones and Other Portable Electronic Resource \n For questions or additional information, please visit  UCR Business & Financial Services . \n \n   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n University of California, Riverside \n \n 900 University Ave. \n            Riverside, CA 92521 \n Tel: (951) 827-1012 \n \n \n UCR Library \n Campus Status \n Campus Store \n Career Opportunities \n Diversity \n Maps and Directions \n Visit UCR \n \n \n \n \n \n \n \n \n  Department Information \n   \n Mailing Address: \n UCR Human Resources \n900 University Avenue, Riverside, California 92521 \n Location Address: \n University Village \n1201 University Avenue, Suite 208 \nRiverside, California 92521 \nTel: (951) 827-5588 | Fax: (951) 827-2672 \n \n \n \n \n \n \n \n \n \n \n Related Links \n Academic Personnel \n UCOP Human Resources \n Business and Administrative Services \n UCPath@UCR \n UCR Post Employment Benefits \n \n \n \n \n \n \n \n \n \n \n \n \n \n Privacy Policy \n Terms and Conditions \n © 2021 Regents of the University of California \n \n \n \n \n \n \n \n \n \n \n × \n \n \n \n \n \n \n Let us help you with your search \n \n \n Enter your Search Criteria. \n \n \n \n Search All UCR \n \n \n Search This Site \n \n \n Cancel \n \n \n \n \n \n \n \n \n \n \n \n \n"
}