{
    "docno": "RJP278",
    "url": "https://ehs.ucr.edu/coronavirus/campus-news",
    "text": "\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Coronavirus Campus News & Updates | Environmental Health & Safety \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Skip to main content \n \n Planning Budget & Administration \n \n \n \n \n \n \n Report a Incident, Injury or Safety Concern \n \n \n Report a COVID-19 or Public Health Concern \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n UC Riverside \n \n \n \n \n  Environmental Health & Safety  \n \n \n \n \n \n \n \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n About EH&S \n \n \n Organizational Chart \n \n \n Programs & Policies \n \n \n Staff Directory \n \n \n Who Do I Call? \n \n \n \n \n How Can We Help? \n \n \n Programs & Policies \n \n \n Food Permit Request \n \n \n Hazardous Waste Pick Up \n \n \n Log into Chemicals, INSPECT, LHAT, & WASTe Apps \n \n \n Personal Protective Equipment (PPE) \n \n \n \n \n Programs & Services \n \n \n Training \n \n \n COVID-19 Prevention Training \n \n \n \n \n Report \n \n \n COVID-19 Concern \n \n \n Safety Concern \n \n \n Work Related Injury/Illness \n \n \n \n \n \n \n \n \n \n \n Report a Incident, Injury or Safety Concern \n \n \n Report a COVID-19 or Public Health Concern \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Face Coverings are required while on campus. Staff/Faculty may request a  face covering from EH&S . Students may request a  face covering from The Well . \n \n \n × \n \n \n \n \n \n \n \n \n \n \n Breadcrumb \n \n \n \n \n \n \n \n \n \n Coronavirus \n \n \n Coronavirus Campus News & Updates \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Latest updates from campus on COVID-19 \n Additional information can also be found at   Campus Return.  \n May 27, 2021:   UCR guidelines for events/gatherings The UC Riverside Operational Continuity Working Group has issued campus events and gatherings guidelines, including a gatherings checklist and approval process. \n  \n May 26, 2021:   Chancellor Update Chancellor Wilcox provides campus update on Fall Planning, Commencement, remembering George Floyd, Staff Assembly, and more.   \n  \n May 26, 2021:  Campus Return Updates Updates from Research Ramp-up, COVID Management, sand Operational Continuity. View the   webinars on You Tube . May 20, 2021:  Return to Campus Working Group Webinars View the Return to Campus Working Group  webinars on You Tube May 19, 2021:   Campus Return Updates Updates from the five campus working groups to plan for the fall and the transition to returning to campus. \n May 19, 2021:  Student Instruction for COVID-19vaccination proof of completion The university is encouraging students to get a vaccination prior to our return to campus in fall. Vaccinations can be obtained through local pharmacies, including CVS and Walgreens, county clinics, in addition to your primary healthcare provider.   \nMay 19, 2021:   Vaccine Tracking Form   The COVID-19 Vaccine Tracking form is intended to collect the COVID-19 immunization records for UCR faculty, staff, student workers, and volunteers as part of a process to safely return to campus. All health information [voluntarily] provided by you in the form will remain confidential.  \n  \n May 19, 2021:  Campus Planning Framework You can view the current campus planning framework, updated 05/19/2021. May 18, 2021:  Campus sees drop in COVID-19 cases while vaccination rates rise Since mid-April, UC Riverside has had only a handful of positive COVID-19 cases, continuing a rapid decline that began in January . \n  \n May 12, 2021:  COVID-19 Vaccine Tracking Form The UC Office of the President recently shared the details of a proposed policy on COVID-19 vaccination for employees and students at all University of California campuses. While the policy has not yet taken effect, we are preparing for the likelihood of the policy’s adoption. \n  \n May 12, 2021:  Campus return updates for May 12 UC Riverside has created five campus working groups to plan for the fall and the transition to returning to campus. \n  \n May 10, 2021:  Campus buildings access remains limited Although UC Riverside is planning for a safe return to campus this fall, access to campus buildings and other facilities remains limited for now and should be arranged in advance. \n   \n May 4, 2021:  FAQ's available for UC Proposed Vaccination Policy Frequently asked questions regarding the University of California Proposed Vaccine Policy is now available for  Faculty and Staff  as well as  Students . \n April 29,  2021:  Chancellor's Update - April 2021 Chancellor Wilcox shares an update to the campus on recent events, including Violence against Asian/Americans and Pacific Islander community, the Chancellors Committee on the Status on Women, the Accellion data breach, leadership office hours and Sustainability.  \n  \n April 27, 2021:   FAQ on UC's proposed COVID-19 vaccination policy The University of California last week shared the details of a proposed policy on COVID-19 vaccination as part of its engagement with its community as it joins the California State University in supporting immunizations as part of an expected return of students, faculty, academic appointees and staff to in-person instruction across the state this fall. \n  \n April 27, 2021 :  Return to campus working group briefings begin this week Each of the Return to Campus working groups will deliver a briefing for the campus community about their planning efforts for the fall.  \n  \n April 22, 2021:  UC encourages COVID-19 vaccinations for university communities while reviewing policy requirements The University of California today (April 22) shared the details of a proposed policy on COVID-19 vaccination as part of its engagement with its community as it joins the California State University in supporting immunizations as part of an expected return of students, faculty, academic appointees and staff to in-person instruction across the state this fall. \n  \n April 21: 2021:  Campus Return Update 4/21 Each of the Return to Campus working groups will deliver a briefing for the campus community, which will be available for viewing on the UC Riverside   YouTube channel . \n  \n April 15, 2021:   Chancellor Wilcox talks about returning to campus A video message from the Chancellor about returning to campus this fall. \n  \n April 14, 2021:   Campus return updated for April 14 UC Riverside has created five campus working groups to plan for the fall and the transition to returning to campus. Read the latest updates from the working groups. \n  \n April 13, 2021:   Labs may increase density up to 50% maximum occupancy Effective immediately, the UCR Research Ramp-up Committee has approved all laboratories on campus with an updated  Work Site Specific Plan (WSSP)  to increase their personnel density up to 50% of maximum occupancy. The decision applies to all labs, including dry/computational labs which may have been closed up to this point, and all lab personnel — faculty, staff, postdoctoral researchers, and graduate/undergraduate students.  Learn more  about Research Ramp Up Committee. \n  \n April 9, 2021:  Commencement Follow-up for Graduating Students Clarification on a few key points regarding commencement. \n   \n April 8, 2021:  California Assembly Bill 685 - Request for Anonymity on COVID-19 Notifications to Unions \n This communication is to inform you of required union notifications related to positive cases of COVID-19.  \n  \n April 7, 2021:   Campus return updates for April 7 UC Riverside has created five campus working groups to plan for the fall and the transition to returning to campus. \n  \n April 7, 2021:  In-person Commencement activities, classes of 2020 and 2021 Recommendations from the Commencement Task Force for limited, in-person commencement activities for the graduating classes of 2021 and 2020. April 6: 2021:   UC COVID-19 related leaves Recent guidance on University of California’s (UC) COVID-19 Related Leaves for policy-covered and represented staff employees. \n  \n March 31, 2021:  Campus return updates for March 31 UC Riverside has created five campus working groups to plan for the fall and the transition to returning to campus. \n  \n March 29, 2021:   Undergraduate researchers back to campus The Research Ramp-up Committee has carefully evaluated the situation and has approved the return of undergraduates under the following conditions and process. \n  \n March 29, 2021:  Student Recreation Center to open March 29 at limited capacity Opening of the Student Recreation Center (SRC) beginning Monday, March 29 at limited capacity. \n March 25, 2021 :  Resource Management Services are now available on a limited capacity Facilities Services is happy to announce the return of our Resource Management staff \n  \n March 24, 2021:   Personnel/Human Resources Practices Update Update on Personnel and Human Resource interim practices effective April 1, 2021 \n  \n March 17, 2021:   Clarification on COVID-19 paid time off UCOP issued further clarification on paid time off. \n  \n March 12, 2021 :  New Pandemic Relief for Flexible Spending Arrangement (FSA) Participants Update on Flexible Spending Arrangements (FSA) for participants. \n  \n March 4, 2021:  COVID-19 Guidance Resources View and download guidance on   returning ,  testing   and   supervisor responsibilities.   \n   \n March 4, 2021:   Temporary approval to use accrued sick leave for child care reasons due to COVID-19 Update for employees on use of sick leave for child care reasons due to COVID-19 . \n   \n March 3, 2021:   All UCR Employees Eligible for vaccine All UCR employees may now obtain a COVID-19 vaccine under state guidelines making those in the education sector eligible. Find out more about how and where to get vaccinated. \n  \n March 2, 2021:  Fall 2021 Instruction Plan Update on Fall 2021 Instruction Plan \n  \n February 19, 2021:  COVID-19 vaccine update Update on COVID-19 vaccine available at UCR Health. \n  \n February 1, 2021:  Updated COVID-19 prevention training Campus wide announcement of the updated COVID-19 prevention training. \n  \n January 27, 2021 :  Chancellor Update Chancellor Wilcox shares an update to campus on Distinguished Lecture, Living the Promise campaign celebration weekend, Virtual Office hours, Strategic Plan, Campus Safety Rask Force, and the Employee Emergency Fund.    \n   \n January 26, 2021 :  Access to COVID-19 vaccines on campus Update to access to COVID-19 vaccines on campus \n   \n January 26, 2021 :  Interim Policy Revision - Travel Risk Reduction Update on interim policy on Travel risk Reduction (900-25) \n   \n January 19, 2021:   COVID-19 vaccine update Chancellor Wilcox provides update on COVID-19 vaccine \n  \n January 14, 2021:   State Budget Update Chancellor Wilcox gives an update on the Governor's proposed state budget. \n  \n January 11, 2021:   UC plans for fall 2021 in-person instruction across its 10 campuses Announcement from UC Office of the President \n  \n January 11, 2021:   COVID-19 campus update COVID-19 Campus update from Kim Wilcox, Thomas Smith, and Deborah Deas. \n   \n January 5, 2021:  Spring quarter instruction will continue to be remote Thomas Smith Interim Provost And Executive Vice Chancellor provides update on spring quarter instruction.  \n  \n December 15, 2020:  COVID-19 drive-thru testing site to open on campus Partnership with city provides free self-administered tests. \n  \n December 11, 2020:   President’s Job Protection Program Human Resources shares information on UCOP's \"curtailment\" program. \n  \n December 1, 2020:   Employee Flu shot clinic available UCR Health is offering UCR faculty and staff exclusive and convenient access to free flu shots located at UCR Health Multispecialty Center. \n  \n November 30, 2020:  Campus update on winter quarter instruction Campus update on winter quarter instruction including continuation of remote learning, updated schedule of classes and requests for winter quarter instructors. \n  \n November 25, 2020:   Chancellor's Update Chancellor Wilcox shares an update to the campus including Thanksgiving holiday message, Provost announcement, Student Success Center update, Budget update, and more. \n  \n November 20, 2020:  Thanksgiving Travel Due to the latest increase in positive cases, new procedures are in place to keep the UCR community safe. \n  \n November 18, 2020 :   Budget adjustments \n Chancellor and Provost respond to Budget Advisory Committee report on current financial challenges. \n  \n November 17, 2020:  California COVID Notify UC Riverside has joined other University of California campuses and the California Department of Public Health to pilot a program aimed at limiting the spread of COVID-19. \n   \n November 13, 2020:  Tri-state order California, Oregon, and Washington issue travel advisories recommending 14-day quarantines for inter-state and international travel. \n   \n October 26, 2020:  Required Worksite Specific Plan Centralized Process Launched Centralized process announced for Worksite Specific Plans submissions prior to returning to campus or continuing working. \n   \n October 23, 2020:  UCR Announces Continuation of Modified Operations Through Winter Quarter UCR will continue the same modified operations for winter quarter.  \n   \n October 1, 2020:  UCR Employee 2020-21 Flu Vaccine Requirement Introduction to the Employee Flu Vaccination Requirement Form to confirm receipt of the flu vaccination for 2020-21. \n  \n September 2, 2020:  COVID-19 Testing on Campus Summary of groups on campus who are required to undergo COVID-19 testing through our on-campus lab. \n  \n September 16, 2020:  Safety plans in place for Student Housing Reduced numbers, regular coronavirus testing, and smaller groups are key parts of the plan for fall student housing. \n  \n September 16, 2020:   COVID-19 lab begins testing Campus began testing students, staff, and faculty members for the coronavirus with the opening of a new diagnostic lab on campus. \n  \n September 14, 2020:   Employee Flu shot clinic available UCR Health and Kaiser Permanente is offering free flu shots to employees. \n  \n September 8, 2020:   Student Flu Shot Clinic from Student Health Services All UCR current registered students are required to have their flu shot for the 2020-2021 school year. SHS is offering flu shots with an appointment. \n  \n September 4, 2020:   Update on Fall Quarter Campus Plans \n Chancellor Wilcox shares an update to the campus fall quarter instructional guidelines. \n  \n September 1, 2020:  Facilities Services offering free hand sanitizer to on campus employees \n In an effort to help UCR staff remain safe and healthy, Facilities Services is providing hand \nsanitizer for use in campus facilities. \n  \n September 1, 2020:   Campus Update on Fall Quarter Instruction \n Interim Provost And Executive Vice Chancellor Thomas Smith provides the campus update for fall quarter instruction. \n   \n August 27, 2020:   Chancellor's Budget Update \n Chancellor Wilcox shares an update to the campus on the budget.  \n  \n August 21, 2020:   Daily COVID Wellness Survey / Version 2.0 A new and improved version of the survey is being released for all employees, students, contractors, and vendors. \n  \n August  20, 2020:   Chancellor Update  - August 2020 Important information on construction progress, fall quarter update, testing lab, budget update, staff organizations, and summertime. \n  \n August 7, 2020:  New flu vaccination requirement for UC students, faculty and staff. To support the health and well-being of UC students, faculty and staff and our communities, the University of California, in consultation with UC Health leadership, has issued a systemwide executive order requiring all members of the UC community to receive an influenza immunization before Nov. 1, 2020. \n  \n August 6, 2020:   Provost Update Important information on Fall Quarter Instructional Planning. \n  \n August 5, 2020:    New campus signs and posters help navigate COVID-19 safety rules A new signage program at UC Riverside will provide an easier way to navigate health and safety rules on campus due to COVID-19. \n  \n August 4, 2020:    Face coverings available for UCR employees coming to campus  to work To support face covering requirements, Environmental Health & Safety continues to provide face coverings for UCR employees at no charge.  \n  \n August 3, 2020:  New campus signs and posters help navigate COVID-19 safety rules A new signage program at UC Riverside will provide an easier way to navigate health and safety rules on campus due to COVID-19. \n  \n July  29, 2020:   Relocating equipment to remote sites Guidance on university-owned equipment and assets permitted to be used in remote locations.  \n  \n July 24, 2020:   University Budget Update View the video update from Chancellor Kim Wilcox and Vice Chancellor and CFO Gerry Bomotti.  \n  \n July 17, 2020:   Scheduling and remote flexibility Chancellor and Provost message on scheduling and remote flexibility. \n  \n July 16, 2020:   Campus Symptom Tracking New procedure for all UCR employees (defined as faculty, staff, student interns and student workers) who are coming to work in UCR campus facilities will be required to monitor themselves for symptoms of the coronavirus and will be required to receive a clearance certificate daily. \n  \n July 1, 2020:   Transportation and Parking Services/Fleet Services COVID-19 Information Changes to TAPS operations to increase online services and facilitate social distancing. \n  \n June 29, 2020:   Return to Work Guide University releases a guide that highlights personal and shared responsibilities for returning to work on campus. \n  \n June 23, 2020:   Chancellor's Update -- June 2020 Updates on fall planning, remote work, state budget, budget town halls, protecting our campus community, and new brand identity. \n  \n June 22, 2020:   Online Training California Department Public Health (CDPH) and Cal/OSHA recently issued requirements for all employees to receive training on COVID-19 and methods to prevent illness . \n   \n June 17, 2020:   UCR Announces Fall Quarter Instruction Plans All classes will be available remotely, with a limited number of in-person courses expected. \n  \n May 29, 2020:   Research Ramp Up Finalized requirements for ramping up on-campus research. \n  \n May 27, 2020:   Chancellor's Update -- May 2020 Updates on fall planning, virtual graduation ceremony, and virtual office hours. \n   \n May 18, 2020:  President Napolitano announces systemwide pay freeze for policy-covered employees \n President issues announcement to all UC campuses. \n  \n May 18, 2020:   Governor's Revised Budget Proposal \n Chancellor Wilcox summarizes Governor's proposed 2020-21 budget and how it affects UCR.  May 15, 2020:   Update to Graduate Students May 11, 2020:   Fall Working Groups and Leadership Office Hours \n Chancellor Wilcox provides details on the working groups planning for the fall quarter and resumed campus operations.  \n May 9, 2020:  Updated Riverside County Public Health Order The action will not result in any immediate changes to UCR's campus operations.  May 4, 2020:   Talent Match Program A new program designed to pair staff and students with diminished workloads with temporary job assignments.  April 29, 2020:   Clarification of local health officer orders This amended health order continues to require face coverings and a six-foot social distance \nthrough June 19.  April 21, 2020:  COVID-19 Related Leaves and Job Protections Guidance for PolicyCovered and Represented Staff Employees \n An update to the original issuance. April 21, 2020:   Commencement 2020 Update Message from the Chancellor with an update about Commencement 2020.  April 16, 2020:   Job Protection & COVID-19 Related Paid Leaves A follow on to the April 2, 2020, job protection letter from President Napolitano and the ten Chancellors, this is to provide additional job protection details and information on the three COVID-19 related leave options.  April 15, 2020:   Highlander Orientation to be done remotely This year, with the uncertainty of COVID-19, we have made the decision to move to a remote orientation program for our incoming first-year and transfer students.  April 14, 2020:   Facilities Services Limited Services During the Campus Closure  In an ongoing effort to adhere to the Riverside County request for social distancing with essential workers on-campus, Facilities Services (FS) continues to have limited staff on-campus. Below is an overview of current maintenance-focused services during the campus closure.  April 7, 2020:   Guidance to UC Health Care Personnel UC Health provides guidance for health care personnel who test positive for COVID-19. The UCR Health hotline for faculty and staff is 844-827-6827. April 6, 2020:  Guidance for Asymptomatic On-Site UCR Personnel with Non-Healthcare Duties   Overview of guidance for  UCR essential personnel performing non-healthcare duties , including how to self monitor. April 6, 2020:   Expanded digital access to UCR Library content during the COVID-19 crisis \n April 4, 2020:   Face Covering Guidance EH&S had created guidance for Face Covering in line with Riverside County health officials recommendation issued March 31, 2020 for residents to cover their nose and mount in public places. Information on distribution and use is included for all essential personnel working on campus.   \n  \n April 3, 2020:   Addressing \"Zoombombing\" XCITE is working to update teaching and student resources on the keepteaching.ucr.edu and keeplearning.ucr.edu sites as well as provide faculty, instructors, and TAs with tools to keep unwanted users out of the virtual classroom environment.  \n  \n April 3, 2020:   Commencement 2020 update to campus The Chancellor has asked the working group to discuss how we might honor and celebrate our graduates while complying with the amended County closure order. \n  \n April 2, 2020:   Campus Closure Extended to June 19 The Riverside County Public Health Officer has issued a revised public health order, extending the current physical closure of the UC Riverside campus for all but essential personnel supporting critical university functions through June 19, 2020. April 1, 2020 :  Update to Graduate Students \n March 31, 2020:  Remote instruction continuing for UCR Summer Sessions After consulting with campus leadership, including the Chair and Vice Chair of the Academic Senate, and checking in with colleagues at other UC campuses, we have decided to continue remote instruction through summer 2020. \n  \n March 26, 2020:   Changes to Spring 2020 Late Fees and Course Material Fees \n  \n March 25, 2020:  Message to Students re. Spring Quarter Update on tuition and fees, faculty and teaching assistants, laboratories, instructional quality, housing, and financial aid. March 24, 2020:  CALL FOR APPLICATIONS: Loaner Device Program Available for Students in Need Students, If you do not have off-campus access to a device and/or internet that supports remote teaching and learning – such as a laptop, desktop, or tablet – we request that you take time now to fill out this survey. \n  \n March 20, 2020:  Message to Graduate Students March 20, 2020:   Interim Guidance: Delivery Location of University Goods Information about campus procedures for requesting delivery of University goods to a non-University location. \n   \n March 19, 2020:   Governor's Stay at Home Order Governor Gavin Newsom issued an order that is consistent with the measures UCR has recently taken.  \n  \n March 19, 2020:  IT Clarification on Remote Work Options \n Additional detail on setting up a remote desktop connection from home. \n   \n March 18, 2020:   Campus Closure Extended to April 30 \n The Riverside County Public Health Officer has issued a revised public health order, extending the physical closure of the UC Riverside campus for all but the most critical university functions. The closure was originally scheduled to end on April 3, and has now been extended to April 30. \n   \n March 18, 2020:  Update -- Paid Administrative Leave Guidance and Tracking \n The university has modified paid administrative leave policies. \n  \n March 17, 2020:   Research curtailed \n Provost and Vice Chancellor of Research directed that we will strictly curtail on-campus research activities to those that cannot be postponed or restarted; and prepare for a possible complete shutdown of research on campus. \n  \n March 16, 2020:  Employee paid leave modified President Napolitano issues Executive Order modifying guidance issued 03/09/20. All employees receive allotment of up to 128 hours of paid administrative leave. \n  \n March 16, 2020 :  Instructional Technology update Instructional Technology Taskforce described availability of computer labs, laptop kiosks, internet service, and iLearn for final exams and remote learning. \n  \n March 15, 2020 :  Campus closure - Building access   All in-person, non-essential gatherings on campus are suspended, until further notice. Essential personnel to be identified. \n   \n March 15, 2020:  Student support   Student Affairs confirms student housing and meal plans will continue, identifies services that will remain available to support students, urges refrain from personal non-essential travel. R'Pantry offers limited gift cards. Families advised not to make arrangements for commencement.  \n   \n March 14, 2020:  Campus closure   Chancellor announced campus is closed, except for critical operations. Students to receive all instruction remotely for entirety of Spring 2020.  Staff to work remotely. All non-essential domestic and international travel is suspended.  \n   \n March 14, 2020:  Campus closure effective March 16, 2020   Provost and CFO announced all offices, units, or departments will not have staff on campus unless they are essential personnel, and many staff may be working remotely. March 13, 2020:  Riverside County Public Health Order   Riverside County issues public health order to close all schools, including universities. Housing remains open, remote work staffing and instruction to commence. \n   \n March 13, 2020:  A message from Chancellor Wilcox   Chancellor sends video reiterating hygiene and safety, thanks community. \n March 12, 2020:   Employee guidelines   Chancellor and Provost announce remote work effective immediately, prior approval required before closing departments, and UCR guidance related to telecommuting and 14 day paid administrative leave. \n  \n March 12, 2020:  Student resources   Student Affairs answers questions about key student services. \n  \n March 12, 2020:  School of Medicine    remains open and provides updates to academic continuity, UCR Health, SOM operations, events. No cases at UCR. \n   \n March 11, 2020:   Athletics official statement   Athletics announces precautionary measures taken. Only essential personnel permitted. No fans to attend events. March 11, 2020 :  Researcher Guidance   Office of Research reiterates we are not suspending research activities, outlines immediate measures to be taken by laboratory and research facilities. Longer term planning considerations shared. \n   \n March 11, 2020:   Campus remains open but classes and finals switch to online   Information shared about student housing and quarantines, faculty and staff working, research to continue, travel discouraged, large events discouraged, cleaning protocols, ombuds office, and zoom use. \n   \n March 11, 2020 :  Hotline for faculty and staff   UCR Health creates health hotline for faculty and staff. \n   \n March 10, 2020:  Academic continuity plan and campus operations changes Chancellor and Provost issue academic continuity and campus operations changes. Winter finals online, Spring courses fully online through 04/03/20. Gatherings restricted. Social distancing and hygiene encouraged. No cases at UCR.  \n  \n March 9, 2020:  Employee paid leave granted    \n UCOP enacts temporary emergency actions regarding paid leave and remote work. Employees were granted 14 days of paid administrative leave if they are unable to work due to Coronavirus related reasons. \n  \n March 8, 2020:  Campus remains open but shifts towards remote work and learning    Chancellor and Provost announce campus to remain open and operational, requested we take steps to shift to working, teaching, and learning remotely in near future. Travel considerations and emphasis on health and wellness placed. Riverside County confirms one case. No cases at UCR. \n  \n March 6, 2020:  Travel interim policy Chancellor and Provost institute interim policy and provide guidance for all international and domestic travel. \n   \n March 5, 2020:  Continuity planning for instructors Chancellor, Provost, VP Academic Personnel asks instructors to develop continuity plans for Winter and Spring 2020. Requires deans, department chairs, and directors to take action ensuring instructional continuity for students \n   \n March 5, 2020:   Travel to Level 2 and 3 countries (updated)   President Napolitano limits non-essential travel to CDC Level 2 countries in addition to Level 3.. Grants emergency powers to Management Response Team. \n   \n March 3, 2020:  UCR response to Coronavirus (update)   Chancellor and Provost share UCR response, recommended precautions, resources available to community. No cases at UCR.  \n   \n February 28, 2020 :  CDC Issues Level 3 travel warning  \n Avoid non-essential travel to Iran, Italy, South Korea \n  \n February 27, 2020:  Employee guidance    UCOP provides guidance for all UC locations \n   \n February 26, 2020:   Travel to Level 3 countries President Napolitano limits non-essential travel to CDC Level 3 countries, urges travel registration.  \n   \n February 4, 2020:  UCR response to Coronavirus Chancellor and Provost share UCR response, urges travel registration, requests respectful and appropriate treatment. No cases at UCR. \n   \n February 3, 2020:  Guidance for travel to China   Provost and CFO issue review and approval process for travel to China. \n   \n January 30, 2020:  Travel to China   President Napolitano limits non-essential travel to China. \n   \n January 29, 2020:  Travel restrictions for UCR Personnel   Guidance for travel in response to CDC travel advisories. \n   \n January 28, 2020:  Campus remains open   Student Health Center says UCR is monitoring situation. Normal operations. No cases at UCR. Refer to information on EH&S website. \n   \n January 22, 2020:   Coronavirus advisory   Student Health Center provides advisory about Coronavirus. \n   \n \n \n \n \n \n \n \n ADDITIONAL INFORMATION \n \n \n \n \n \n \n \n Contact Us \nHave a question? \n Send us an email >> \n \n \n Resources for Campus \n Downloadable resources for facilities, including signage.  \n See resources >> \n   \n \n \n Campus Return \n Information about plans for a return to campus.  \n Learn more >> \n \n \n How to protect yourself \n Latest updates from the campus and Riverside County Public Health. \n Learn more >> \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n University of California, Riverside \n \n 900 University Ave. \n            Riverside, CA 92521 \n Tel: (951) 827-1012 \n \n \n UCR Library \n Campus Status \n Campus Store \n Career Opportunities \n Diversity \n Maps and Directions \n Visit UCR \n \n \n \n \n \n University of California, Riverside \n \n               Environmental Health & Safety \n             900 University Ave.              Riverside, CA 92521              \n  tel: (951) 827-5528                  fax: (951) 827-5122          email:  ehs@ucr.edu   \n \n \n  Find Us \n \n \n \n \n \n \n Related Links \n \n \n Coronavirus Resources & Updates \n \n Customer Service Satisfaction Survey for EH&S \n \n Emergency Management \n \n Fire & Life Safety \n \n Risk & Safety Solutions Web Application Log In \n \n Risk Management \n \n UC Police Department \n \n UC Risk & Safety Training \n \n \n \n \n \n \n \n \n \n \n \n \n \n Privacy Policy \n Terms and Conditions \n © 2021 Regents of the University of California \n \n \n \n \n \n \n \n \n \n \n × \n \n \n \n \n \n \n Let us help you with your search \n \n \n Enter your Search Criteria. \n \n \n \n Search All UCR \n \n \n Search This Site \n \n \n Cancel \n \n \n \n \n \n \n \n \n \n \n \n \n"
}