{
    "docno": "RJP301",
    "url": "https://irecruitportal.ucr.edu/irecruit/!Controller?action=jobs_webui.show_page&page=jobs_detail&requisition_id=22707997&profile_id=&module=jobs",
    "text": "\n \n UCR Jobs - Position Details  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Skip Navigation \n \n \n Home Page \n \n \n \n \n \n \n \n \n Login   \n Register   \n \n \n \n \n \n \n \n HR Employment \n \n \n \n \n \n \n \n \n \n Home \n Browse Jobs \n How to Apply \n My Account \n Help \n About \n \n \n \n \n \n \n \n \n \n \n Position Details \n \n \n \n View All Details \n  \n          Back To Current Job Opportunities\n     \n \n Apply \n \n \n \n Compliance & Civil Rights Investigator     \n \n \n \n \n  Job Number \n  Full/Part Time  \n  Schedule    \n  Salary \n \n \n \n \n  22707997  \n  Full Time     \n  8AM - 5PM     \n      $86,500 -    $170,500     \n \n \n \n \n Position Information \n  \n**Applicants are required to submit a cover letter and resume for full consideration.**\n\nThe Compliance and Civil Rights investigator is key part of UC Riverside's Chief Compliance organization, which leads campus efforts to promote the UC Ethics & Compliance Program and to prevent and respond to discrimination and harassment. The investigator assesses and investigates whistleblower, discrimination, harassment and other complaints, under the direction of the Chief Compliance Officer & Locally Designated Official (LDO). Understands and interprets complex policies and regulations governing staff, faculty, and students. Conducts investigations in compliance with Whistleblower and Whistleblower Protection policies, as well as Human Resources, Title IX, Equal Opportunity & Affirmative Action, Research, Athletics (NCAA Division I), Environmental Health & Safety, and other regulations and University policies. The investigator reports directly to the Associate Vice Chancellor/Chief Compliance Officer (AVC/CCO), and supports the AVC/CCO in campus efforts to create an ethical culture including by promoting accountability and integrity.\n\nSelected candidates and/or finalists may be asked to provide a writing sample, conduct a case study, or give a presentation.\n\t\n    \n     \n  Education   \n \n  Education Requirements  \n \n \n  Degree  \n  Requirement  \n \n \n \n  Bachelor's degree in related area and/or equivalent experience/training.  \n  Required  \n \n \n  Advanced degree in a related field or Juris Doctorate.  \n  Preferred  \n \n \n \n \n  Certifications  \n \n \n  Certification  \n  Requirement  \n \n \n \n  Professional certification(s) applicable to job responsibilities.  \n  Preferred   \n \n \n  CCEP (Certified Compliance & Ethics Professional)  \n  Preferred   \n \n \n  AWI-CH (Association of Workplace Investigators Certificate Holder)  \n  Preferred   \n \n \n \n \n \n  Experience   \n \n \n \n  Experience  \n  Requirement \n \n \n \n  Minimum of 6-10   years of related experience.   \n  Required   \n \n \n      Significant experience in resolution of civil rights (Title VII, Title IX, ADA, etc) complaints.   \n  Preferred   \n \n \n      Experience investigating harassment or equivalently sensitive allegations in an empathetic and confidential matter.   \n  Required   \n \n \n \n \n \n  Special Conditions   \n \n \n \n  Special Condition  \n  Requirement  \n \n \n \n  Must be able to work extended hours and or weekends as needed.  \n  Required   \n \n \n  Ability to ocassionally travel to trainings, seminars, conferences and other work related activities as needed.  \n  Preferred   \n \n \n \n \n \n  Minimum Requirements  \n Excellent analytical and problem solving skills. Is able to apply appropriate policies and practices in the completion of ethics and compliance assignments. Skills in critical decision making. Thorough understanding of the interrelationship of procedures and desired results. Excellent interpersonal and problem solving skills to work independently with all levels of University personnel, including management and faculty, and to facilitate agreement on issues and corrective actions. Demonstrated professionalism, discretion and judgement through sound decision-making to obtain solutions through collaborative efforts with a wide-variety of offices and departments. Ability to extract, verify, compile and develop recommendations related to ethics and compliance programs, issues, policies and procedures. Demonstrated critical thinking skills and ability to implement strategic policy recommendations. Ability work calmly under pressure and maintain excellent working relationships. In-depth abilities in collaboration, facilitation, and strategic and creative thinking. Ability to present complex issues in a clear and concise manner, both in writing and verbally for presentation or review by senior leadership. Comprehensive knowledge of state and federal laws and regulations, case law, and guidance related to: discrimination and harassment in the educational or employment setting, or of substantially similar laws and regulations; sexual harassment in the educational or employment setting, or of substantially similar laws and regulations. Demonstrated knowledge of best practices and methodologies for conducting investigations, including interviewing, gathering and analyzing evidence, and writing\ninvestigation reports. Experience investigating sexual harassment or equivalently sensitive allegations in an empathetic and confidential manner. Demonstrated skill, sensitivity and experience interacting with constituents who are diverse in characteristics such as age, education level, race, gender identity and expression, ability, and socioeconomic backgrounds in a culturally-competent manner. Demonstrated written and oral communication skills; skill building rapport in an open, friendly, and accepting way; attentive listener. Ability to gather and organize information, conduct analysis, and make recommendations on issues that are complex in nature; critical thinker. Ability to apply policy and legal concepts to issues.   \n  Preferred Qualifications   \n Broad and thorough knowledge of University ethics and compliance policies, procedures and programs. Advanced knowledge of the ethics and compliance profession, theories and systems of internal control, and professional compliance and investigations standards. Thorough knowledge of the complexities of sexual harassment, including sexual violence, in the educational or employment setting. Basic understanding of the relevance of trauma in the context of complaint resolution (for example, the neurobiology of trauma and trauma-informed investigation techniques).   \n Additional Information  \n In the Heart of Inland Southern California, UC Riverside is located on nearly 1,200 acres near Box Springs Mountain in Southern California; the park-like campus provides convenient access to the vibrant and growing Inland region. The campus is a living laboratory for the exploration of issues critical to growing communities' air, water, energy, transportation, politics, the arts, history, and culture. UCR gives every student, faculty and staff member the resources to explore, engage, imagine and excel. UC Riverside is recognized as one of the most ethnically diverse research universities in the country boasting several key rankings of which we are extremely proud.     UC Riverside is proud to be ranked No. 12 among all U.S. universities, according to Money Magazine's 2020 rankings, and among the top 1 percent of universities worldwide, according to the 2019-20 Center for World University rankings.     UC Riverside is the top university in the United States for social mobility. - U.S. News 2020     UCR is a member of the University Innovation Alliance, the leading national coalition of public research universities committed to improving student success for low-income, first-generation, and students of color.     Among top-tier universities, UC Riverside ranks No. 2 in financial aid. - Business Insider 2019     Ranked No. 2 in the world for research, UCR's Department of Entomology maintains one of the largest collections of insect specimens the nation. - Center for World University Rankings     UCR's distinguished faculty boasts 2 Nobel Laureates, and 13 members of the National Academies of Science and Medicine.      The University of California is an Equal Opportunity/Affirmative Action Employer with a strong institutional commitment to the achievement of excellence and diversity among its faculty and staff. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veteran status, or any other characteristic protected by law.   For information about our generous employee benefits package, visit:  Employee Benefits Overview   \n Job Description Details \n \n  View complete Job Description for this position   \n \n \n \n \n \n \n \n \n \n \n More Information \n \n \n \n General Campus Information \n \n University of California, Riverside \n \n 900 University Ave. \n \n Riverside ,  CA  92521 \n \n \n                                Tel:  (951) 827-1012 \n \n \n \n Career Opportunities \n                            •  UCR Libraries \n \n Campus Status \n                            •  Maps and Directions \n \n \n \n Department Information \n \n Human Resources \n 1160 University Ave. \n Riverside, CA 92521\n                                     \n Fax: (951) 827-6493\n                                     E-mail:  jobshelp@ucr.edu \n \n \n \n Related Links \n \n Human Resources Home \n Diversity \n About UCR \n \n \n \n \n \n \n \n \n Campuswide Navigation \n \n \n Home \n \n \n About UCR \n \n \n Academics \n \n \n Admissions \n \n \n Athletics \n \n \n Happenings \n \n \n Research \n \n \n Campus Resources \n \n \n Giving to UCR \n \n \n \n Footer \n \n \n \n Privacy Policy \n \n \n Terms and Conditions \n \n \n                            © 2010 Regents of the University of California\n                         \n \n                            Last modified: 2010-Apr-22\n                         \n \n \n \n \n   \n \n \n"
}