{
    "docno": "RJP373",
    "url": "http://www.trdrp.org/funding-opportunities/smoke-tobacco-free-student-fellowships-uc-campuses.html",
    "text": "\n \n \n \n \n \n      Smoke and tobacco free student fellowships for UC campuses | TRDRP\n     \n \n \n \n \n Skip to content \n \n \n \n \n \n \n \n About | Support Us | Contact \n \n \n \n \n \n \n \n \n \n \n \n Research priorities | \n \n \n Funding opportunities | \n \n \n Funded research | \n \n \n Recent News | \n \n \n Events | \n \n \n \n \n \n \n \n \n                  Smoke and tobacco free student fellowships for UC campuses\n                 \n \n                  Fostering the next generation of leaders for a smoke and\n                  tobacco free university and world\n                 \n \n                  The University of California has launched the support\n                  of a pilot fellowship program that builds upon\n                  the successes of the University in tobacco control, notably\n                  the\n                   systemwide smoke and tobacco free policy \n                  enacted in 2014.\n                 \n \n                  The goal of these fellowships, open to all UC undergraduate\n                  and graduate students, is to develop the next generation of\n                  leaders in reducing the harms and social costs from smoking\n                  and use of tobacco products worldwide.\n                 \n \n                  The UC Smoke and Tobacco Free Student Fellowships opportunity\n                  invites applications from all ten campuses for the support of\n                  one year student projects. The project topics may include\n                  scholarly work related to policy impact and emerging campus\n                  issues, projects that target reductions in smoking or tobacco\n                  use in the campus community, science projects on the\n                  characteristics, use, and effects of tobacco products, or\n                  student engagement and outreach for tobacco control. Tobacco\n                  products include cigarettes, as well as other tobacco products\n                  including electronic nicotine delivery systems and vaping\n                  devices.\n                 \n Fellows are expected to: \n \n Conduct their proposed project within a year \n \n                    Participate on their campus smoke and tobacco free task\n                    force\n                   \n \n                    Participate in a systemwide curriculum conducted via webinar\n                   \n \n                    Meet with their designated local and systemwide mentors\n                   \n \n                    Complete their project, and submit a final report that\n                    summarizes the project, by the end of spring quarter 2017\n                   \n \n                    Attend a systemwide meeting based at one of the UC campuses\n                    and present their project\n                   \n \n \n Frequently Asked Questions (pdf) \n \n \n Instructions on How to Apply (pdf) \n \n \n Call for applications (pdf) \n \n \n                  To start your online application, please access this link on\n                   proposalCENTRAL .\n                 \n \n                  For questions about these UC Smoke and Tobacco Free Student\n                  Fellowships, please contact\n                   Phillip.Gardiner@ucop.edu .\n                 \n \n \n \n \n \n \n \n \n \n \n \n UNIVERSITY OF CALIFORNIA \n \n \n \n \n \n RESEARCH GRANTS PROGRAM OFFICE \n \n \n              © 2014 Regents of the University of California | TRDRP HOME \n \n \n \n \n \n \n \n"
}