{
    "docno": "RJP341",
    "url": "https://www.washingtonpost.com/",
    "text": "The Washington Post: Breaking News, World, US, DC News and Analysis \n Skip to main content Search Input search Sections menu Sections menu Politics Coronavirus Race & Reckoning Opinions Investigations Tech World D.C., Md. & Va. Sports Arts & Entertainment Sign in profile Sign in profile   Logo of The Washington Post Democracy Dies in Darkness Ad   G-7 leaders try to signal that the page has turned on Trump era Rich democracies meeting in Britain sought to send a message that they were back in business after a surge in vaccinations and the exit of a disruptive American president. By  Anne Gearan  and  Ashley Parker As G-7 leaders meet, there is  concern about how U.S. trends could affect global economies Garland to expand Justice Department’s voting rights unit to scrutinize GOP-backed voting restrictions, ballot reviews The attorney general said additional trial attorneys will scrutinize new laws and existing practices for potential discrimination against Americans of color. By  Amy Gardner  and  Sean Sullivan Justice Dept. inspector general to examine leak investigations By  Matt Zapotosky ,  Felicia Sonmez  and  Karoun Demirjian wp EXCLUSIVE People of Praise, a Christian group tied to Justice Amy Coney Barrett, faces reckoning over sexual misconduct allegations By  Beth Reinhard  and  Alice Crites The Fix Analysis New questions about a key GOP impeachment witness for Trump By  Aaron Blake How Boulder residents are coping three months after a mass shooting in a supermarket Volunteers swarmed with therapy dogs. Officials created a pop-up community center. And historians made plans to preserve the memorials. But many of the shooting’s witnesses are still struggling to cope. By  Erin Blakemore This melting glacier was already the biggest source of sea level rise. Then things got worse. Without its icy restraint holding it back from the ocean, the Pine Island glacier could dramatically add to sea level rise. By  Sarah Kaplan FDA decides 60 million doses of Johnson & Johnson vaccine must be be discarded; 10 million can be released By  Laurie McGinley ,  Christopher Rowland  and  Isaac Stanley-Becker Coronavirus developments: G-7 leaders commit to making 1 billion coronavirus vaccine doses available starting this summer Jury awards $15 million in landmark case over embryos, eggs destroyed in fertility clinic tank failure The historic verdict could have far-reaching consequences for the loosely regulated U.S. fertility industry. By  Derek Hawkins 1 hour ago By The Way A Post Travel Destination Airlines have seen a rise in disruptive passengers. Experts say it could get worse. Shoves, shouts, flying fists and mask defiance: Bad behavior by air travelers is reaching new heights. By  Hannah Sampson Opinions chevron-right Another stunning revelation about the Trump Justice Department requires answers — and action Opinion by the  Editorial Board The SBC has bad, sexist theology. Of course bad culture follows. Opinion by  David Von Drehle Biden wants Russia’s cooperation. But Putin thrives on chaos. Opinion by  Jim Risch The debate over the FDA-approved Alzheimer’s drug showcases our system’s skewed priorities Opinion by  Helaine Olen What Washington and Lee has embraced Opinion by  Colbert I. King As the pandemic retreats, we’re left wondering what we’ve been through Opinion by  Stephen Marche Ad Ad Guide to the Pandemic chevron-right NAVIGATING YOUR LIFE chevron-right Should my child get a coronavirus vaccine? Is it safe? Here’s what you should know. With millions of children now eligible for a coronavirus vaccine, both the Centers for Disease Control and Prevention and the American Academy of Pediatrics recommend children get inoculated. By  Lindsey Bever Airlines have seen an unprecedented rise in disruptive passengers. Experts say it could get worse. CDC: ER visits for suspected suicide attempts among teenage girls rose during pandemic Track the spread: Across the U.S. Worldwide YOUR QUESTIONS ANSWERED chevron-right What to know about variants Will I need a booster shot? What to know about teen vaccines Immunocompromised? What you should know. Covid-19 symptoms to watch out for Sign up: Coronavirus newsletter More Top Stories Bipartisan proposals in House would mean major changes for the way tech giants operate The rare cooperation between Republicans and Democrats underscores the mounting bipartisan interest in overhauling federal competition laws to address long-running allegations that Amazon, Apple, Facebook and Google have engaged in monopoly-style tactics. By  Cat Zakrzewski YouTube suspends Ron Johnson for a week after GOP senator touts questionable drugs to fight covid-19 By  Felicia Sonmez  and  Amy B Wang 1 hour ago Joy Zarembka, VP of planning and innovation, left, and Aimee Holguin, employee relations specialist, and the leadership team for Busboys and Poets train on a contactless ordering system in May in Washington, D.C. (Amanda Voisard for The Post) Computer chip shortage threatens thousands of restaurant service jobs The computer chip shortage may push the restaurant industry toward ditching servers in favor of contactless-ordering models. By  Laura Reiley Texas governor vows to build Mexico border wall and increase arrests of migrants By  Timothy Bella Chicago officer charged in Jan. 6 riot wore a police sweatshirt to the Capitol, U.S. alleges By  Tom Jackman 1 hour ago listen-solid Post Reports Podcast Introducing ‘Please, go on’ play Add to: Apple Podcasts , Google Podcasts , Stitcher Morning Mix chevron-right Stories from all over Don’t Miss Red velvet cake is ‘the color of joy.’ Here’s how it rose into America’s dessert canon. By  G. Daniela Galarza Sitcom wives are a tired trope. In her new role, Annie Murphy of ‘Schitt’s Creek’ is flipping the script. By  Valentina Valentini A new series tries to solve racing’s riddle: Is it the driver or the car? By  Liz Clarke Retropolis The Past, Rediscovered ‘In the Heights’ is an award-winning hit. Its predecessor, ‘West Side Story,’ shocked audiences. By  Marisa Iati Ad Ad Trending (Lee Powell/The Post) Amtrak’s Northeast Corridor is busy, old and falling apart Amtrak's Northeast Corridor stretches between Washington and Boston. It's a busy stretch of railroad, with parts that date back almost 150 years. Today’s Print Stories Get the headlines from today's paper, and click on each one to read the story. Podcasts Multi-tasking? Follow the latest headlines and analysis through our podcasts. Share news tips with us confidentially The Post offers several ways to securely send information and documents to journalists. Washington Post Apps Stay connected with the latest news on your tablet and phone. Politics chevron-right Biden administration keeps Trump hotel documents under wraps The Trump administration blocked Democrats’ efforts to unearth documents related to his federally leased D.C. hotel. Not much has changed under President Biden. By  Jonathan O'Connell  and  David A. Fahrenthold Masks no longer required in the House for those who are fully vaccinated The change on an issue that had exposed a political divide applies to the House floor and committee rooms. By  Eugene Scott The roots of former president Donald Trump’s power in the Republican Party can be traced back to the backlash following the 2008 election and financial crisis. (Blair Guild, JM Rieger/The Post) The Fix Analysis How the Republican Party became the party of Trump In this video series, The Washington Post examines how former president Donald Trump took control of the Republican Party and what it means for the party moving forward. By  Blair Guild  and  JM Rieger Biden’s new liaison to Asian Americans fights for influence in White House By  David Nakamura How was an entrepreneur wrongly ID’d as a Univision reporter at a Harris event? By  Cleve R. Wootson Jr.  and  Andrea Salcedo Judge halts billions in debt relief for farmers of color as group for White farmers sues By  Andrea Salcedo  and  Laura Reiley Oregon House expels GOP lawmaker who let far-right rioters into state Capitol: ‘He has shown no remorse’ By  Jaclyn Peiser The Trailer Analysis The ‘Arizona model’: Republicans trek to Phoenix, planning 2020 election audits back home By  David Weigel World chevron-right Op-eds in a Chinese state tabloid slammed U.S. policy. The author works at the Pentagon. Franz Gayl, a celebrated whistleblower and former Marine, is being investigated after attacking American policy on Taiwan in a Chinese government mouthpiece. By  Michael E. Miller Boris Johnson says he and President Biden are ‘working together’ on case of Harry Dunn American Anne Sacoolas claimed diplomatic immunity and flew back to the United States after striking and killing British teenager Harry Dunn. Sacoolas was working in the United Kingdom for a U.S. intelligence agency, as was her husband, her lawyer told a Virginia court. By  Jennifer Hassan Britain's Prime Minister Boris Johnson and his spouse, Carrie Johnson, attend a reception on the sidelines of the G7 summit on Friday. (Jack Hill/Pool/Reuters) What’s on the menu for the G-7? Baked brie, toasted marshmallows and hot buttered rum. By  Antonia Noori Farzan World leaders are in England, but beautiful British beaches have stolen the show Death of prisoner from covid-19 sparks protests as Bahrain battles outbreak By  Miriam Berger She was born in Australia and turns 4 on Saturday. The government wants her deported. By  Rachel Pannett Russia to supply Iran with advanced satellite system,  officials say By  Joby Warrick Ad Ad National chevron-right Streamlining of of federal financial aid application is delayed The Education Department  announced a one-year delay in implementing major changes to the federal financial aid application, which Congress secured in the year-end spending package. By  Danielle Douglas-Gabriel ER visits for suspected suicide attempts among teenage girls have risen, CDC says By  Allyson Chiu Paradise Valley in the Tongass National Forest in Alaska in 2011. (Karen Dillman/Forest Service) Biden administration moves to restore road ban in Alaskan national forest, reversing Trump rollback The Biden administration said Friday it would prohibit road building in half of Alaska’s Tongass National Forest, resurrecting 20-year-old protections that President Donald Trump had stripped three months before leaving office. By  Juliet Eilperin A man dumped 80,000 pennies on the lawn for his last child-support payment. His daughter paid it forward.  By  Timothy Bella Teen who recorded George Floyd’s murder is awarded a Pulitzer citation By  Elahe Izadi Read the Washington Post stories that were finalists Federal workers could see more remote work, schedule options By  Lisa Rein  and  Eric Yoder Capital Weather Gang Lake Mead reaches lowest level on record amid exceptional drought By  Matthew Cappucci A state trooper hit a pregnant woman’s car to enforce a traffic stop. It flipped and crashed. By  Hannah Knowles D.C., MD. & VA. chevron-right D.C. Council weighs smaller police budget, more funding for alternatives At a budget hearing, some residents warned of escalating crime. Others said the proposed cuts to police spending are not sufficient. By  Peter Hermann 1 hour ago Georgetown revokes ex-provost’s honorary degree By  Lauren Lumpkin Metro’s Cleveland Park station will be one of two Red Line stops closed for at least two weekends in August to upgrade ventilation fans, the transit agency said. (Katherine Frey/The Post) Metro projects will cause months of delays, station closures on Red Line A Metro tunnel ventilation and platform canopy replacement project will cause months of delays and station closures on the Red Line starting next month through the end of the year. By  Justin George Father, son found dead on Appalachian Trail in apparent murder-suicide Dawson Thomson, 2, and Sean Thomson, 34, were found Friday. By  Emily Davies Customer thwarts an alleged kidnapping attempt outside Target in Rockville A 31-year-old IT worker heard a woman screaming in the parking lot. By  Dan Morse Part of Beach Drive will stay closed to cars while National Park Service studies permanent closure The northern section of Beach Drive will stay car-free at least into the fall. By  Michael Laris  and  Luz Lazo Known coronavirus deaths and cases per 100,000 Capital Weather Gang PM Update: Rain ending tonight ahead of a fairly decent weekend Once the rain ends, we see a good deal of sun in coming days. We need it to dry out. By  Ian Livingston Going Out Guide chevron-right Where to watch Euro 2020 and Copa America in the D.C. area Two of the world's biggest soccer tournaments overlap this month. Here's where to find fans of your favorite team, or just a great soccer bar. By  Fritz Hahn Review Dauphine’s pays respect to New Orleans with top-notch cooking and cocktails Dauphine’s nails so many of the details, with design to match. By  Tom Sietsema As D.C. nightclubs reopen, DJs start to return to the rotation Our favorite activities are coming back as restrictions officially lift across the region. By  Fritz Hahn Real Estate chevron-right A study in art and architecture at the Watergate Distinguished homes for sale in the D.C. region Mortgage rates fall, remaining under 3 percent The Washington Post Magazine chevron-right (AFP/Getty Images) From opposite sides of the Israel-Gaza conflict, two writers wonder: Where do their peoples go from here? In the wake of the recent fighting, we asked a Palestinian American entrepreneur who lives near Ramallah and an Israeli journalist who lives near Tel Aviv to correspond with each other. ‘The unparalleled champion’: Bob Dole’s forgotten fight to get Washington to recognize the Armenian genocide The surgeon who treated the war wounds of the former senator was Armenian. Now, finally, the United States, has formally recognized the 1915 atrocity. By  Manuel Roig-Franzia Date Lab Their Zoom call lasted about 45 minutes By  Sarah Wildman In painting nurses at the height of the pandemic, a portrait artist learns what it is to depict bravery By  Tim Okamura BUSINESS & TECHNOLOGY chevron-right A McDonald's store in Taipei, Taiwan. (Pichi Chuang/Reuters) McDonald’s suffers data breach in U.S., Taiwan and South Korea Some customer and employee information was exposed, but the hack was quickly contained, the company said. By  Taylor Telford As Tesla touts a ‘plaid’ Model S, is there more trouble behind the scenes? By  Faiz Siddiqui Drug distributor McKesson docks CEO’s pay over the opioid crisis. He still gets a package worth $15 million. By  Douglas MacMillan  and  Kevin Schaul Here’s how the gas tax could help pay for a $1 trillion infrastructure proposal By  Ian Duncan Launcher Video game news and analysis The origin and evolution of E3 By  Shannon Liao Market Watch Last Updated: Today at 5:16 p.m. ET Dow   34,479.60 Today   arrow-up   0.04 % S&P   4,247.44 Today   arrow-up   0.19 % NASDAQ   14,069.42 Today   arrow-up   0.35 % HEALTH & SCIENCE chevron-right FDA advisers debate standards on a coronavirus vaccine for young children By  Carolyn Y. Johnson Drop in routine childhood vaccinations during pandemic may raise risk of other outbreaks, CDC says By  Lena H. Sun Capital Weather Gang Record heat forecast to bake Southwest next week amid worsening drought By  Matthew Cappucci The Health 202 Analysis Andy Slavitt describes life on the White House coronavirus task force By  Paige Winfield Cunningham Sunday Business chevron-right These businesses couldn’t find enough workers. Then they started offering $15 or more an hour. By  Eli Rosenberg Galactic Martini after you touch down? Space tourism quickly lifts off — for those who can afford it. By  Christian Davenport High Uber fares bypass drivers in short supply By  Faiz Siddiqui Florida Gov. Ron DeSantis signals GOP zeal to vilify businesses By  David J. Lynch SPORTS chevron-right (Invision/AP) As NBA honors players’ activism, Kareem Abdul-Jabbar urges more action: ‘We’ve got work to do’ The NBA legend, who helped pick the finalists for his namesake award, says activism is in the league's DNA. By  Candace Buckner Perspective The Nats have pieces to move at the trade deadline. Max Scherzer shouldn’t be one of them. General Manager Mike Rizzo’s duties are about removing emotion. The job is to be cold.\n\nExcept where it pertains to Scherzer. By  Barry Svrluga Cicadas have NFL teams facing crowd noise and practicing open-field moves By  Des Bieler Aside from a decision decision on Brooks, here’s what’s on the Wizards’ offseason to-do list By  Ava Wallace Ad Lifestyle chevron-right (iStock) Perspective The pandemic shed light on what it’s like to be a stay-at-home parent This collective societal wake-up call has been strangely comforting — hundreds of millions of people suddenly understand with searing clarity the odd psychological challenge of being at home alone all day. By  Stephanie H. Murray Stock up on your favorite wine now: Low inventory and higher prices are on the horizon By  Dave McIntyre Jeffrey Toobin returns to CNN for the first time since Zoom exposure incident By  Jeremy Barr Advice chevron-right Carolyn Hax: Single-mom sister teaches her kids a cynical view of love. Is she wrong? Your sister’s advice to her sons about love sounds logical to you, but “pushes against every romantic bone” in your body. Ask Amy: Affair that didn’t go well, didn’t end well Reader cheating with married man is outraged to find evidence of more dishonesty. Miss Manners: Singleton treated badly by smug couple friends Reader is left out of informal “couples” gatherings. The Lily chevron-right Elevating stories about women New York City’s first road race since the pandemic is women-only. 3,000 runners will carry on a storied legacy. Perspective Don’t let the billionaires fool you: Divorce can be a rotten deal for most women ‘60 Minutes’ ran an episode about algorithm bias. Only White experts were given airtime. Perspective Ask Dr. Andrea: I’m more financially comfortable than my parents, but they won’t accept my help ARTS & ENTERTAINMENT chevron-right TV Review ‘Blindspotting’ the film was about Oakland’s changing face. Its TV sequel gets a fresh perspective. By  Inkoo Kang Launcher Video Game News and Analysis What we expect to see at E3 2021 We have everything you need to know to prep for the video-game industry’s showcase event, including how to watch online, the presentation schedule and the big reveals that have already happened. By  Mikhail Klimentov  and  Mike Hume The origin and evolution of E3 Jean Smart as Deborah Vance in “Hacks.” (HBO Max) ‘Hacks’ finds new ways to show off Jean Smart’s spectacular range By  Ashley Fetters Nostalgia TV re-watch podcasts are thriving. Zach Braff and Donald Faison’s show about ‘Scrubs’ exemplifies why. A series of re-watch podcasts have proved popular. By  Emily Yahr Museum Review Seeing how body language is visual communication Silhouettes mark the dissonance between society’s control and one’s sense of self. By  Mark Jenkins Food chevron-right Including recipes and tips from Voraciously Stock up on your favorite wine now: Low inventory and higher prices are on the horizon By  Dave McIntyre This fruit-forward $13 rosé will quench your thirst this summer By  Dave McIntyre Celebrate Juneteenth with hot links, chow-chow and a virtual cookout By  Aaron Hutcherson Subtly sweet, tender and tangy, this red velvet cake shines with or without food coloring By  G. Daniela Galarza Travel chevron-right Including news and tips from By The Way Airlines have seen an unprecedented rise in disruptive passengers. Experts say it could get worse. By  Hannah Sampson A local’s guide to Las Vegas By  Chris Bitonti In southwestern Wisconsin, the bucolic Driftless Area is an overlooked gem By  Carson Vaughan A fully vaccinated cruise set sail in the Caribbean. Two passengers just tested positive for covid. By  Hannah Sampson Diversions chevron-right comment Comics crossword Crosswords mahjongg Mah Jongg sudoku Sudoku wordwipe Wordwipe horoscopes Horoscopes solitaire Solitaire tvlistings TV Listing     About Us Public Relations Careers Diversity & Inclusion Newspaper in Education Today's Paper WP Creative Group Events Policies & Standards Get The Post Home Delivery Digital Subscription Gift Subscriptions Mobile & Apps Newsletters & Alerts Washington Post Live Reprints & Permissions Post Store Books & eBooks e-Replica Help Contact the Newsroom Contact Customer Care Reader Representative Advertise Licensing & Syndication Request a Correction Send a News Tip Report a Vulnerability Terms of Use Digital Products Terms of Sale Print Products Terms of Sale Terms of Service Privacy Policy Submissions & Discussion Policy RSS Terms of Service Ad Choices washingtonpost.com  © 1996-2021 The Washington Post washingtonpost.com © 1996-2021 The Washington Post Contact the Newsroom Contact Customer Care Request a Correction Send a News Tip Report a Vulnerability Download the Washington Post App Policies & Standards Terms of Service Privacy Policy Print Products Terms of Sale Digital Products Terms of Sale Submissions & Discussion Policy RSS Terms of Service Ad Choices   ;"
}