{
    "docno": "RJP335",
    "url": "https://news.yahoo.com/",
    "text": "Yahoo News - Latest News & Headlines Home Mail News Finance Sports Entertainment Search Mobile More Yahoo Search Search News Search web Skip to Navigation Skip to Main Content Skip to Related Content Mail News Home Follow Us COVID-19 US Politics World Health Science Podcasts Originals Contact Us Videos GOP legislator ousted over state Capitol breach Rep. Mike Nearman's actions led to dozens of people — some armed — gaining access to the Capitol, thousands of dollars in damage and six injured officers. 'Only reasonable course of action'  » Western U.S. city dubbed 'bull's-eye of global warming' Red states vulnerable as Delta variant spreads Montana sweethearts killed in 1956: Case is finally solved The pandemic may have forever changed rush hour Speaker defends comments about killing white people Politics Reuters U.S. image among European, Asian partners improves under Biden The United States' image abroad has improved dramatically since Joe Biden replaced Donald Trump as president, according to a Pew Research Center survey of 12 nations, mainly in Europe and Asia, that was released on Thursday. The 2021 survey conducted by the nonpartisan research group found a median of 75% of people had confidence in Biden \"to do the right thing regarding world affairs,\" versus 17% who felt that way about Trump in 2020. A median of 62% had a favorable view of the United States in 2021, up from 34% last year. Polls: US image abroad has rebounded since Biden took office Associated Press America's global image under Biden skyrockets compared to Trump, survey finds NBC News U.S. Associated Press Officers not indicted in Honolulu shooting that killed teen Grand jurors have declined to indict three Honolulu police officers in a shooting that killed a 16-year-old boy. The Honolulu prosecuting attorney's office said it presented evidence to a grand jury Wednesday seeking indictments of the three officers. The grand jury declined to return indictments for any of the officers in the April 5 shooting that killed Iremamber Sykap, it said. U.S. NextShark Asian Business Owners Knock Out Man Allegedly Harassing Them in Their Store in Ireland A pair of Asian business owners knocked out a white man who allegedly had been harassing them in their store in Dublin, Ireland, last week. What happened: A video of the incident begins with an altercation already in progress between the two parties at the Oriental Emporium store on Jervis Street, as per Jackfroot. It was during the white man's second return when the older Asian man punched his face and the younger Asian man \"kicked his balls,\" knocking him to the ground. World Axios G7 leaders pose for \"family photo\" as summit kicks off in seaside village in England The three-day G7 summit in the seaside village of Carbis Bay, England, kicked off on Friday, with U.K. Prime Minister Boris Johnson welcoming his counterparts from the U.S., Canada, France, Germany, Italy, Japan and the European Union. Driving the news: The leaders of the world's wealthiest democracies, as well as the presidents of the European Union, announced a pledge to provide the world with 1 billion COVID-19 vaccine doses. In addition to plans for global efforts to combat COVID-19, the first in-person gathering of G7 leaders since the pandemic began is anticipated to bring discussions about climate change and confronting Russia and China, among other topics. Leaders head to COVID-themed G7 summit with vaccine pledges Associated Press G-7 pledge to share, but jostle for ground in the sandbox Associated Press Politics The Week The Trump scandals we don't know about Donald Trump was plenty terrible in public. The ex-president was a grifter and a troll, a race-baiter who shrugged off his responsibilities during the worst national emergency in a generation and incited a riot on his way out the door — and he did all these things out in the open. Proof of that comes from a new New York Times report, which details how Trump's Justice Department subpoenaed Apple for the communications data of at least two Democratic congressmen — Reps. Adam Schiff and Eric Swalwell, both of California — as well as aides and family members of people connected with the House Intelligence Committee. U.S. TheGrio Ex-state trooper sent himself nude photos from woman’s phone after crash Former Minnesota state trooper Albert Kuehne has pleaded guilty to unlawfully obtaining the private photos of a 25 year-old woman during an arrest made last year. This week, 34 year-old Kuehne pleaded guilty to the “nonconsensual dissemination of private sexual images” for which he is likely to receive two years of probation, NBC News reports. Last March, Kuehne detained an unnamed woman who was suspected of driving while intoxicated after a crash near Minneapolis's Cedar Avenue and Interstate 94. Ex-Minnesota trooper pleads guilty to texting himself nude photos from woman's phone NBC News Ex-Minnesota trooper admits sending himself explicit photos of woman he detained BBC Business Reuters Breaking up Big Tech in focus as new U.S. antitrust bills introduced WASHINGTON (Reuters) -A bipartisan group of lawmakers in the U.S. House of Representatives introduced four bills on Friday aimed at reining in the power of the tech giants, with one potentially leading to their break-up. Two of the bills address the issue of giant companies, such as Amazon.com Inc and Alphabet Inc's Google, creating a platform for other businesses and then competing against those same businesses. One measure bans platforms from owning subsidiaries that operate on their platform if those subsidiaries compete with other businesses - potentially forcing the Big Tech firms to sell assets. Bipartisan lawmakers introduce five bills directed at big tech Yahoo Finance Video Bills that could force Big Tech breakups unveiled in House Associated Press U.S. Associated Press Statue of Black hero of Lewis & Clark trip defaced in Oregon A statue commemorating York, an enslaved Black member of the Lewis and Clark Expedition, was defaced this week in Portland, Oregon. The bust mysteriously appeared in February on a pedestal in a park in Southeast Portland where a statue of Harvey Scott, a well-known conservative and longtime editor of The Oregonian who opposed women's suffrage, stood until it was torn down. After the Lewis and Clark Expedition was over, everyone but York was rewarded with money and land. Politics LA Times Five things to watch at the G-7 summit of allies, Biden's international debut The first three days will center around the annual summit of the Group of 7 leaders from the world's biggest democracies. British Prime Minister Boris Johnson is this year's host and is welcoming Biden and the other heads of state to Cornwall on England's western coast, where Johnson spent summers as a boy. Here are five storylines to watch as the G-7 unfolds through this weekend: 1. Boris Johnson to hold G7 press conference during England's first Euros game Yahoo News UK Bidens and Johnsons bump elbows outside G-7 venue Associated Press Videos U.S. The State Lexington County police charge man in shooting that killed 11-year-old girl A man is jailed on charges that he shot and killed an 11-year-old girl in Batesburg-Leesville in a “gang-related shooting,” according to police. Lexington County Sheriff's Department charged 29-year-old Quayshaun Xzander Clark with murder, attempted murder and gun offenses. Clark fired a “high-caliber gun, known as a Draco,” Sheriff Jay Koon said. Health Raleigh News and Observer Another respiratory illness is spreading across the South, CDC warns. What is RSV? The Centers for Disease Control and Prevention is warning about RSV, a cold-like respiratory illness, amid a spike in cases across the southern U.S. “Due to this increased activity, CDC encourages broader testing for RSV among patients presenting with acute respiratory illness who test negative for SARS-CoV-2, the virus that causes COVID-19,” the advisory states. “RSV can be associated with severe disease in young children and older adults.” U.S. NBC News Unemployed workers in these four states lose their federal benefits this weekend On June 12, unemployed workers in Alaska, Iowa, Missouri and Mississippi will see their pandemic unemployment benefits shut off three months early, the first of 25 Republican-led states to slash federal benefits that would ordinarily expire in September. It's the beginning of a bold, mass, social and economic experiment to see if turning off federal unemployment benefits early for half the country will prod people in those states back to work. The Coronavirus Aid, Relief, and Economic Security (CARES) Act in March 2020 provided a $300 weekly federal supplement on top of regular state unemployment benefits. Alaska, Iowa, Mississippi, Missouri to cut aid on June 12 Yahoo Finance Video Push to end pandemic benefits may not be panacea for U.S. labor shortage Reuters Politics Business Insider Matt Gaetz questioned the head of the FBI in Congress despite himself being under investigation by the FBI Rep. Matt Gaetz questioned FBI Director Christopher Wray at a judiciary committee hearing Thursday. The scene was unusual: Gaetz is himself under investigation by FBI over claims of sex trafficking. Gaetz has retained his place on the panel despite calls for him to be removed. FBI director suggests 'serious charges' coming in probe of Capitol attack Reuters Wray: FBI frowns on ransomware payments despite recent trend Associated Press Lifestyle Architectural Digest These 10 Coastal Hotels Ooze Made-in-America Charm From New England to the Pacific Northwest, plan your summer with these design-forward beach escapes Originally Appeared on Architectural Digest News Yahoo News Video 4 police officers placed on administrative leave after video goes viral WARNING: This contains graphic content. A video showing the arrest of a teenage shoplifting suspect in Glendale, Calif. has sparked outrage and led the police department to place four of its officers on leave pending an investigation. Politics The Independent Pelosi and Democrat leaders issue rare joint statement condemning Ilhan Omar Israel comments Speaker Nancy Pelosi and the other members of the House Democratic leadership group have issued a rare joint statement, criticising comments made by Ilhan Omar that seemed to equate crimes committed by the US and Israel with those of militant groups Hamas and the Taliban. “Drawing false equivalencies between democracies like the US and Israel and groups that engage in terrorism like Hamas and the Taliban foments prejudice and undermines progress toward a future of peace and security for all,” the statement read. Outspoken progressive congresswoman Ms Omar, who was the first Muslim woman elected to Congress, made the first comments in question on Monday, tweeting alongside a video in which she raised a question to the secretary of state, Antony Blinken. Pelosi seeks to quell uproar over Omar's latest comments Yahoo News Rep. Omar says she wasn't equating US, Israel and terrorists Associated Press U.S. Kansas City Star Fundraiser to help pay for funeral of teen shot and killed in Kansas City, Kansas A GoFundMe page has been launched to pay for funeral expenses for 15-year-old Kaden Bauswell, who was shot and killed Tuesday near an elementary school in Kansas City, Kansas. The teenager was a victim of one of several unrelated shootings that left four dead and one wounded across the Kansas City area Tuesday. Kaden's family and community were shocked by his death, according to his uncle Timothy Tripp, who organized the fundraiser. U.S. Lexington Herald-Leader Tenured UK professor accused of research misconduct resigns before termination hearing A tenured professor at the University of Kentucky has tendered his resignation, just days before the UK Board of Trustees was scheduled to hold a hearing on whether to terminate his employment. An attorney for Xianglin Shi and a university spokesman confirmed Friday that Shi has resigned effective June 15. Shi, a professor in the Department of Toxicology and Cancer Biology in the College of Medicine who studied metal toxicity and cancer, and his wife, Zhuo Zhang, a fellow UK professor, had been accused by the university of significant research misconduct regarding published papers. Business BBC Brewdog boss vows to learn after 'toxic culture' criticism A co-founder of Brewdog has promised to listen and learn from savage criticism of the beer company by 60 ex-staff. James Watt told the BBC claims of a \"culture of fear\" and \"toxic attitude\" were tough to hear, but said they would help make him a better chief executive. In an open letter, signatories said a \"significant number\" of former staff had \"suffered mental illness as a result of working at Brewdog\". Craft beer brewer BrewDog accused of being 'cult of personality' with a 'culture of fear' Yahoo Finance UK Ex-Brewdog staff allege culture of fear at brewer BBC Politics The Independent Ex-US ambassador reveals the one thing G7 leaders can do to help Biden keep Trump out of power The former US ambassador to the European Union has revealed the one thing that G7 leaders can do to help Joe Biden keep Donald Trump out of the White House. Anthony Gardner, who represented the Obama administration as ambassador to the EU, says that world leaders should help Mr Biden achieve a real victory against China. This, he claims, would help nullify the one-term president's attacks on Mr Biden and reduce the chance of Mr Trump returning to power in 2024. U.S. USA TODAY 'Brave' grandmother died after struggling with Florida Publix gunman, sheriff says Timothy J. Wall had mental health struggles before he walked into a Florida Publix on Thursday and shot a grandmother, her nearly 2-year-old grandson and then himself. The Palm Beach County Sheriff's Office said Friday it is still investigating what specifically led to the shooting. Maj. Talal Masri on Friday said the gunman first shot the child at the Royal Palm Beach grocery store and that the 69-year-old woman then \"instinctively jumps in and is trying to stop him.\" One-year-old boy, grandmother among three dead after a Palm Beach County Publix shooting Miami Herald A grandmother and her 1-year-old grandchild were killed in the shooting at a Florida Publix INSIDER Politics Business Insider YouTube has blocked Sen. Ron Johnson for 7 days after it removed a video of him spreading coronavirus misinformation YouTube has suspended Sen. Ron Johnson's account for spreading medical misinformation. The Republican routinely holds Senate hearings where he promotes baseless conspiracy theories. Sen. Ron Johnson has been suspended from YouTube for a week after his account uploaded a video of him spreading medical misinformation, in violation of Google's detailed policy on the matter. Republican U.S. Sen. Ron Johnson suspended for a week from YouTube for COVID misinformation USA TODAY Ron Johnson: YouTube suspends Republican senator for seven days over Covid misinformation The Independent Politics The Independent Alexandria Ocasio-Cortez calls for executive action on student loans Congresswoman Alexandria Ocasio-Cortez has called on Joe Biden to fulfil his campaign promise to address the $1.57bn of outstanding student loan debt in the US. Despite campaigning on the proposal to forgive $10,000 of student debt per year, up to $50,000 per adult, Mr Biden has not only failed to fulfil that promise, but he has actively walked back his support. Lawmakers pushed him to broadly forgive $50,000 in student debt to help Americans whose debt payments cannot keep up with the accruing interest, leaving them unable to buy homes, cars and in some cases get married or consider having children. U.S. INSIDER The mother of a teen accused of killing her father and laughing about it on video is a former state senator Sierra Halseth, 16, and Aaron Guerrero, 18, have been charged with killing Halseth's father, Daniel. Halseth's mother is Elizabeth Halseth, a former Republican state senator in Nevada. Daniel Halseth was found stabbed to death and burned on April 9. Teens caught in chilling video laughing about murder, days before being charged in the stabbing death of one of their parents INSIDER Teens joked on video about murder days before being arrested for parent killing The Independent U.S. USA TODAY Pregnant woman was searching for safe place to pull over when police rammed and flipped her SUV, lawsuit says An Arkansas woman says she had no safe place to pull over in July 2020 when a state trooper tried to stop her for speeding, so she turned on her hazard lights and slowed down. Dashcam footage, obtained by anattorney representing Janice Harper, shows Harper appearing to slow down with her hazard lights on after trooper Rodney Dunn initiated a traffic stop. Two minutes and seven seconds after the police car first turned on its lights, the cruiser bumped the left rear edge of Harper's vehicle in a Pursuit Intervention Technique (PIT) maneuver, which is often used in police chases, causing her vehicle to swerve across Highway 67/167, hit a barrier and flip upside down. Will vaccine giveaways actually work? “It may seem desperate at this point, but I can’t be mad at any and all efforts to get people vaccinated.” “I won’t get rich, but I will get to live my life. That seems like reward enough.” “Offering incentives may encourage people who are not actively opposed to vaccination but may have put it off.” “At some point, the government is simply rewarding irresponsible behavior.” “Sure, people should do it without needing an incentive. But what’s the alternative? Not enough people get vaccinated.” Read the 360 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n"
}