{
    "docno": "RJP345",
    "url": "https://creatorstate.ucr.edu",
    "text": "\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n The Creator State | \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Skip to main content \n \n University of California, Riverside \n \n \n \n \n Search \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n UC Riverside \n \n \n \n \n  The Creator State  \n \n \n \n \n \n \n \n \n \n \n \n \n \n Search \n \n \n \n \n \n Home \n \n \n Episodes Archives \n \n \n \n \n \n \n Home \n \n \n Episodes Archives \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n   \n \n \n Stories of social innovation, art, and entrepreneurship from movers, shakers, change-makers, and creators.  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n   \n \n THE CREATOR STATE  PODCAST \n Brought to you by UC Riverside, each episode will celebrate success (and failure!), ingenuity, and the endless pursuit of knowledge. Tune in for bright ideas born from the Golden State – you’ll find inspiration whether you’re just starting out or already on your way to creating something great. \n \n \n \n \n \n \n \n \n \n \n \n \n \n   \n \n LISTEN ON  PODCAST \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n   \n Rickerby Hinds \n Rickerby Hinds (playwright, screenwriter, producer) is a professor of playwriting at UC Riverside and winner of three NAACP Theatre Awards. A native of Honduras, he moved to South Central Los Angeles at 13. Hinds’ play, “Daze to Come,” debuted in 1989 as the first full-length play to use the founding elements of hip hop as the primary language of the stage. He received his Master of Fine Arts degree in playwriting from UCLA’s School of Theater, Film, and Television, where he was twice awarded the Audrey Skirball-Kenis Award for best play. Hinds is the co-writer of the film “My Name is Myeisha,” an adaptation of his world-renowned play “Dreamscape” about a local 19-year-old girl killed by police.  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n   \n   \n \n \n \n \n \n \n \n \n   \n \n \n \n \n \n \n \n \n \n   \n \n \n Tod Goldberg: \n “The Low Desert: Gangster Stories”  \n Crime novelist Tod Goldberg has made a career of writing about bad people behaving badly. A New York Times bestselling author of over a dozen books, including the popular “Burn Notice” series. \n Listen to the Episode \n \n \n \n \n \n \n \n \n \n   \n \n \n Denise Verret: \n Los Angeles Zoo and Botanic Gardens  \n Can you name the fastest land mammal in North America? If you guessed pronghorn, you’re right. In the world, they’re second only to the cheetah. \n Listen to the Episode \n \n \n \n \n \n \n \n \n \n   \n \n \n Tom Lutz: \n Born Slippy  \n Tom Lutz's novel, \"Born Slippy,\" debuts as he says his academic career is winding down, giving him the freedom and confidence to write as he pleases—nay, as his characters dictate. Tune in to hear how wandering off, traveling the world, and procrastination have helped Tom arrive where he is today, writing more than ever before. \n Listen to the Episode \n \n \n \n \n \n \n \n \n \n   \n \n \n Susan Straight: \n In the Country of Women  \n Susan Straight was born in Riverside and still proudly calls it home. Learning this about her comes as a surprise to many. But for Susan, the best, most powerful stories often begin at home. \n Listen to the Episode \n \n \n \n \n \n \n \n \n \n   \n \n \n Eugene Kang: \n Country Archer Jerky Co.  \n Entrepreneur Eugene Kang’s summer road trip stop for a snack led him to become the co-founder and CEO of Country Archer Jerky Company, one of the fastest-growing private companies in the United States. \n Listen to the Episode \n \n \n \n \n \n \n \n \n \n   \n \n \n Fatima Farheen Mirza: \n A Place for Us  \n New York Times bestselling author Fatima Farheen Mirza found her passion for writing in a classroom at UC Riverside. Her debut novel “A Place for Us” was the first release from Sarah Jessica Parker’s publishing imprint and was named one of the best books of 2018 by The Washington Post, NPR, and People magazine. \n Listen to the Episode \n \n \n \n \n \n \n \n \n \n   \n \n \n Nwaka Onwusa: \n Rock & Roll Hall of Fame  \n UCR alumna Nwaka Onwusa’s career path to curating music history at the Grammy Museum and her new role at the Rock & Roll Hall of Fame all started in the UCR theatre box office. \n Listen to the Episode \n \n \n \n \n \n \n \n \n \n   \n \n \n Chris Jordan: \n Intolerable Beauty  \n Chris Jordan is a photographer, artist, and environmental advocate. His UCR ARTS exhibition “Intolerable Beauty” explores the consequences of mass consumption and global plastics pollution alongside the beauty of the natural world. \n Listen to the Episode \n \n \n \n \n \n \n \n \n \n   \n \n \n Regina Louise: \n I Am Somebody's Child  \n Regina Louise, an author and UCR alumna whose memoirs of growing up in the foster system inspired the Lifetime movie “I Am Somebody’s Child.” \n Listen to the Episode \n \n \n \n \n \n \n \n \n \n   \n \n \n Taylor Pollard: \n Flexin’ In My Complexion  \n When UCR alumna Taylor Pollard posted a photo to Twitter of her preteen sister Kheris Rogers with the hashtag #FlexinInHerComplexion after she’d been bullied at school, the photo went viral. Now co-CEOs of Flexin’ In My Complexion, their apparel line is evolving into a non-profit foundation that aims to empower young people of color. \n Listen to the Episode \n \n \n \n \n \n \n \n \n \n   \n \n \n Rafael Lopez: \n Alf Alpha and Super Sonido Sistema  \n Rafael Lopez, also known as Alf Alpha, is a UC Riverside alumnus who went from playing soccer and DJing concerts on campus to playing music for festival-goers at Coachella. \n Listen to the Episode \n \n \n \n \n \n \n \n \n   \n   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n More Episodes \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n University of California, Riverside \n \n 900 University Ave. \n            Riverside, CA 92521 \n Tel: (951) 827-1012 \n \n \n UCR Library \n Campus Status \n Campus Store \n Career Opportunities \n Diversity \n Maps and Directions \n Visit UCR \n \n \n \n \n \n University of California, Riverside \n \n               900 University Ave.\n             Riverside, CA 92521                          \n                         email:  creatorstate@ucr.edu   \n \n \n \n \n \n Follow US: \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Privacy Policy \n Terms and Conditions \n © 2021 Regents of the University of California \n \n \n \n \n \n \n \n \n \n \n × \n \n \n \n \n \n \n Let us help you with your search \n \n \n Enter your Search Criteria. \n \n \n \n Search \n \n \n Cancel \n \n \n \n \n \n \n \n \n \n \n \n \n"
}