{
    "docno": "RJP365",
    "url": "https://csp.ucr.edu/programs-services/our-program",
    "text": "\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Events | Chicano Student Programs \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Due to the impact of COVID-19, our Ethnic & Gender campus locations are closed until further notice. Our staff is working remotely and available to support you along your Highlander journey. We look forward to being back on campus and supporting you in-person. Please continue to wash your hands, wear a face covering, and maintain physical distance. \n \n × \n \n \n \n \n \n \n \n \n \n \n \n \n \n Skip to main content \n \n University of California, Riverside \n \n \n \n \n \n \n A to Z Listing \n \n \n Campus Map \n \n \n Find People \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n UC Riverside \n \n \n \n \n  Chicano Student Programs  \n \n \n \n MÁS DE 45 AÑOS DE FAMILIA, ORGULLO Y CORAZÓN \n \n \n \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n Home \n \n \n Programs and Services \n \n \n SCHOLARSHIPS & INTERNSHIPS \n \n \n Awards & Honors \n \n \n MUNDO CHICANO/LATINO THEME HALL \n \n \n AB 540 RESOURCE GUIDE \n \n \n \n \n Get Involved \n \n \n Student Organizations \n \n \n Outreach \n \n \n Chicano Link Peer Mentor Program  \n \n \n \n \n Alumni \n \n \n Giving to CSP \n \n \n \n \n Events \n \n \n CÉSAR E. CHÁVEZ 5K RUN/WALK  \n \n \n Radio Aztlan \n \n \n Raza Grad 2021 \n \n \n \n \n Contact Us \n \n \n Contact CSP \n \n \n Applications and Forms \n \n \n Common Ground Partners \n \n \n \n \n \n \n \n \n \n \n A to Z Listing \n \n \n Campus Map \n \n \n Find People \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Breadcrumb \n \n \n \n \n \n \n \n \n \n Events \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n   \n \n \n \n \n \n   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Events \n \n See Events Calendar \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Events-Spring \n César E. Chávez 5K Run/Walk \nThis exciting annual spring quarter 5K run and walk takes place at UCR and helps further César E. Chávez’ inspirational message of service while raising funds for scholarships that benefit students at UCR. For information about the César E. Chávez 5K Run/Walk, please contact us. \n Radio Aztlan Music Festival \nKUCR's Radio Aztlan and Chicano Student Programs host this exciting music festival each April. The festival provides a platform for many talented regional and underground Chicano/Latino musical artists who deserve more exposure. \nRadio Aztlan also presents awards for lifetime achievement at the festival as a way to recognize those who have made outstanding contributions to our community. \nLearn more about  Radio Aztlan  and  get in touch. \n Cinco de Mayo Celebration \nCinco de Mayo honors the May 5, 1862 Mexican victory at Puebla. Over the years, Cinco de Mayo has become a symbol of our quest for freedom and self-determination. Every year Chicano Student Programs sponsors a Cinco de Mayo celebration, encouraging UCR students, staff, faculty and community members to join us for a day of cultural entertainment honoring this symbolic day. \nFor information about our Cinco de Mayo Celebration, please contact us. Find details on all upcoming events on our event calendar. \n Semana de la Raza \nThis weeklong program takes place in May and highlights the Chicano/Latino cultura. Each of its events serves to celebrate our heritage, educate ourselves and others about our culture and to discuss issues pertaining to our Raza. Events include film screenings, guest speakers and workshops. \n Chicano/Latino Graduation Banquet  \nThis annual banquet, commencement and awards ceremony, known informally as “Raza Grad,” takes place in June and brings together la familia in order to honor the achievements of our graduating Chicano/Latino students. The event features an invocation and processional, a special awards ceremony, a catered dinner and some amazing keynote speakers. Please contact us for more information about our Chicano/Latino Graduation Banquet. Find details on all upcoming events on our event calendar. \n \n \n \n \n \n \n \n \n \n \n \n \n Events- Fall \n Chicano/Latino Orientation Week \nThe annual Chicano/Latino Orientation week provided by the office of Chicano Student Programs serves as a welcome to incoming and returning students. The week-long series provides students with programs and workshops as well as introductions to staff and faculty on campus. Students are introduced to the office of Chicano Student Programs as well as opportunities for involvement and upcoming events. Furthermore, the week provides students with a smooth transition to UCR with our overall message being familia orgullo and corazón. \n Chicano/Latino Bienvenida \nA part of the Chicano/Latino Orientation, a series of introductions to staff, faculty and resources. The annual Chicano/Latino Bienvenida welcomes you to the UCR familia with a special program that includes refrescos, comida, música and great company. Meet returning students as well as current staff and faculty. Special performances by community and student organizations. You do not want to miss it! \n Día de los Muertos Celebration \nDía de los Muertos, or Day of the Dead, is a celebration that captures the unity between life and death. It is a spiritual and cultural tradition recognized throughout Latin America and the Southwestern United States. \n Every November, Chicano Student Programs and Teatro Quinto Sol co-sponsor a Día de los Muertos celebration. Student organizations, community members, and UCR faculty and staff are encouraged to set up an altar in honor of our antepasados. \nFor more information, contact CSP. \n Poesía Peligrosa  \nThis poetry, storytelling and spoken word night takes place once a quarter and is hosted by the student organization Teatro Quinto Sol. It features performances from both professional artists and those who participate in the evening’s open-mic format. The event promotes cultural understanding and community unity while providing a unique platform for spoken word.  \n CSP Networking Potluck \nCSP invites you to attend our Annual December Potluck traditionally held the Friday before finals week of the Fall Quarter. The event is hosted at the office located at 145 Costo Hall. Attendees are encouraged to bring a special dish to share, but it is not mandatory, we’ll provide the tamales! Don’t miss out on the fun, which includes música, comida and great compañía! \n \n \n \n \n \n \n \n \n \n \n \n \n Events- Winter \n Noche Cultural \nThis annual, one-night performing arts celebration typically takes place in January and features music, dance and spoken word from talented Chicano/Latino artists and groups. These engaging artistic mediums help promote cultural understanding and develop community unity. Audiences are not only entertained, but learn more about our traditions. Local cultural groups also benefit from a performance outlet they might not otherwise have. Key collaboration with other UCR organizations help make this event a success every year. \nFor information about Noche Cultural, please contact us. Find details on all upcoming events on our event calendar. \n Semana de la Mujer \nThis weeklong program takes place in March (Women’s History Month) and highlights the achievements of Chicana/Latinas. Each of its events pays tribute to the everyday soldaderas who stand up for their beliefs, cultivate cultural traditions, participate as decision makers and continue to shape our future. \n Events include film screenings, guest speakers, workshops, conferences, social gatherings and the publication of a literary magazine featuring the work of Chicana/Latina writers. \n For information about Semana de la Mujer,  please contact us . Find details on all upcoming events on our event calendar. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n University of California, Riverside \n \n 900 University Ave. \n            Riverside, CA 92521 \n Tel: (951) 827-1012 \n \n \n UCR Library \n Campus Status \n Campus Store \n Career Opportunities \n Diversity \n Maps and Directions \n Visit UCR \n \n \n \n \n \n \n \n \n Chicano Student Programs \n \n               145 Costo Hall\n             Riverside, CA 92521                          \n  tel: (951) 827-3821                         email:  estella.acuna@ucr.edu   \n \n \n  Find Us \n \n \n \n \n Follow US: \n \n Facebook \n Csp_UCR \n \n \n \n \n \n Related Links \n \n \n African Student Programs \n \n Asian Pacific Student Programs \n \n Chicano Student Programs \n \n LGBT Resource Center \n \n Native American Student Programs \n \n Middle Eastern Student Center \n \n Undocumented Student Programs \n \n Women's Resource Center \n \n \n \n \n \n \n \n \n \n \n \n \n \n Privacy Policy \n Terms and Conditions \n © 2021 Regents of the University of California \n \n \n \n \n \n \n \n \n \n \n × \n \n \n \n \n \n \n Let us help you with your search \n \n \n Enter your Search Criteria. \n \n \n \n Search \n \n \n Cancel \n \n \n \n \n \n \n \n \n \n \n \n \n"
}