{
    "docno": "RJP332",
    "url": "https://www.vice.com/en/article/wx5xen/researchers-create-soil-catalyst-to-make-farming-on-mars-a-reality",
    "text": "Researchers Create Soil Catalyst to Make Farming on Mars a Reality \n \n \n Sign In Create Account + English VICE Video TV News Tech Rec Room Food World News The 8:46 Project Games Music Health Money Drugs Identity Entertainment Environment Travel Horoscopes Sex VICE Magazine The Gender Spectrum Collection VICE Sign In Create Account Video TV Podcasts Apps VICE Voices  Newsletters Rec Room News Tech Rec Room Food World News The 8:46 Project Games Music Health Money Drugs Identity Entertainment Environment Travel Horoscopes Sex VICE Magazine The Gender Spectrum Collection About  Jobs Partner VICE Voices Content Funding on VICE Security Policy Privacy & Terms Accessibility Statement ©  2021  VICE MEDIA GROUP Researchers Create Soil Catalyst to Make Farming on Mars a Reality Perchlorate, a dangerous chemical compound, is abundant in Martian soil. A new catalyst could help remove this contaminant on Earth, and beyond it. by  Becky Ferreira June 8, 2021, 1:00pm Share Tweet Snap Mars. Image: NASA/JPL-Caltech/ASU/MSSS Abstract ABSTRACT breaks down mind-bending scientific research, new discoveries, and major breakthroughs. See More → Humans have dreamed of setting foot on Mars for more than a century, but the inhospitable conditions on the red planet present numerous challenges for future astronauts.  For instance, any Martian explorers hoping to live off the land will have to confront the chemical compound perchlorate, which exists in relatively high concentrations on the planet’s surface. Perchlorate is already known to be a dangerous contaminant here on Earth that can cause serious thyroid and lung problems. This public health issue has inspired efforts to remove it from drinking water, food, and other sources, most of which involve  complicated multi-step techniques that may require extreme temperatures and conditions.  Advertisement Now, a team of scientists has developed a bioinspired catalyst that simplifies the perchlorate removal process and  destroys 99 percent of the contaminant  at ambient temperatures and pressures. The results provide “a water-compatible, efficient, and robust catalyst to degrade and utilize [perchlorate] for water purification and space exploration,” according to  a recent study published  in the  Journal of the American Chemical Society .  The new research builds on past experiments that make use of anaerobic microbes, tiny organisms that live in oxygen-poor environments. Some of these organisms can survive by harvesting oxygen atoms inside perchlorate, which effectively breaks down the pollutant. The microbes can be cultivated to do this work in industrial reactors, but it can take weeks or months to establish working stability in this process. “That means you need some very long time to get prepared,” said Jinyong Liu, an assistant professor of chemical and  environmental engineering  at UC Riverside's Marlan and Rosemary Bourns College of Engineering, who co-authored the new study, in a call. “The motivation for our catalyst is that we just want to finish the work in a single day.” Advertisement “Right now, we have made it very stable, and it can survive under very challenging concentrations,” he added. The catalyst can be used to break down perchlorate at concentrations lower than one milligram per liter up to 10 grams per liter, which means it can be used in many contexts, from  treating groundwater to detoxifying  Martian soil. To achieve this result, Liu and his colleagues developed a system based on the chemical element molybdenum, a metal that microbes use as part of their enzymatic harvesting of perchlorate. Using a mix of common fertilizer containing molybdenum, a binding molecule called bipyridine, a catalyst called palladium on carbon, and hydrogen gas, the researchers were able to rapidly disintegrate perchlorate in water at room temperature. Lui and study co-author Changxu Ren, a doctoral student at UC Riverside, also demonstrated that the precious metal rhenium can improve the stability and self-sustainability of this catalyst design, according to  another recent study published  in  ACS Catalysis . The two studies provide prototypes of technologies that could streamline the perchlorate removal process both here on Earth and in future human missions to Mars.  While perchlorate can occur naturally on Earth, it’s also commercially produced as an oxidizer in rocket propellants, pyrotechnics, flares, and other explosives, which can lead to industrial pollution. Liu’s team is already in preliminary discussions with water industry specialists about evaluating their system as a means of mitigating perchlorate contamination.  Advertisement “We are planning to convert these systems into pilot-scale demonstrations, because at least we can solve some issues on Earth like perchlorate-contaminated sites,” Liu said. The researchers also intend to consult with space exploration experts about the potential for their system to help future interplanetary explorers survive the unforgiving environment on Mars. Breaking down perchlorate on Mars would not only remove a harmful contaminant from the soil, it could also provide useful ingredients for rocket fuel and life support.  “Right now we're working on some further advanced catalyst formulations,” Liu noted. “We follow the same design strategy, but we have done more modification to the structure so that it can survive under even more harsh conditions.”  Despite the fact that it will likely take decades or longer to land humans on Mars, Liu concluded that “all of the technology can be started early.” Tagged: Mars Abstract Chemical contaminants perchlorate ORIGINAL REPORTING ON EVERYTHING THAT MATTERS IN YOUR INBOX. Subscribe By signing up to the VICE newsletter you agree to receive electronic communications from VICE that may sometimes include advertisements or sponsored content. Advertisement About  Jobs Partner VICE Voices Content Funding on VICE Security Policy Privacy & Terms Accessibility Statement ©  2021  VICE MEDIA GROUP"
}