{
    "docno": "RJP300",
    "url": "https://irecruitportal.ucr.edu/irecruit/!Controller?action=jobs_webui.show_page&page=jobs_detail&requisition_id=22688429&profile_id=&module=jobs",
    "text": "\n \n UCR Jobs - Position Details  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Skip Navigation \n \n \n Home Page \n \n \n \n \n \n \n \n \n Login   \n Register   \n \n \n \n \n \n \n \n HR Employment \n \n \n \n \n \n \n \n \n \n Home \n Browse Jobs \n How to Apply \n My Account \n Help \n About \n \n \n \n \n \n \n \n \n \n \n Position Details \n \n \n \n View All Details \n  \n          Back To Current Job Opportunities\n     \n \n Apply \n \n \n \n SRA 3     \n \n \n \n \n  Job Number \n  Full/Part Time  \n  Schedule    \n  Salary \n \n \n \n \n  22688429  \n  Full Time     \n  7AM - 4PM     \n      $58,454 -     $94,002     \n \n \n \n \n Position Information \n  \nA full-time position for a Staff Research Associate 3 (SRA3) is available in the program of Dr. Andreas Westphal. Dr. Westphal is extension nematologist associated with the University of California Riverside, stationed at the Kearney Ag Center. The focus of his program is on nematode management on walnut, almond, pistachio, and grapes. This opening is for a full-time employee who has experience in agricultural research, preferably in nematology or perennial crops. The purpose of the position is to assist and conduct agricultural research projects in perennial nematology. Knowledge of experimental design, and the command of the requirements when generating publishable research data are prerequisite. Knowledge of agricultural equipment will be beneficial for the successful candidate. Implements used in the program include irrigation systems, chemigation tools, and various agricultural research tools. The incumbent is expected to have or to be willing to obtain a California Pesticide Applicators license (Department of Pesticide Regulation). After initial training, tasks will be assigned for conduct under minimal supervision. Recurring tasks include collecting soil and plant samples, extract nematodes from soil samples, and oversee greenhouse operations and plant care. Note keeping and initial data entry and curation are part of the tasks in this position. The incumbent in this position will be involved in most aspects of the program with an emphasis on the development of nematode resistant and tolerant rootstocks. \n\nEducation or experience equivalent to a Bachelor of Sciences in some biological field of study is required plus five years of position-relevant obligation. Alternatively, a MS degree plus two years of experience in agricultural research with specific knowledge of general agricultural practices is acceptable. Excellent organizational skills are necessary. Team players are preferred. A California Driverâ\u0080\u0099s license is prerequisite for this position. Adaptability to various research scenarios and willingness to travel within the state are required. The position carries phases of unregular work schedules, and requires work during inclement weather conditions. The incumbent needs to be able and willing to work under adverse temperature conditions. Minimal capacity to repeatedly lift and carry >50 lbs of weight is required. \n\n*Please note, this position is located in Parlier, CA**\n\n****This position is for an early career research associate and as such, the budgeted salary range for this position is $58,454.43 to $59,616.00, depending on the experience of the final candidate.\t\n    \n     \n  Education   \n \n  Education Requirements  \n \n \n  Degree  \n  Requirement  \n \n \n \n  Bachelor's Degree  \n  Preferred  \n \n \n \n \n  Licenses  \n \n \n  License  \n  Requirement  \n \n \n \n  California Driver's License  \n  Required   \n \n \n \n \n  Certifications  \n \n \n  Certification  \n  Requirement  \n \n \n \n  California Pesticide Applicators license (Department of Pesticide Regulation)  \n  Preferred   \n \n \n \n \n \n  Experience   \n \n \n \n  Experience  \n  Requirement \n \n \n \n  Minimum of 5   years of related experience.   \n  Preferred   \n \n \n \n \n \n  Special Conditions   \n \n \n \n  Special Condition  \n  Requirement  \n \n \n \n  Valid Drivers License  \n  Preferred   \n \n \n  The position carries phases of unregular work schedules, and requires work during inclement weather conditions. The incumbent needs to be able and willing to work under adverse temperature conditions.  \n  Required   \n \n \n  Minimal capacity to repeatedly lift and carry >50 lbs of weight.  \n  Preferred   \n \n \n  Adaptability to various research scenarios and willingness to travel within the state are required  \n  Required   \n \n \n \n \n \n  Minimum Requirements  \n Knowledge of experimental design, and the command of the requirements when generating publishable research data High levels of organizational and communication skills   \n  Preferred Qualifications   \n Knowledge of agricultural equipment   \n Additional Information  \n In the Heart of Inland Southern California, UC Riverside is located on nearly 1,200 acres near Box Springs Mountain in Southern California; the park-like campus provides convenient access to the vibrant and growing Inland region. The campus is a living laboratory for the exploration of issues critical to growing communities' air, water, energy, transportation, politics, the arts, history, and culture. UCR gives every student, faculty and staff member the resources to explore, engage, imagine and excel. UC Riverside is recognized as one of the most ethnically diverse research universities in the country boasting several key rankings of which we are extremely proud.     UC Riverside is proud to be ranked No. 12 among all U.S. universities, according to Money Magazine's 2020 rankings, and among the top 1 percent of universities worldwide, according to the 2019-20 Center for World University rankings.     UC Riverside is the top university in the United States for social mobility. - U.S. News 2020     UCR is a member of the University Innovation Alliance, the leading national coalition of public research universities committed to improving student success for low-income, first-generation, and students of color.     Among top-tier universities, UC Riverside ranks No. 2 in financial aid. - Business Insider 2019     Ranked No. 2 in the world for research, UCR's Department of Entomology maintains one of the largest collections of insect specimens the nation. - Center for World University Rankings     UCR's distinguished faculty boasts 2 Nobel Laureates, and 13 members of the National Academies of Science and Medicine.      The University of California is an Equal Opportunity/Affirmative Action Employer with a strong institutional commitment to the achievement of excellence and diversity among its faculty and staff. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veteran status, or any other characteristic protected by law.   For information about our generous employee benefits package, visit:  Employee Benefits Overview   \n Job Description Details \n \n  View complete Job Description for this position   \n \n \n \n \n \n \n \n \n \n \n More Information \n \n \n \n General Campus Information \n \n University of California, Riverside \n \n 900 University Ave. \n \n Riverside ,  CA  92521 \n \n \n                                Tel:  (951) 827-1012 \n \n \n \n Career Opportunities \n                            •  UCR Libraries \n \n Campus Status \n                            •  Maps and Directions \n \n \n \n Department Information \n \n Human Resources \n 1160 University Ave. \n Riverside, CA 92521\n                                     \n Fax: (951) 827-6493\n                                     E-mail:  jobshelp@ucr.edu \n \n \n \n Related Links \n \n Human Resources Home \n Diversity \n About UCR \n \n \n \n \n \n \n \n \n Campuswide Navigation \n \n \n Home \n \n \n About UCR \n \n \n Academics \n \n \n Admissions \n \n \n Athletics \n \n \n Happenings \n \n \n Research \n \n \n Campus Resources \n \n \n Giving to UCR \n \n \n \n Footer \n \n \n \n Privacy Policy \n \n \n Terms and Conditions \n \n \n                            © 2010 Regents of the University of California\n                         \n \n                            Last modified: 2010-Apr-22\n                         \n \n \n \n \n   \n \n \n"
}