{
    "docno": "RJP378",
    "url": "http://ucresearch.tumblr.com",
    "text": "University of California Research About Ask Submit Archive The COVID vaccine came out super quickly. Here’s why it’s safe. There are different types of vaccines, but they all have the same purpose. The first one ever created was for smallpox. A doctor realized that people who got a milder but similar virus called cowpox seemed to be immune to smallpox. By fighting off cowpox, the body had learned to recognize smallpox and produce antibodies to ward it off. This is fundamentally how vaccines function today. Teaching the body to fight smallpox, however, required injecting cow scabs into humans, and risking real illness. Although traditional vaccines have taken years to develop, scientists have harnessed a much faster method for the COVID vaccine. The technique, used to create both the Moderna and Pfizer vaccines, uses mRNA — or messenger RNA — to make harmless versions of the spike proteins found on the COVID-19 virus. In earlier vaccines, scientists had to make those proteins in a lab and then transfer them into the vaccine. With mRNA, our body produces the proteins — a vastly quicker and more efficient process. It does this so well because our body already knows how to make mRNA (and does all the time). mRNA is like a blank piece of paper that our cell nucleus encodes instructions into in order to make proteins that control bodily processes, like hormones. Our cell nucleus then “mails” the mRNA it’s encoded out into the rest of the body. This process happens inside us every moment of the day. Read more  #science #vaccine #covid19 #mrna #mrna technology 44 notes ,\n         3 weeks ago Remember when the pandemic started and some people were really into baking bread? Lots of people embraced the comfort of sourdough to get them through the frightening first months of the pandemic. Ironically, the reason we can eat bread at all is because thousands of years ago a virus helped us develop a new enzyme that made it easier to digest carbohydrates. Viruses have developed hand-in-hand with humankind, sometimes — as we’ve seen with COVID-19 — to deadly effect. Humans have fought back, developing in the process the concept of vaccines, with the first effective, modern vaccine coming on the scene more than 200 years ago. Today’s COVID-19 vaccines work in much the same way as those early inoculations but are safer and more effective. It’s true that they were developed with historic speed — but only because they were built on decades of basic research that allowed us to deliver them in record time. #science #viruses #covid19 #vaccine #mrna technology 1692 notes ,\n         3 weeks ago Ready for the next big disaster? Here’s what we do if an asteroid is headed to earth Asteroids hitting the Earth have been a staple of Hollywood blockbusters for years. But what happens if there actually was an asteroid hurtling towards us? \n Luckily, there are people like Kirsten Howley, a Lawrence Livermore National Lab researcher, who has a game plan for dealing with this potential danger. And strangely enough, it doesn’t seem to involve Bruce Willis. #space #asteroids #video #science #nasa 37 notes ,\n         3 months ago What Hollywood gets wrong (and right!) about protecting the Earth from asteroids In the 1998 movie, “Armageddon,” an asteroid the width of Texas is about to hit Earth. The heroes who stop it in just the nick of time are a group of orange-suited Americans, all men. Life isn’t always like the movies. Not that an asteroid couldn’t slam into Earth, mind you. Asteroids — mostly tiny ones — pass by our planet virtually every second. But the people charged with stopping the big ones aren’t reaching for their spacesuits with mere hours to spare. And spoiler alert: They also aren’t all men. “I would say the number one question I get when I tell people what I work on, is ‘Oh, like ‘Armageddon?’’ And it’s nothing like ‘Armageddon,’” says Lawrence Livermore National Lab physicist Kirsten Howley, whose day job includes defending our planet from asteroids. Howley doesn’t have an orange jumpsuit at hand, but her job is serious business. She and her team of planetary defenders specialize in how we might deflect an asteroid that poses a threat to Earth. Read more #asteroids #hollywood #space #armageddon #bruce willis 3358 notes ,\n         4 months ago The woman whose research helped spark the modern gay rights movement Five years ago, the Supreme Court allowed same-sex marriage to become the law of the land when it struck down the Defense of Marriage Act, which defined marriage as between one man and one woman. It was a victory built on generations of tireless advocacy, election day disappointments and spurts of progress across the country. One of the key elements to winning this battle was research, notably that of UCLA psychologist Evelyn Hooker. In the 1940s and 50s, when gay men could be arrested just for being gay, Hooker bucked the norms of her era and studied them like any other subject. Her groundbreaking work showed that being gay was not a mental illness. Read more #gay rights #lgbtq #gay #psychology #science on tumblr 62 notes ,\n         11 months ago ucresearch : How one woman’s research in the 1940s changed queer life forever This Pride month, we saw a landmark victory for LGBTQ workers’ rights in the Supreme Court, and the fifth anniversary of gay marriage! One person we have to thank for that is UCLA’s Dr. Evelyn Hooker, who sought to change the understanding of homosexuality as a mental illness in the 1940s.  Her groundbreaking study showed gay people were not ill and in need of a cure. Her research made it all the way to the Supreme Court and helped change queer life forever. #activism #gay rights #lgbtqia #lgbtq pride #history 161 notes ,\n         11 months ago ucresearch : How the census overlooks the LGBTQ community The old expression is  “ if you aren’t counted, then you don’t count.”  And the census, administered every 10 years, is the primary tool by which you are counted. In 2020, for the first time ever, the U.S. census will ask directly whether adults are involved in same- or opposite-sex married or unmarried partnerships, in order to improve the accuracy of information about the true number of same-sex relationship households in the U.S. Sixteen years after gay marriage first became legal in Massachusetts, and five years after it became legal across the country, it’s a landmark achievement for those who have fought for decades to be recognized as equals. But, according to Kerith Conron from UCLA’s Williams Institute, it needs to go further. She estimates that the census overlooks about  80 percent  of adults in the LGBTQ community. If you are a lesbian, but not living with a partner, or if you identify as transgender, you are invisible. If you are a bi- or queer-identified person living with an opposite-sex partner, you are also invisible. If you aren’t living with a same-sex partner, you are invisible. This creates a huge gap in our ability to understand and provide services to the LGBTQ community, with a particularly high cost for transgendered people, who suffer from a lack of good data and corresponding resources.  Their push for visibility in other surveys has made a difference, according to Conron: “Even doing an analysis of federal funding for transgender research, I’ve seen a major increase in the number of grants funded for transgender folks in the last 10 years.”  And it isn’t as though we don’t know how to ask these questions — the Williams Institute has even developed a  series of best practices  for doing so. Despite the shortcomings of the current census, Conron believes that it will eventually become more and more inclusive. “I am confident that there are many people in federal government that believe inclusive data collection is a priority and that data collection will move forward,” states Conron. Watch more of our videos here #science on tumblr #census #gay #trans #lgbtq pride 208 notes ,\n         11 months ago Watch our science videos here #climate change #science on tumblr #science #engineering #co2ncrete #UCLA 897 notes ,\n         11 months ago How a 1940s psychology study sparked the modern gay rights movement This Pride month, we saw a landmark victory for LGBTQ workers’ rights in the Supreme Court, and the fifth anniversary of gay marriage! Behind the scenes, researchers help make these victories happen. From Dr. Evelyn Hooker, who showed homosexuality was not an illness in the 1940s, to Jody Herman, who documents the needs and realities of trans people today, UC researchers and their work are reaching all corners of the legal and medical communities and changing queer life forever — and the world. Read more #science on tumblr #gay rights #lgbtq #ucla #psychology #science 22 notes ,\n         11 months ago How one woman’s research in the 1940s changed queer life forever This Pride month, we saw a landmark victory for LGBTQ workers’ rights in the Supreme Court, and the fifth anniversary of gay marriage! One person we have to thank for that is UCLA’s Dr. Evelyn Hooker, who sought to change the understanding of homosexuality as a mental illness in the 1940s.  Her groundbreaking study showed gay people were not ill and in need of a cure. Her research made it all the way to the Supreme Court and helped change queer life forever. #ucla #gay #science #psychology #pride 2020 #pride2020 #pride #evelyn hooker #lgbtq 161 notes ,\n         11 months ago “Our long-range strategy has to be to abolish imprisonment … It tends to reproduce the very problems it purports to solve.” — Angela Davis,  Imagining a world without prisons  #angela davis #incarceration #prison #quote #quotes 263 notes ,\n         2 years ago How the census overlooks the LGBTQ community The old expression is  “ if you aren’t counted, then you don’t count.”  And the census, administered every 10 years, is the primary tool by which you are counted. In 2020, for the first time ever, the U.S. census will ask directly whether adults are involved in same- or opposite-sex married or unmarried partnerships, in order to improve the accuracy of information about the true number of same-sex relationship households in the U.S. Sixteen years after gay marriage first became legal in Massachusetts, and five years after it became legal across the country, it’s a landmark achievement for those who have fought for decades to be recognized as equals. But, according to Kerith Conron from UCLA’s Williams Institute, it needs to go further. She estimates that the census overlooks about  80 percent  of adults in the LGBTQ community. If you are a lesbian, but not living with a partner, or if you identify as transgender, you are invisible. If you are a bi- or queer-identified person living with an opposite-sex partner, you are also invisible. If you aren’t living with a same-sex partner, you are invisible. This creates a huge gap in our ability to understand and provide services to the LGBTQ community, with a particularly high cost for transgendered people, who suffer from a lack of good data and corresponding resources.  Their push for visibility in other surveys has made a difference, according to Conron: “Even doing an analysis of federal funding for transgender research, I’ve seen a major increase in the number of grants funded for transgender folks in the last 10 years.”  And it isn’t as though we don’t know how to ask these questions — the Williams Institute has even developed a  series of best practices  for doing so. Despite the shortcomings of the current census, Conron believes that it will eventually become more and more inclusive. “I am confident that there are many people in federal government that believe inclusive data collection is a priority and that data collection will move forward,” states Conron. #transgender #lgbtq #ucla #the census #politics 208 notes ,\n         2 years ago How the census overlooks the LGBTQ community When it comes to who identifies as LGBTQ, there’s a generation divide in the United States. Studies show between 3 to 4.5 percent of adults identify as LGBTQ — compared to about 8 to 9 percent of teenagers.  If only we had an incredibly powerful tool to validate this trend across the population.  The thing is, we do: it’s the U.S. census. But even its new and improved design makes it hard for us to understand matters of gender and sexual identity.  Kerith Conron of UCLA’s Williams Institute explains who the 2020 U.S. census is counting, who it’s not, and why, in our new video. #lgbtq #ucla #lgbtq community #gay #transgender 96 notes ,\n         2 years ago “To fight sexual harassment, we must start with better wages” Claudia Chi Ku is a single mother of\n four who works as a server, food-runner, and bartender at a popular \nMexican grill in Los Angeles. Like many in the restaurant industry, Chi \nKu faces sexual harassment daily, while averaging just $10 in tips per \nshift.  She tolerates more than she might \notherwise because she needs the money.  “You have to respond in a nice way so they don’t feel bad,” she says,\n “In the end, I depend on their tips – I depend on them being there.”  There are more than 11 million restaurant workers in the United \nStates, and many of them have stories similar to Chi Ku’s, said Saru \nJayaraman, director of the  Food Labor Research Center  at University of California at Berkeley and co-director or the  Restaurant Opportunities Centers United  (ROC-United).  The food service industry is notoriously hard on its workers, in part\n because the federal minimum wage is just $2.13 for people who earn tips,\n Jayaraman said.  Those rock-bottom earnings all but guarantee a climate in which food \nservers put up with customer harassment just to eke out a living, she \nsaid.  Read the full story on Slate #metoo #uc berkeley #ucb #saru jayaraman #harrassment #food #restuarants #servers 21448 notes ,\n         3 years ago “Remember to look up at the stars and not down at your feet.” —Stephen Hawking (1942 - 2018)  (via  agentthirsty ) #stephen hawking #quotes 201876 notes ,\n         3 years ago Older → \n© 2012–2021 | Powered by Tumblr\n               Chrono Theme by UltraLinx \n"
}