{
    "docno": "RJP333",
    "url": "https://www.wired.com",
    "text": "\n \n \n WIRED \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Sign In Subscribe backchannel business culture gear ideas science security Search backchannel business culture gear ideas science security Sign In Podcasts Video Artificial Intelligence Games Newsletters Magazine Events Wired Insider Coupons Get Our Newsletter WIRED’s biggest stories delivered to your inbox. submit This site is protected by reCAPTCHA and the Google   Privacy Policy   and   Terms of Service   apply. Top Stories Beat Box A New Way to Understand the Brain's Intricate Rhythm Author:  Grace Huckins Grace Huckins going dark The FBI's Anom Stunt Rattles the Encryption Debate Author:  Lily Hay Newman Lily Hay Newman Podcasts Why Do People Love UFOs So Much? Author:  Geek's Guide to the Galaxy Geek's Guide to the Galaxy Gadget Lab Podcast Apple Wants to Control Your Universe Author:  WIRED Staff WIRED Staff idivide Apple Starts Leaving Intel Macs Behind in MacOS Monterey Author:  Boone Ashworth Boone Ashworth route 66 Games Are Reimagining the Road Trip for a Modern Era Author:  Jon Bailes Jon Bailes Most Popular Backchannel How  Roblox  Became a Playground for Virtual Fascists Author:  Cecilia D'Anastasio Cecilia D'Anastasio Backchannel What Really Happened When Google Ousted Timnit Gebru Author:  Tom Simonite Tom Simonite Gear The 15 Best Wireless Headphones for Everyone Author:  Parker Hall Parker Hall Gear You're Probably Not Using the Web's Best Browser Author:  Scott Gilbertson Scott Gilbertson Gear 45 Father’s Day Gifts for the Dependable Dad in Your Life Author:  Matt Jancer, Gear Team Matt Jancer  and  Gear Team Security The FBI's Anom Stunt Rattles the Encryption Debate Author:  Lily Hay Newman Lily Hay Newman Security How to Turn Off Amazon Sidewalk Author:  Lily Hay Newman Lily Hay Newman More Stories Latest Videos More Videos Technology Former Air Force Pilot Breaks Down UFO Footage Andrea Themely, current commercial pilot and former Air Force colonel, dissects some famous UFO footage released by the U.S. government.  Most Recent going dark The FBI's Anom Stunt Rattles the Encryption Debate Author:  Lily Hay Newman Lily Hay Newman Podcasts Why Do People Love UFOs So Much? Author:  Geek's Guide to the Galaxy Geek's Guide to the Galaxy Opinion To Fight Online Misinformation, Criminalize Voter Suppression Author:  J. Scott Babwah Brennen, Matt Perault J. Scott Babwah Brennen  and  Matt Perault Buying Guide The Best Mouse (and Mousepads) for Every Kind of Gamer Author:  Jess Grey Jess Grey Sensitive data A Mystery Malware Stole 26 Million Passwords From Windows PCs Author:  Dan Goodin, Ars Technica Dan Goodin, Ars Technica Read More Opinion To Fight Online Misinformation, Criminalize Voter Suppression Author:  J. Scott Babwah Brennen, Matt Perault J. Scott Babwah Brennen  and  Matt Perault Buying Guide The Best Mouse (and Mousepads) for Every Kind of Gamer Author:  Jess Grey Jess Grey Sensitive data A Mystery Malware Stole 26 Million Passwords From Windows PCs Author:  Dan Goodin, Ars Technica Dan Goodin, Ars Technica The Monitor Loki  and the Return of Appointment Television Author:  Angela Watercutter Angela Watercutter Plaintext Jeff Bezos Risks It All for His Space Dream Author:  Steven Levy Steven Levy Rants and Raves You're Probably Not Using the Web's Best Browser Author:  Scott Gilbertson Scott Gilbertson Product Review Amazon's Fire HD 10 Is Still the Best Cheap Tablet Around Author:  Scott Gilbertson Scott Gilbertson The 10-inch tablet gets an optional keyboard and office apps, but it's still best as a cheap way to access all your Prime content. backchannel How  Roblox  Became a Playground for Virtual Fascists Author:  Cecilia D'Anastasio Cecilia D'Anastasio What Really Happened When Google Ousted Timnit Gebru Author:  Tom Simonite Tom Simonite One Man’s Amazing Journey to the Center of the Bowling Ball Author:  Brendan I. Koerner Brendan I. Koerner More  backchannel gear The Best Mouse (and Mousepads) for Every Kind of Gamer Author:  Jess Grey Jess Grey You're Probably Not Using the Web's Best Browser Author:  Scott Gilbertson Scott Gilbertson Apple Starts Leaving Intel Macs Behind in MacOS Monterey Author:  Boone Ashworth Boone Ashworth More  gear security The FBI's Anom Stunt Rattles the Encryption Debate Author:  Lily Hay Newman Lily Hay Newman A Mystery Malware Stole 26 Million Passwords From Windows PCs Author:  Dan Goodin, Ars Technica Dan Goodin, Ars Technica Hackers Stole a Ton of EA Data—Including Valuable Source Code Author:  Cecilia D'Anastasio Cecilia D'Anastasio More  security business Jeff Bezos Risks It All for His Space Dream Author:  Steven Levy Steven Levy VC Pledged to 'Do Better' on Diversity. It's Barely Changed Author:  Arielle Pardes Arielle Pardes Help! How Do I Make Work Friends When Everyone's Remote? Author:  Alan Henry Alan Henry More  business ideas To Fight Online Misinformation, Criminalize Voter Suppression Author:  J. Scott Babwah Brennen, Matt Perault J. Scott Babwah Brennen  and  Matt Perault Political and Urban-Rural Divides Prolong The Digital Divide Author:  Bhaskar Chakravorti Bhaskar Chakravorti Facial Verification Won't Fight Fraud Author:  Albert Fox Cahn, Evan Selinger Albert Fox Cahn  and  Evan Selinger More  ideas Games The Best Mouse (and Mousepads) for Every Kind of Gamer Author:  Jess Grey Jess Grey Games Are Reimagining the Road Trip for a Modern Era Author:  Jon Bailes Jon Bailes Hackers Stole a Ton of EA Data—Including Valuable Source Code Author:  Cecilia D'Anastasio Cecilia D'Anastasio More  Games culture Why Do People Love UFOs So Much? Author:  Geek's Guide to the Galaxy Geek's Guide to the Galaxy Loki  and the Return of Appointment Television Author:  Angela Watercutter Angela Watercutter Games Are Reimagining the Road Trip for a Modern Era Author:  Jon Bailes Jon Bailes More  culture science A New Way to Understand the Brain's Intricate Rhythm Author:  Grace Huckins Grace Huckins How Risky Is It to Send Jeff Bezos to the Edge of Space? Author:  Eric Niiler Eric Niiler How to Protect Species and Save the Planet—at Once Author:  Matt Simon Matt Simon More  science Artificial Intelligence What Really Happened When Google Ousted Timnit Gebru Author:  Tom Simonite Tom Simonite Google Hopes AI Can Turn Search Into a Conversation Author:  Khari Johnson Khari Johnson Covid Brings Automation to the Workplace, Killing Some Jobs Author:  Will Knight Will Knight More  Artificial Intelligence Get Our Newsletter WIRED’s biggest stories delivered to your inbox. submit This site is protected by reCAPTCHA and the Google   Privacy Policy   and   Terms of Service   apply. Subscribe Advertise Site Map Press Center FAQ Accessibility Help Customer Care Contact Us Send a tip securely to WIRED Coupons Newsletters Wired Staff Jobs RSS Do Not Sell My Personal Information CNMN Collection © 2020 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our  User Agreement  (updated as of 1/1/21) and  Privacy Policy and Cookie Statement  (updated as of 1/1/21).  Your California Privacy Rights . The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.  Ad Choices . \n \n \n \n \n \n"
}