{
    "docno": "RJP331",
    "url": "https://www.vice.com/en",
    "text": "VICE - VICE is the definitive guide to enlightening information. \n \n \n Sign In Create Account + English VICE Video TV News Tech Rec Room Food World News The 8:46 Project Games Music Health Money Drugs Identity Entertainment Environment Travel Horoscopes Sex VICE Magazine The Gender Spectrum Collection VICE Sign In Create Account Video TV Podcasts Apps VICE Voices  Newsletters Rec Room News Tech Rec Room Food World News The 8:46 Project Games Music Health Money Drugs Identity Entertainment Environment Travel Horoscopes Sex VICE Magazine The Gender Spectrum Collection About  Jobs Partner VICE Voices Content Funding on VICE Security Policy Privacy & Terms Accessibility Statement ©  2021  VICE MEDIA GROUP Get Way More Point Subscribe Now The Reemergence Issue Buy Now VICE In Your Inbox  Sign Up Here Tech Cryptocurrency Is In a New Wild West Phase. Things Are Really, Really Weird Jessica Klein There's a flood of new tokens. Billions are on the line. Anonymity is commonplace. Everyone—creators, investors, hackers, promoters—is cashing in. Advertisement Tech People Say They Got COVID After Going to a Massive Miami Bitcoin Conference The Bitcoin 2021 conference in Miami was attended by 12,000 cryptocurrency fans.  Edward Ongweso Jr, Jordan Pearson 06.11.21 Games How Hackers Used Slack to Break into EA Games A representative for the hackers explained to Motherboard how the group stole a wealth of data from the game publishing giant. Joseph Cox 06.11.21 Entertainment 'High on the Hog' Proves Why Food Travel Shows Need New Gatekeepers “The reason why [the show] is so resonant for Black people is because that’s really who it’s for. It’s for us.” Kristin Corry 06.11.21 Games Tesla’s Fastest Car in World Runs ‘Cyberpunk 2077’ at 60 FPS If you can’t find a PS5 or an RTX 3080 Elon Musk is ready to sell you the next best thing—a car. Matthew Gault 06.11.21 Life That’s Not How You Eat a Sandwich, According to This Japanese Manners Teacher Have a date coming up? You might want to read this. Hanako Montgomery 06.11.21 SEE ALL VICE NEWS Workers on Hunger Strike Over Alleged Sexual Misconduct at Immigrant Advocacy Group Carter Sherman 06.11.21 ACLU Accused of Telling Black Staff to ‘Keep Quiet’ on Lack of Black Leaders Trone Dowd 06.11.21 California’s Drought Is So Bad They’re Driving Salmon to the Ocean in Trucks Samir Ferdowsi 06.11.21 Advertisement Advertisement ORIGINAL REPORTING ON EVERYTHING THAT MATTERS IN YOUR INBOX. Subscribe By signing up to the VICE newsletter you agree to receive electronic communications from VICE that may sometimes include advertisements or sponsored content. Already get our newsletter?   Create a VICE account   to manage your subscription . The latest About  Jobs Partner VICE Voices Content Funding on VICE Security Policy Privacy & Terms Accessibility Statement ©  2021  VICE MEDIA GROUP"
}