{
    "docno": "RJP351",
    "url": "http://undoc.universityofcalifornia.edu/legislation-basics.html",
    "text": "\n \n \n \n \n \n \n \n \n \n \n\n\nUnderstanding federal and state legislation\n| UC undocumented student resources \n \n \n \n \n \n \n \n Skip to content \n \n \n \n \n \n \n   \n \n \n \n Understanding federal and state legislation \n There are a number of programs and laws that directly impact undocumented students at national and state levels. You can contact  UC campus support resources  with any questions you may have and visit the websites below for up-to-date information. \n Deferred Action for Childhood Arrivals (DACA) \n DACA is a program under the Department of Homeland Security (DHS) that temporarily suspends deportation and grants employment authorization to some undocumented individuals. DACA was rescinded on September 5, 2017, However, as of December 4, 2020, a federal judge restored DACA allowing newly eligible immigrants to file new applications for protection under the program. The restoration of DACA also allows for current DACA recipients to renew their application.   Information about any changes made to DACA will be posted here. \n Keep in mind that DACA has no effect on eligibility for AB 540 classification or financial aid. \n California state legislation \n AB 540  is a California law that allows some nonresident and undocumented students to pay in-state tuition and fees. To be eligible for AB 540, students must: \n \n Have attended a California high school for at least three years \n Have graduated (or will graduate) from a high school in California or received a GED or passed California High School Proficiency Exam \n Have signed the California Nonresident Exemption Request, which states that the student meets all the requirements to qualify for AB 540 status and, if s/he is undocumented, is in the process of adjusting their immigration status, or will do so as soon as they are eligible \n Not possess a non-immigrant visa \n \n Learn more about  AB 540 and how to apply . \n The California Dream Act  is made up of two California Assembly Bills: AB 130 and AB 131. Both pieces of legislation enable students who qualify for AB 540 to be eligible for certain types of UC and state financial aid. Together, these bills means that AB 540 students are now eligible for: \n \n UC scholarships and grants \n Cal Grants \n Chafee Foster Youth Grants \n Other state financial aid \n \n Learn more about  the California Dream Act and how to apply for financial aid . \n SB 1159  requires all 40 licensing boards under the California Department of Consumer Affairs to consider applicants regardless of immigration status by 2016. \n Learn more about  SB 1159 . \n \n \n \n \n \n \n Welcome \n \n \n Applying to UC \n \n \n Financial aid \n \n \n Campus support \n \n \n Finding allies \n \n \n Graduate school & careers \n \n \n Legislation basics \n \n \n \n \n \n \n Legal clinics \n Many campuses provide free and confidential legal support to undocumented students. \n \n UC Berkeley Legal Services Program  |  Contact \n UC Davis Immigration Law Clinic:  Contact Amagda Perez  (530-752-6942) \n UC Irvine Immigrant Rights Clinic:  Contact Debi Gloria \n UCLA Student Legal Services \n UC Merced Law Clinic \n UC Riverside Legal Clinic \n UC San Diego Student Legal Services \n UC Santa Barbara Associated Students Legal Resource Center \n UC Santa Cruz/Santa Cruz County Immigration Project \n \n \n \n \n \n \n \n \n About this site \n University of California \n Office of the President \n Contact & feedback \n \n \n \n Copyright © Regents of the University of California  |   Terms of use   |    Sitemap \n \n \n \n \n \n \n \n \n \n \n \n"
}