{
    "docno": "RJP369",
    "url": "https://news.ucmerced.edu/content/our-best-embodying-principles-community",
    "text": "  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n At Our Best: Embodying the Principles of Community | Newsroom \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Skip to content \n Skip to navigation \n \n \n \n See our Campus Ready site for the most up to date information about instruction. Campus Ready COVID Help \n \n \n \n \n \n \n \n \n \n \n     \n \n \n Directory \n Apply \n Give \n \n   \n Enter your keywords  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Newsroom \n The latest Bobcat news, information and events \n \n \n \n \n \n \n \n \n   Navigation menu         \n \n \n \n \n \n \n Newsroom \n \n \n \n \n \n   Main menu \n   All News Academic Distinction Campus Life Community Diversity & Inclusion Research Excellence Staff & Faculty News Student & Alumni Success Yosemite Research Arts & Culture Big Data Environment History & Heritage Management & Technology Materials & Matter Mind & Body Politics & Society Accolades Events Merced 2020 Project Inside UC Merced The Future of Athletics For Journalists   \n \n \n \n \n Directory \n Apply \n Give \n \n \n \n \n   \n Enter your keywords  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n  At Our Best: Embodying the Principles of Community  \n \n   \n       \n \n \n \n   \n         \n March 16, 2020 Dear Campus Community, \n Over the past few weeks with the evolving COVID-19 situation, our community has faced something many of us have never experienced before. We appreciate the efforts of those on the front lines, both on our campus and around the world. \n During these uncertain times, we are all being asked to do more, take on more and be there for each other more. I have witnessed the care and connection that happens when we show up for each other, and it is that deep sense of community that runs throughout and keeps us going. \n UC Merced’s power lies in our commitment to a culture that is founded on unity and respect and a community that affirms the inherent dignity and value of every person. This is embodied in our   Principles of Community   and enacted in our lives and our work every day. \n In global health emergencies, fear and anxiety can lead to social stigma, which has no room in our community and no part in uncovering the solutions to our challenges. While the CDC has provided much guidance, they have also included resources to   reducing stigma   , which can also be found on our   Emergency Preparedness   page. \n We actively denounce and discourage xenophobia, bigotry and racism and actively reinforce treating all in our community with respect. If you are being harassed or discriminated against, or if you are a bystander who has witnessed such a situation,   please report the incident here   . \n Amidst all the cancellations and postponements, I wanted to continue to hold a space for you to feel connected. So I will be holding my monthly drop-in hours via Zoom — you can   RSVP   here and come as you are. This is a space for informal dialogue about anything you would like to discuss. My office is deeply thinking about how we can continue to build belonging through this landscape, so please stay tuned. \n We are at our best when we are there for each other and prioritizing community and humanity beyond our routines. I truly believe in our best. \n With you, \n Dania Matos \nAssociate Chancellor and Chief Diversity Officer \nPronouns: She/Her/Hers \n   \n   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Additional Links \n \n UC Merced \n Newsroom \n Executive Leadership \n University Library \n Office of Information Technology \n \n \n \n Academics \n \n School of Engineering \n School of Natural Sciences \n School of Social Sciences, Humanities & Arts \n Ernest and Julio Gallo Management Program \n Division of Graduate Education \n Division of Undergraduate Education \n \n \n \n Administration \n \n Office of the Chancellor \n Office of Executive Vice Chancellor and Provost  \n Equity, Diversity and Inclusion \n External Relations \n Finance & Administration \n Physical Operations, Planning and Development \n Student Affairs \n Research and Economic Development \n \n \n \n University of California, Merced \n 5200 North Lake Rd.\r\n\t\t\t Merced, CA 95343\r\n\t\t\t Telephone: (209) 228-4400 \n \n \n \n \n \n \n \n \n \n \n \n \n \n © 2021 \n About UC Merced \n Directions \n Directory \n Privacy/Legal \n Site Feedback \n UC Regents \n Site List \n \n \n \n \n \n \n \n \n \n \n \n \n \n"
}