{
    "docno": "RJP338",
    "url": "https://www.nytimes.com/2021/06/06/business/the-cost-of-being-an-interchangeable-asian.html",
    "text": "\n \n The Cost of Being an ‘Interchangeable Asian’ - The New York Times \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Business | The Cost of Being an ‘Interchangeable Asian’ https://www.nytimes.com/2021/06/06/business/the-cost-of-being-an-interchangeable-asian.html This image is a composite of 100 portraits made of Chinese, Japanese and Korean men by the artist Atta Kim as part of his series “Self Portrait.” Credit... Atta Kim Sections Skip to content Skip to site index The Great Read The Cost of Being an ‘Interchangeable Asian’ At some top companies, Asian Americans are overrepresented in midlevel roles and underrepresented in leadership. The root of this workplace inequality could stem from the all-too-common experience of being confused for someone else. This image is a composite of 100 portraits made of Chinese, Japanese and Korean men by the artist Atta Kim as part of his series “Self Portrait.” Credit... Atta Kim Supported by Continue reading the main story By  Brian X. Chen Published  June 6, 2021 Updated  June 10, 2021 阅读简体中文版 閱讀繁體中文版 Listen to This Article To hear more audio stories from publications like The New York Times,  download Audm for iPhone or Android . About three years ago, JC Lau, a game developer, was one of a handful of women of Asian descent working at Bungie, a large video game studio in Bellevue, Wash. At the office, which had an open-floor plan and a staff of predominantly white men, co-workers regularly mistook her for one of the other Asian employees sitting in another row nearby. On one occasion, multiple colleagues congratulated Dr. Lau, who identifies as Chinese Australian, on a presentation led by a colleague of Korean heritage. “These were people I worked with on a daily basis,” she said. Dr. Lau, 40, left the company in 2018, after two years, and said a major factor behind that decision was the feeling that she wasn’t being recognized for her contributions, which included testing games and founding the company’s diversity committee. She suspected that her gender and race — and her co-workers’ inability to even recognize who she was — put her at a disadvantage, especially at a large company. “We have to do more to stand out from any other Asian we might be mistaken for in order to advance,” she said. Dr. Lau, who holds a doctorate in philosophy, left Bungie to become a producer at a smaller games studio. Image JC Lau left her job as a game developer at Bungie, feeling at a disadvantage partly because of her race. Credit... Jovelle Tamayo for The New York Times White-collar professionals are preparing to return to the office after more than a year of working from home. It hasn’t been a year of just video calls and Zoom happy hours, though. In the aftermath of the police killing of George Floyd and the Black Lives Matter movement that soon swept the nation, it’s been a year of reckoning over racial injustice in America. In the corporate world, that injustice manifests in unequal career opportunities for professionals of color. The country has also seen  a rise in hate crimes against people of Asian descent , with victims who have been beaten, verbally assaulted and, at worst, killed. In response, many companies have begun “diversity, equity and inclusion” programs aimed at recalibrating their office cultures to be more supportive of minority workers. But as a first step, what many Asian American professionals need is simple. They want their colleagues to bother to learn their names. Yes, it’s probably happened to all of us, no matter our identity: An acquaintance or colleague mistakes you for another person with the same hairdo or a similar name. But for people of Asian descent, it happens without question when there are a few other Asians in the office, even when they look and sound nothing alike. In nearly two dozen conversations with professionals of Asian descent in recent weeks, and in 15 years of my own experience in the workplace, the consensus was clear: It happens again and again, from one job to the next. While the problem is prevalent in the United States, the mix-ups also frequently happen in other countries where people with Asian heritage make up a minority, like Canada. There’s even a term for it: the  interchangeable Asian . “That particular microaggression of being mistaken for another Asian American is unique,” said Jeff Yang, an Asian American culture critic. “It stems from this different place where people tend to collectivize us in their imagination.” As part of our conversation on this topic, Mr. Yang posted a callout on Twitter: “Any of you have funny-not-funny workplace  #SorryWrongAsian  stories to share?” The post generated more than 350 responses from a wide range of people, including professionals with South and East Asian heritage. Workers recounted receiving emails meant for other colleagues, being thanked for meetings that never happened and getting lectured by a supervisor for paperwork that someone else filled out incorrectly. Image Kevin Nadal, a professor of psychology at John Jay College, studies microaggressions. “Most people of color face these microaggressions where they’re presumed to be like everyone else in their group,” he said. Credit... An Rong Xu for The New York Times I spoke with people working across industries, including marketing, academia, tech, publishing, health care and entertainment and only one person said she had never been mistaken for another Asian at work. (She is a novelist who never had co-workers.) For everyone else, these were regular occurrences. The name bunglers were usually white colleagues, but in rare cases, they were people of color. A common reaction was to shrug it off as an uncomfortable moment that was ultimately an innocent mistake. Yet scholars of sociology, psychology and Asian American history said there was something serious — and damaging — behind this phenomenon of casual Asian-face blindness that borders on cavalier. Some pointed to unconscious biases that make office workers less inclined to remember the names and faces of Asian colleagues, in large part because of their lack of exposure to people of Asian descent in their personal lives and in mainstream media. Others labeled the carelessness a form of discrimination derived from stereotypes with deep roots in American history that people with Asian heritage all behave and look alike — an army of nameless automatons not worth remembering for promotions. “Most people of color face these microaggressions where they’re presumed to be like everyone else in their group, and one way this manifests is people can’t get their names right,” said Kevin Nadal, a professor of psychology at John Jay College in New York who has led studies on the impact of subtle forms of discrimination against marginalized groups. “They’re grouping them with each other, not taking the time to acknowledge their contributions, successes and capabilities. That very much can have an effect on people’s ability to succeed.” If one requirement to ascend in your career is to be distinguishable to people in power, it may come as no surprise, then, that  Asian Americans — who make up 7 percent of the U.S. population and are the fastest-growing racial group  — are the least likely group to be promoted  in the country, according to multiple studies. Even in Silicon Valley, where people of Asian descent make up roughly 50 percent of the tech work force, a rare few rise to the executive level; most peak at middle management. The problem is especially acute for women. In one study with a sample of about 9,200 Asian female professionals, only 36 had reached the executive level. Dr. Lau, the game developer, understands the day-to-day experiences behind those numbers: the challenge of pushing for a promotion if people don’t know your name. “If at any point a person says, ‘I don’t know who this person is or their contributions,’ that is a dire threat to any sort of advancement,” she said. The ‘Interchangeable Asian’ Winnie Cheng, a nurse in Vancouver, was working a recent hospital shift alongside her colleague, a male doctor. Although the two had been treating patients together for several years, the doctor referred to her as Hannah — the name of another hospital worker of Asian descent. Ms. Cheng froze. After some thought, she decided it would be too awkward to correct him. To her chagrin, the case of mistaken identity went on for several hours, with the doctor calling her Hannah even in front of patients. Ms. Cheng, 28, asked another hospital worker to call her by her name in front of the doctor in the hope that he would correct himself. This failed. Finally, another co-worker called him out on the mistake. The doctor, who is of Indian descent, she said, was extremely embarrassed and apologetic. Months later, Ms. Cheng was called Angela by a white male colleague. She said she was frequently mixed up with the two other Asian women she worked with directly, incidents that made her feel that people recognized her for her race, not as an individual. When she was training a new hire, a tall white man, and introducing him to others, everyone on the team was excited to get to know him. While she was training him, she never heard anyone mistake him for one of the dozens of other white men working at the hospital, and she wondered if they ever would. “You can see how that accumulates over a lifetime of work,” Ms. Cheng said. “Four years of, they don’t know my name, but after saying his name once, everybody is superinterested in him and giving him opportunities.” Image Ms. Cheng, a nurse in Vancouver, has repeatedly been referred to by the name of another hospital worker of Asian descent. Even a doctor she has worked with for years has bungled her name. Credit... Jackie Dives for The New York Times The stereotype that all Asians look alike was an idea sown into the American psyche more than 100 years ago. When politicians were enacting laws to exclude Asians from immigrating into the United States — the Chinese Exclusion Act of 1882, which prohibited immigration of Chinese laborers, and the Immigration Act of 1924, a blanket ban on all Asian immigrants and some other groups — they used language that likened them to “another grain in this pile of sand, another drop in the ocean, that was threatening to overwhelm this nation,” according to Mr. Yang. And in subsequent decades, when America fought wars in Japan, Korea and Vietnam, soldiers were trained to treat all Asians as though they were part of one evil, collective mass. “The interchangeable, nameless, faceless but also thoroughly dehumanized Asian American was further solidified during wars,” said Shelley Lee, a history professor at Oberlin College in Ohio. “When the Americans fought in Asia with the goal of killing as many Asians as possible, that also encouraged Americans to dehumanize Asian people, to not empathize with the enemy you’re seeking to destroy.” Nancy Yuen, a sociologist at Biola University in California, said the inclination of white office workers to more easily remember white colleagues’ faces and names — and fail to tell people of color apart — could be linked to a phenomenon known as cross-race bias, the tendency for people to more easily recognize faces that belong to their own racial group. This behavioral pattern, studies have shown, diminishes as a person has more interactions with people of other races. Citing  2014 data  from the nonpartisan Public Religion Research Institute, Dr. Yuen noted that 75 percent of white people don’t have any nonwhite friends.  “It comes from the fact that they’re not friends with enough people of color to even be able to tell the difference,” Dr. Yuen said. The absence goes beyond people’s individual social circles. In a recent national survey for a civil rights nonprofit,  42 percent of Americans  said they could not name a single Asian American, not even Vice President Kamala Harris, who has Indian heritage. The Invisible Asian Image At the Ovation Awards, which nominated the actor Jully Lee for an award, the ceremony displayed a photo of Monica Hong, an Asian colleague of Ms. Lee’s. Credit... Philip Cheung for The New York Times On a recent Tuesday evening, Jully Lee and her boyfriend curled up on the couch and turned on the TV to watch the Ovation Awards, a ceremony honoring stage work in the Los Angeles area that was held virtually this year because of the coronavirus pandemic. Ms. Lee, an actor, had been nominated for her role in the play “Hannah and the Dread Gazebo,” which was in production before the pandemic. Ms. Lee, 40, had submitted a prerecorded acceptance speech in case she won. During the ceremony, each nominee’s photo was shown as his or her name was announced. When Ms. Lee’s category arrived, her name was called, and a photo appeared on the screen. A photo of the wrong Asian: her colleague Monica Hong. The announcer also mispronounced Ms. Lee’s name. “I was just stunned,” Ms. Lee said. She added that after a pause, she and her boyfriend started cracking up. “When things are awkward or uncomfortable or painful, it’s much safer to laugh than to express other emotions. It’s like a polite way of responding to things.” A Rise in Anti-Asian Attacks A torrent of hate and violence against people of Asian descent around the United States began last spring, in the early days of the coronavirus pandemic. Background:   Community leaders say the bigotry was fueled by President Donald J. Trump, who frequently used racist language like “Chinese virus” to refer to the coronavirus. Data:  The New York Times, using media reports from across the country to capture a sense of the rising tide of anti-Asian bias, found more than 110 episodes since March 2020 in which there was clear evidence of race-based hate. Underreported  Hate Crimes:  The tally may be only a sliver of the violence and harassment given the general undercounting of hate crimes, but the broad survey captures the episodes of violence across the country that grew in number amid Mr. Trump's comments. In New York:   A wave of xenophobia and violence has been compounded by the economic fallout of the pandemic, which has dealt a severe blow to New York’s Asian-American communities. Many community leaders say racist assaults  are being overlooked by the authorities . What Happened in  Atlanta :  Eight people, including six women of Asian descent, were killed in shootings at massage parlors in Atlanta on March 16. A Georgia prosecutor said that  the Atlanta-area spa shootings were hate crimes , and that she would pursue the death penalty against the suspect, who has been  charged with murder . The LA Stage Alliance, which hosted the ceremony,  disbanded  in the wake of outrage over the blunder. The irony of a mix-up like this wasn’t lost on Ms. Lee. It was rare to even be performing with other Asian actors, rather than competing for the same part. “It’s so funny because when there’s so many Asians, then you can’t tell them apart, but in media there are so few Asians that you can’t tell us apart,” she said. “What is it?” The invisibility of Asians in pop culture is part of what, scholars say, contributes to the “wrong Asian” experience: When people aren’t accustomed to seeing Asian faces onstage or onscreen, they may have more trouble telling them apart in real life. To put it another way: If all you really have to work with are John Cho, Steven Yeun, Aziz Ansari and Kal Penn, that’s not going to go a long way in training you to distinguish among men of Asian descent offscreen. In contrast, Hollywood has given everyone plenty of training on distinguishing white faces, Dr. Nadal said. Out of Hollywood’s top 100 movies of 2018, only two lead roles went to Asian and Asian American actors (one male and one female), according to a study by the University of Southern California’s Annenberg School for Communication and Journalism. Donatella Galella, a professor of theater history and theory at the University of California, Riverside, said that popular culture has long reflected the Western world’s xenophobic views toward Asians, which resulted in placing them in diminished roles onstage and onscreen — the villain, the sidekick. That entrenched a kind of marginalization feedback loop. Before becoming a full-time cartoonist, Gene Luen Yang was a computer science teacher at Bishop O’Dowd, a Catholic high school in Oakland, Calif. His friend Thien Pham, a visual arts teacher, was the only other Asian American man working there. Parents and students constantly mixed the two up during Mr. Yang’s 17-year tenure. School forms intended for Mr. Pham often ended up in the hands of Mr. Yang, and vice versa. Mr. Yang got his big break in 2006 when his graphic novel “American Born Chinese” became the first comic book to be a finalist for a National Book Award, and it went on to win several other prestigious prizes. A friend who was also a cartoonist told him to expect a flood of phone calls coming from Hollywood agents bidding to adapt his book into a movie or TV show. Mr. Yang secured a media agent. Yet no such calls or offers came in. “The Asian face just isn’t salable or marketable enough,” he said. The Asian Glass Ceiling There is a Japanese proverb that states, “The quacking duck gets shot.” It stands in stark contrast to the Western idiom “The squeaky wheel gets the oil.” At the Ascend Foundation, a firm that analyzes the progress of Asian Americans in the work force, researchers see the two idioms as one way to understand the numbers they see. In one  study  citing national employment data from 2018, the Ascend Foundation found that white men were 192 percent more likely to become executives than Asian men, and white women were 134 percent more likely to become executives than Asian women. Another  study , from 2013, found that while there were nearly as many Asian professionals as white professionals working at five big tech companies (Google, Hewlett-Packard, Intel, LinkedIn and Yahoo), white men and women were 154 percent more likely to be an executive than their Asian counterparts; Asian professionals tended to peak at middle management. In its report, the Ascend Foundation said part of the problem was implicit bias misguided by the belief that Asians prefer technical roles and do not aspire to leadership levels. But it also suggested that part of the issue may be cultural. Many Asian professionals interviewed by the researchers said that they were taught by their parents to do good work and keep their “heads down.” While Asian cultures differ vastly among ethnicities from South Asia to East Asia, some common values include a preference for harmony and conflict avoidance — the danger in being that quacking duck. Image Anna Mok, the president of the Ascend Foundation, in San Francisco. Credit... Craig Lee for The New York Times Is getting comfortable as a squeaky wheel the only way to succeed in corporate America? Anna Mok might argue yes. She is the president of the Ascend Foundation, and as one of the first Asian American women to rise to an executive role at the consulting firm Deloitte, she experienced her share of mix-ups along the way. She encourages people to speak up for themselves and bond with co-workers over common ground, like shared enthusiasm for a hobby or sports team or coming from the same hometown. “People remember you because they remember what we have in common,” she said. “You have to lead with that a little bit. I don’t think you can lead with, ‘I’m Asian.’” But advice about making small talk over sports could shift the burden onto marginalized employees rather than the people making decisions about promotions, and it also may not sit well with younger people. Jenn Fang, a scientist who writes  a blog  about Asian American feminism, said the problem with Asians being treated as interchangeable in the workplace is a systemic one that needs to be discussed with company leaders. “It’s not something where you can necessarily change your behavior and expect to survive and overcome,” Ms. Fang said. “You can do all these things to try to make people remember who you are, but that isn’t going to change anything to make them change the bias.” Dr. Nadal, the psychology professor who has led studies on microaggressions, agreed. “If you’re a person of power and privilege, then you have to make those efforts to know people’s names and understand that if you mess up someone’s name, there are real dynamics that are being created and consequences as a result.” Ms. Mok has a counterpoint: Asian workers need to make an effort, too, at the very least by correcting people when they get misidentified. An overwhelming majority of workers I interviewed said they did not clarify to their colleagues that they had been mistaken for the wrong Asian because they wanted to avoid confrontation. “We should use that as an opportunity to teach a colleague something and redirect it, otherwise it’s like a bad habit that no one tells you about,” Ms. Mok said. That does require people to acknowledge when they are wrong, though, which doesn’t always happen. Dr. Lau, the game producer, said that in February, she was chatting with a group of ex-Bungie employees on the app Discord when a former co-worker alerted her to a potential job opportunity that was irrelevant to her work experience. She realized he probably had intended to share it with another ex-Bungie employee for whom it would have been a good fit, a Filipino American named Cookie. When Dr. Lau pointed this out, he responded, “r u sure?” Advertisement Continue reading the main story Site Index Site Information Navigation ©  2021   The New York Times Company NYTCo Contact Us Accessibility Work with us Advertise T Brand Studio Your Ad Choices Privacy Policy Terms of Service Terms of Sale Site Map Canada International Help Subscriptions \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n"
}