{
    "docno": "RJP304",
    "url": "https://irecruitportal.ucr.edu/irecruit/!Controller?action=jobs_webui.show_page&page=jobs_detail&requisition_id=22727233&profile_id=&module=jobs",
    "text": "\n \n UCR Jobs - Position Details  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Skip Navigation \n \n \n Home Page \n \n \n \n \n \n \n \n \n Login   \n Register   \n \n \n \n \n \n \n \n HR Employment \n \n \n \n \n \n \n \n \n \n Home \n Browse Jobs \n How to Apply \n My Account \n Help \n About \n \n \n \n \n \n \n \n \n \n \n Position Details \n \n \n \n View All Details \n  \n          Back To Current Job Opportunities\n     \n \n Apply \n \n \n \n Policy and Engagement Coordinator      \n \n \n \n \n  Job Number \n  Full/Part Time  \n  Schedule    \n  Salary \n \n \n \n \n  22727233  \n  Full Time     \n  8AM - 5PM     \n      $61,600 -    $121,200     \n \n \n \n \n Position Information \n  \nThe Policy and Engagement Coordinator is a new position under Alianza UCMX. Alianza UCMX is a systemwide program that was created in September 2019 through the integration of three systemwide University of California programs that focus on Mexico. UC Riverside serves as the host campus. The Policy and Engagement Coordinator independently is responsible for developing and directing a comprehensive program to actively engage multiple stakeholders including representatives from higher education, government, and non-profit and private sector organizations both California and Mexico to advance Alianza UCMX's objectives in support of bilateral collaborations between UC and Mexico. The incumbent will be responsible to identify, conceptualize, plan, and implement new programs that strengthen relationships and help to build interests in UC and Mexico through engagement. Serve as primary point person for interactions with various stakeholders in the UC and Mexico. Compose and disseminate briefings and communications on Alianza UCMX's for internal and external audiences and functions. Independently undertake a variety of special projects in support of the Alianza UCMX's strategic vision. Please note: Budgeted Amount for this position is up to $75,000 annually. Applicants may be asked to complete a skills assessment and/or submit a work sample as part of the selection process. This position may travel up to 25%.\t\n    \n     \n  Education   \n \n  Education Requirements  \n \n \n  Degree  \n  Requirement  \n \n \n \n  Bachelor's degree in related area and/or equivalent experience/training.  \n  Required  \n \n \n \n \n \n  Experience   \n \n \n \n  Experience  \n  Requirement \n \n \n \n   6 - 10   years of related experience.   \n  Required   \n \n \n \n \n \n  Special Conditions   \n \n \n \n  Special Condition  \n  Requirement  \n \n \n \n  Travel Outside of Normal Business Hours  \n  Preferred   \n \n \n  Travel  \n  Preferred   \n \n \n \n \n \n  Minimum Requirements  \n Advanced project management skills, including skills to plan and implement successful events. Advanced written, verbal, and interpersonal communication skills, including skill to produce information that is appropriately presented and effectively received by target constituencies. Active listening skills, including advanced critical thinking and analytical skills. Advanced knowledge of the campus, its vision, mission, goals, objectives, achievements, issues of concern and infrastructure. Advanced knowledge of assigned area of responsibility, for example, the campus scientific community. Advanced knowledge of issues of concern in higher education. Skill to recognize potential areas of constituency concern and address, resolve and/or mitigate problems or issues. Advanced knowledge of practices and procedures associated with building and maintaining effective working relationships with all levels of alumni, internal and external constituencies. Ability to communicate in Spanish orally and in writing in a professional setting. Knowledge of the US-Mexico relationship and experience dealing with Mexican stakeholders, particularly in academia   \n  Preferred Qualifications   \n Political acumen and sensitivities to the differing perspectives and political circumstances within all levels of the organization as well as the Office of the President and external constituencies. Familiarity with the organization's processes, protocols and procedures. Knowledge of UC policies and procedures. Familiarity with the vision and mission of the University of California system and the individual campuses.   \n Additional Information  \n In the Heart of Inland Southern California, UC Riverside is located on nearly 1,200 acres near Box Springs Mountain in Southern California; the park-like campus provides convenient access to the vibrant and growing Inland region. The campus is a living laboratory for the exploration of issues critical to growing communities' air, water, energy, transportation, politics, the arts, history, and culture. UCR gives every student, faculty and staff member the resources to explore, engage, imagine and excel. UC Riverside is recognized as one of the most ethnically diverse research universities in the country boasting several key rankings of which we are extremely proud.     UC Riverside is proud to be ranked No. 12 among all U.S. universities, according to Money Magazine's 2020 rankings, and among the top 1 percent of universities worldwide, according to the 2019-20 Center for World University rankings.     UC Riverside is the top university in the United States for social mobility. - U.S. News 2020     UCR is a member of the University Innovation Alliance, the leading national coalition of public research universities committed to improving student success for low-income, first-generation, and students of color.     Among top-tier universities, UC Riverside ranks No. 2 in financial aid. - Business Insider 2019     Ranked No. 2 in the world for research, UCR's Department of Entomology maintains one of the largest collections of insect specimens the nation. - Center for World University Rankings     UCR's distinguished faculty boasts 2 Nobel Laureates, and 13 members of the National Academies of Science and Medicine.      The University of California is an Equal Opportunity/Affirmative Action Employer with a strong institutional commitment to the achievement of excellence and diversity among its faculty and staff. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veteran status, or any other characteristic protected by law.   For information about our generous employee benefits package, visit:  Employee Benefits Overview   \n Job Description Details \n \n  View complete Job Description for this position   \n \n \n \n \n \n \n \n \n \n \n More Information \n \n \n \n General Campus Information \n \n University of California, Riverside \n \n 900 University Ave. \n \n Riverside ,  CA  92521 \n \n \n                                Tel:  (951) 827-1012 \n \n \n \n Career Opportunities \n                            •  UCR Libraries \n \n Campus Status \n                            •  Maps and Directions \n \n \n \n Department Information \n \n Human Resources \n 1160 University Ave. \n Riverside, CA 92521\n                                     \n Fax: (951) 827-6493\n                                     E-mail:  jobshelp@ucr.edu \n \n \n \n Related Links \n \n Human Resources Home \n Diversity \n About UCR \n \n \n \n \n \n \n \n \n Campuswide Navigation \n \n \n Home \n \n \n About UCR \n \n \n Academics \n \n \n Admissions \n \n \n Athletics \n \n \n Happenings \n \n \n Research \n \n \n Campus Resources \n \n \n Giving to UCR \n \n \n \n Footer \n \n \n \n Privacy Policy \n \n \n Terms and Conditions \n \n \n                            © 2010 Regents of the University of California\n                         \n \n                            Last modified: 2010-Apr-22\n                         \n \n \n \n \n   \n \n \n"
}