{
    "docno": "RJP336",
    "url": "https://news.yahoo.com/op-ed-complex-between-population-101515082.html",
    "text": "Op-Ed: The complex link between population decline and a warming planet             HOME        MAIL        NEWS        FINANCE        SPORTS        ENTERTAINMENT        LIFE        SHOPPING        YAHOO PLUS        MORE...           Download the Yahoo News app                Yahoo News     Search query         Sign in       Mail   Sign in  to view your mail        News   News      COVID-19   COVID-19      US   US      Politics   Politics      World   World      Health   Health      Science   Science      Podcasts   Podcasts    Originals   Originals       The 360 The 360   Skullduggery Skullduggery   Conspiracyland Conspiracyland          Contact Us   Contact Us      Videos   Videos       More More       \n \n Close this content Los Angeles Times Opinion Op-Ed: The complex link between population decline and a warming planet Read full article Jade S. Sasser June 7, 2021, 3:15 AM · 4 min read Between July 2019 and July 2020, the population growth rate in the U.S. slowed to just 0.35%, the slowest recorded since 1900. Global population is also growing at a slower rate than at any time since 1950.  (Associated Press ) It’s time to stop blaming overpopulation for our environmental woes and start looking at the factors that really matter — resource consumption and toxic exposure as population growth and fertility rates show downward trends. U.S.  and  global  populations are both growing at slower rates. In the period between July 2019 and July 2020 alone, the growth rate in the U.S. had  slowed to just 0.35% , the slowest recorded since at least 1900. And this isn’t just because of a  COVID-19 baby bust . Rather, this is a part of a long-term trend, decades in the making. In 2010, births had fallen 3% from 2009,  according to the Centers for Disease Control and Prevention.  The total fertility rate (number of births over the course of a woman’s lifetime) was down 4%, and teen birth rates fell 10%, the sharpest drop in more than 70 years. Global population growth, which has stabilized, is also heading toward decline. According to the  United Nations population division , the world’s population is growing at a slower rate than at any time since 1950, and will level off around 2100. A 2020  study  suggests that global population will probably reach its peak  four decades earlier  than what the U.N. projected. In any case, age structures are already shifting markedly. As of 2018,  people over 65 outnumbered children under 5  worldwide for the first time in history. While the pace is uneven, the population story of the 21st century will be one of global graying, rather than significant global growth. Yet despite slower growth, we are still speeding toward environmental catastrophe. At the same time that human fertility rates were decreasing, greenhouse emissions all over the planet were rising steadily,  hitting record levels  in 2019. A  U.N. report  on global greenhouse gas emissions found that the richest 1% of people on Earth were responsible for more than double the number of greenhouse gas emissions of the poorest 50%. To comply with the Paris agreement, the ultra-rich would need to decrease their greenhouse gas emitting behaviors by a factor of 30. Story continues The link between population and climate change is broken. In both  China  and the  U.S.  — the top two emitters of greenhouse emissions — the average woman gives birth to 1.6 children in her lifetime, below the 2.1 children needed to replace herself and her partner. There are several factors behind the fertility slowdown. Women’s voluntary access to contraceptives — alongside other reproductive health services — plays a major role, as well as formal education and opportunities to earn an income outside of the household. But researchers also point to another concern: Infertility may be on the rise. The rate of pregnancy loss due to miscarriage, stillbirth and ectopic pregnancy among women of all ages in the U.S.  has been rising  at a rate of 1% per year between 1990 and 2011. Further,  an analysis of 185 studies  looking at close to 43,000 men between 1973 and 2011 found that total sperm counts had decreased by almost 60%. Researchers aren’t entirely certain why — and  some researchers question  whether sperm count even impacts fertility — but  some evidence demonstrates  that exposure to hormone-disrupting chemicals, like phthalates (which make plastics flexible), play a role in disrupting fertility. There’s something else to consider: Young people are simply  having less sex , with fewer partners, and are having sex for the first time at later ages compared with earlier generations. Some applaud this change for reducing teen pregnancy in the U.S. But it could signal a waning desire to have children on a warming planet. Multiple   surveys  have found this phenomenon, showing that climate anxiety is on the rise, and with it, a fear of bringing babies into a world whose future isn’t so rosy. My own interviews with diverse young people between the ages of 22 and 34 reveal that racial violence and climate change compete as the two main reasons they cite for being either deeply ambivalent about or outright opposed to becoming parents in the future. These very real social and environmental problems have intensified as population growth rates have declined. This alone demonstrates that stabilizing population size isn’t a panacea. Social and environmental problems won’t solve themselves, regardless of the number of people on Earth. Jade S. Sasser is an associate professor of Gender and Sexuality Studies at UC Riverside. She is the author of “On Infertile Ground: Population Control and Women’s Rights in the Era of Climate Change.” This story originally appeared in  Los Angeles Times . \n Recommended Stories The Independent Goldman Sachs is making US employees report their vaccination status ahead of return to offices Staff will have to provide details of vaccination but not prove they received it 1d ago The Independent Donald Trump says he’s ‘writing like crazy’ amid claims he is jealous over Pence book deal The ex-president said he’s turned down two book deals 4h ago The Independent Merrick Garland vows to challenge GOP threats to voting rights With Biden administration under pressure to combat voter suppression, attorney general condemns baseless voter fraud narrative and ‘abnormal’ audits that undermine voters 3h ago The Independent Pelosi and Democrat leaders issue rare joint statement condemning Ilhan Omar Israel comments Group says it nonetheless ‘welcomes’ clarification issued by Omar, as row threatens to divide party 15h ago INSIDER The mother of a teen accused of killing her father and laughing about it on video is a former state senator Elizabeth Halseth, who served as a Republican, was the youngest woman ever elected to the Nevada legislature in 2010 at age 27. 19h ago The Independent Jill Biden: 70 facts about the First Lady at 70 President’s wife is a lover of pranks and is described as ‘very mischievous’ by her granddaughter 13h ago The Independent Woman attacked by chihuahua while having eyelash extensions ‘It happened so fast I didn’t know what he grabbed’ 6h ago The Independent ‘The special relationship continues’: Jill Biden praises Carrie Johnson as Biden quips he and Boris married ‘above our stations’ ‘It’s a thrill to be here. I’m thrilled to meet your wife,’ US president tells British prime minister 1d ago The Independent Capitol rioter apologises on CNN – and blames Trump for his actions Anthony Antonio said he never would have marched down Pennsylvania Avenue if he had not been told 9h ago The Independent Kentucky police officer charged with beating kneeling protester during Breonna Taylor demo Officials say victim had hands up and was offering to surrender when allegedly attacked 1d ago The Independent College football player accused of killing Tinder date after discovering he was a man Police in Blacksburg, Virginia, found Jerry Smith’s body after welfare check 6h ago Reuters Videos Wife of 'El Chapo' pleads guilty in U.S. federal court The wife of Mexican drug lord El Chapo on Thursday pleaded guilty in federal court for her role in helping her husband run the Sinaloa cartel of smugglers. Clad in a green jumpsuit and wearing a white face mask, Emma Coronel Aispuro, appeared for a court hearing in Washington, D.C., where she pleaded guilty to three counts of conspiring to distribute illegal drugs, conspiring to launder money and conspiring to assist the Sinaloa drug cartel. As part of her plea agreement, the 31-year-old former beauty queen also admitted to conspiring to helping her husband escape from a Mexican prison in 2015 when he dug a mile-long tunnel from his cell. In early 2019, Joaquin \"El Chapo\" Guzman, who is 64, was convicted in a high-profile Brooklyn trial of masterminding a multibillion-dollar drug enterprise. He was sentenced to life in prison plus 30 years, and locked up in the federal Supermax prison in Florence, Colorado.Coronel, a dual U.S.-Mexico citizen, married Guzman in 2007 at the age of 18. The couple has twin daughters. Coronel could face up to life in prison for the drug distribution charge alone.The other two counts against her carry maximum prison terms of 20 years and 10 years, respectively.A tentative sentencing date was set by the judge for mid-September. 1d ago Associated Press Officers not indicted in Honolulu shooting that killed teen Grand jurors have declined to indict three Honolulu police officers in a shooting that killed a 16-year-old boy.  The Honolulu prosecuting attorney's office said it presented evidence to a grand jury Wednesday seeking indictments of the three officers.  The grand jury declined to return indictments for any of the officers in the April 5 shooting that killed Iremamber Sykap, it said. 2d ago The Independent Democrats threaten to subpoena Trump officials over secret attempts to obtain lawmakers’ data Schumer calls Barr’s alleged seizure of Apple data ‘gross abuse of power’ and ‘assault on the separation of powers’ 8h ago The Independent Trump administration spied on top Democrats and their children via Apple House Speaker says justice department probe was ‘yet another egregious assault on our democracy’ 12h ago The Independent ‘He’ll show up to anything’: Trump wanders into Mar-a-Lago events in search of adulation, report claims Weddings, cocktails, TV appearances—The Donald is there 1d ago Associated Press Statue of Black hero of Lewis & Clark trip defaced in Oregon A statue commemorating York, an enslaved Black member of the Lewis and Clark Expedition, was defaced this week in Portland, Oregon.  A plaque describing York had also been spray-painted over and then removed, leaving behind a blank square framed in purple.  The bust mysteriously appeared in February on a pedestal in a park in Southeast Portland where a statue of Harvey Scott, a well-known conservative and longtime editor of The Oregonian who opposed women’s suffrage, stood until it was torn down. 1d ago The Independent FBI treating Capitol riot as ‘act of domestic terrorism’ as director under fire for missing attack’s warnings House Democrats demand FBI probe into Trump’s involvement in failed insurrection as bipartisan attempts for congressional investigation collapse 1d ago The Independent FBI director says he’s ‘not aware of any investigation’ against Trump related to Capitol riot Christopher Wray added that he could not confirm or deny whether the bureau is investigating specific people 14h ago The Independent Oregon lawmaker ejected from office for helping armed protesters breach State Capitol Mike Nearman’s GOP colleagues ‘strongly recommended’ he resign this week 10h ago More Stories \n \n TRENDING The New York Times The Secrets and Lies of the Vietnam War, Exposed in One Epic Document The New York Times · 9 min read NBC News The West is the driest it's been in 1,200 years — raising questions about a livable future NBC News · 6 min read USA TODAY 'Only reasonable course of action': Oregon GOP legislator ousted over state Capitol breach USA TODAY · 5 min read The New York Times Something Weird on the Beach Was Staining Their Feet. But What? The New York Times · 3 min read INSIDER Simone Biles destroyed her NFL-player boyfriend in a rope-climbing race, and he accepted the loss by admitting he 'burned out' INSIDER · 2 min read \n POPULAR What Slowing Population Growth Means for Investors GOBankingRates Cities work to reach underserved populations WCVB - Boston Op-Ed: Will the Biden administration stop the cultural and environmental atrocity at Oak Flat? Los Angeles Times Opinion Op-Ed: Hold on to your post-pandemic joy Los Angeles Times Opinion Pfizer and BioNTech Will Sell 500 Million Covid Vaccine Doses to the U.S. for Global Distribution Barrons.com Donald Trump says he’s ‘writing like crazy’ amid claims he is jealous over Pence book deal The Independent Merrick Garland vows to challenge GOP threats to voting rights The Independent Pelosi and Democrat leaders issue rare joint statement condemning Ilhan Omar Israel comments The Independent The mother of a teen accused of killing her father and laughing about it on video is a former state senator INSIDER Jill Biden: 70 facts about the First Lady at 70 The Independent Woman attacked by chihuahua while having eyelash extensions The Independent ‘The special relationship continues’: Jill Biden praises Carrie Johnson as Biden quips he and Boris married ‘above our stations’ The Independent Capitol rioter apologises on CNN – and blames Trump for his actions The Independent Kentucky police officer charged with beating kneeling protester during Breonna Taylor demo The Independent \n \n \n \n"
}