{
    "docno": "RJP340",
    "url": "https://www.nytimes.com/2021/06/01/upshot/covid-vaccine-hesitancy-cost.html",
    "text": "\n \n The Covid Vaccine Is Free, but Not Everyone Believes That - The New York Times \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Sections SEARCH Skip to content Skip to site index Log in Today’s Paper The Upshot | The Covid Vaccine Is Free, but Not Everyone Believes That https://www.nytimes.com/2021/06/01/upshot/covid-vaccine-hesitancy-cost.html Advertisement Continue reading the main story The Upshot Supported by Continue reading the main story The Covid Vaccine Is Free, but Not Everyone Believes That Concern over unexpected bills was one of the reasons respondents in a U.S. survey gave for hesitation about getting the shot. By  Sarah Kliff June 1, 2021 Image Overlooking the Washington Monument, encouragement to get vaccinated.  Credit... Jacquelyn Martin/Associated Press When Paul Moser considers getting a coronavirus vaccine, he also thinks about his outstanding medical debt: $1,200 from a few urology visits that he has been unable to pay off. Mr. Moser, a 52-year-old gas station cashier in New York   State, has friends who were surprised by bills for coronavirus tests, and worries the same could happen with the  vaccine . For now, he’s holding off on getting his shot. “We were told by the legislators that all the testing was supposed to be free, and then surprise, it’s $150,” he said. “I agree it’s important to get vaccinated, but I don’t have a sense of urgency around it.” Congress passed laws barring pharmacies and hospitals from billing patients for coronavirus vaccines. Signs at vaccination sites advertise that the shot is free. From the beginning, health officials and government leaders have told the public it won’t cost anything. And there have been few reports of people experiencing charges. Even so, some unvaccinated adults cite concerns about a  surprise bill  as a reason for not getting the shot. Many of them are accustomed to a health system in which the bills are frequent, large and often unexpected. A  recent Kaiser Family Foundation poll  found that about a third of unvaccinated adults were unsure whether insurance covered the new vaccine and were concerned they might need to pay for the shot. The concern was especially pronounced among Hispanic and Black survey respondents. “The conversations we have are like: ‘Yes, I know it’s good. Yes, I want it, but I don’t have insurance,’” said Ilan Shapiro, medical director of AltaMed, a community health network in Southern California that serves a large Hispanic population. “We’re trying to make sure everyone knows it’s free.” The confusion may represent a lack of information, or skepticism that a bill won’t follow a visit to the doctor. Liz Hamel, director of survey research at Kaiser, said it could reflect people’s experience with the health system: “People may have heard it’s available for free, but not believe it.” Congress has tried to protect patients from bills for coronavirus vaccines and tests. Early in the pandemic, it mandated that insurers waive co-payments and deductibles for both services, and set up a fund to reimburse doctors seeing uninsured patients. Even so, patients found themselves  facing   bills for testing  — some for over $1,000. Some doctors billed uninsured patients for tests rather than the new, federal fund. Others tacked on unexpected fees and services to the testing visit. The rules for vaccine billing were made  even stricter . To become vaccinators, doctors and pharmacies had to sign a contract promising not to bill patients for shots. The stronger protections appear to have worked. While many patients have encountered coronavirus bills for testing — The New York Times  has documented  dozens of cases in bills submitted by readers — there have been only a handful involving vaccines. Still, some unexpected charges have slipped through: Patients in  Illinois ,  North Carolina  and  Colorado  have mistakenly received vaccine bills. In all cases, vaccine providers reversed the charge and apologized for the errors. The federal government has received some complaints about unexpected charges, and recently warned doctors against billing patients. Surprise bills for coronavirus vaccines, tests and other medical care can leave an impression on patients. Americans with medical debt are more likely to skip needed care than people who hold other types of debt, like outstanding credit card bills or student loans, according to  a 2013 study  by Lucie Kalousova, an assistant professor of sociology at the University of California, Riverside. “For someone who has incurred medical debt, they may be told by the media and everyone else that the vaccine is cost-free, but they’ve also had this very negative, prior encounter with the medical system that has created feelings of mistrust,” she said. Some patients who worried about the cost of a coronavirus vaccine said they always expect a bill to follow a doctor’s appointment. They cited stories from friends or family members who ended up with expensive coronavirus testing and treatment bills, and wondered why the vaccine would be any different. “This is America — your health care is not free,” said Elizabeth Drummond, a 42-year-old mother in Oregon who is unvaccinated. “I just feel like that is how the vaccination process is going to go. They’re going to try to capitalize on it.” It’s also possible that survey research overstates how many Americans fear getting a surprise vaccine bill. When The Times, through Kaiser’s help, conducted follow-up interviews, some poll respondents who voiced this concern said it didn’t actually matter much to them. Instead, they said they responded that way to express frustration with the vaccine or the wider American health system. “The cost is the smallest detail,” said Cody Sirman, a 32-year-old who works in manufacturing in Texas and who has decided to go unvaccinated. He said he wouldn’t mind paying for the vaccine if he trusted it — but he doesn’t: “I think the vaccine is a complete sham. It was just a way to see how much control the government can have over the population.” Image A public bus turned mobile vaccination clinic in Foley, Minn., this month. Health officials are finding inventive ways to make getting a shot simpler, yet it’s clear that some reluctance is a result of other factors. Credit... Liam James Doyle for The New York Times For many, the potential cost of a vaccine is only part of a constellation of reasons for remaining unvaccinated. It can often be hard for pollsters to know — or even patients to identify — the decisive factor. Separate research from the Census Bureau last month found that Americans were more worried about vaccine side effects than about potential charges. “Most people aren’t saying they’re just concerned about one thing; it’s usually a lot of things,” said Ms. Hamel of the Kaiser Family Foundation. Tiffany Addotey, a 42-year-old school bus driver in North Carolina, does cite a concern about cost. That stems mostly from her experience trying to get a coronavirus test. “It concerns me that some places were charging like $200 for coronavirus tests,” she said. “I didn’t pay. I went home. I have enough bills as it is.” There are other things that concern her, like the safety of the vaccine given its fast development, as well as the recent Johnson & Johnson vaccine pause. When Ms. Addotey was informed that federal law makes the vaccine free for all Americans, she responded, “So I’ll just have to pay my co-pay?” Learning that it really would be free, with no co-payment, “helped a little bit,” she said. But it wasn’t enough to put her mind at ease about getting vaccinated, at least not yet. “I’m going to try and wait for it to be on the market a little longer,” she said. “I feel like I will get it, after a little more research and a little more time.” Advertisement Continue reading the main story Site Index Site Information Navigation ©  2021   The New York Times Company NYTCo Contact Us Accessibility Work with us Advertise T Brand Studio Your Ad Choices Privacy Policy Terms of Service Terms of Sale Site Map Canada International Help Subscriptions \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n"
}