{
    "docno": "RJP34",
    "url": "https://www.facebook.com/ucrlibrary",
    "text": "\n UC Riverside Library - Home | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home About Email Signup Posts Events Community Photos Videos Reviews Groups Live See more of UC Riverside Library on Facebook Log In or Create New Account See more of UC Riverside Library on Facebook Log In Forgot account? or Create New Account Not Now Community See All 2,510 people like this 2,639 people follow this 171 check-ins About See All 900 University Ave (73.91 mi)  Riverside, CA, CA 92521 Get Directions (951) 827-3220 library.ucr.edu Library  ·  College & University Price Range $ Page Transparency See More Facebook is showing information to help you better understand the purpose of a Page. See actions taken by the people who manage and post content. Page created - September 15, 2009 People 2,510  likes 171   visits Pages Liked by This Page UCR Student Recreation Center University Honors at UC Riverside Health Professions Advising Center at UC Riverside Active Minds at UCR UC Riverside International Affairs UCR ITS UCR Tomás Rivera Library UCR Academic Resource Center UCR American Indian Science and Engineering Society Chapter Techstars Stallings Elementary School Eaton Collection of Science Fiction and Fantasy The WELL at UCR UC Riverside Associated Students Program Board (ASPB) Association of Research Libraries Pollak Library at CSUF Blackstone UCR Public History UCR School of Business Administration Alumni Network Knowledge Unlatched See More triangle-down Related Pages Barnes & Noble at UCR Bookstore Undocumented Student Program at UMD College & University CALPIRG @ UCLA! Nonprofit Organization UCR Orbach Science Library Library Whittier College Department of Theatre, Film, & Communication Arts College & University Seattle University Library and Learning Commons Campus Building UCR Tomás Rivera Library College & University Melanie Ramiro Public Figure UCR HUB Interest UCR ARC Tutor/Teacher English Majors' Association at UCI College & University The WELL at UCR Nonprofit Organization UCR CARE- Campus Advocacy, Resources, & Education Community Organization Eaton Collection of Science Fiction and Fantasy Library Cal State LA Library Library UC Riverside College & University UC Riverside Associated Students Program Board (ASPB) Local Business UC Riverside Athletics School Sports Team UC Riverside Basic Needs Community Center Concert Band at UCR Band See More triangle-down Places Riverside, California UC Riverside Library English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 Posts UC Riverside Library June 9 at 12:00 PM  ·  Join us this spring quarter for monthly Geospatial / GIS Meetups on Apr. 20, May 18 & June 15 from 12-12:50 p.m.   https://gis-meetups-spring.eventbrite.com  Tentative topics:  April 20: Soil mapping with remote sensing and machine learning  May 18: GIS in support of public safety ...  June 15: TBD   See More UC Riverside Library June 9 at 11:34 AM  ·  We would like to recognize all of our library student employees, and celebrate those who will graduate with UC Riverside’s Class of 2021:  Haneen Abbas, Sabrina Aguilera, Hugo Arcos, Samantha Berrospe, Daphne Burnett, Nicholas Carter, Martin Cruz, Daniel Garcia, Ted Kim, Tim Koo, Terry Mach, Michaela Miller, Brenda Nguyen, Carol Rodriguez, Daysia Rodriguez, Sandra Samayoa, Jonathan Sanchez, Mina Shiratsuchi, Manasi Soni, Kathy Tran, Phyllis Ung, Lisette Ureno, Jasmine Vaquera, ...  Sebastian Vizcarra, Xeng Yang, and Jennifer Zhou.  Congratulations from all of us here at the UCR Library!   https://library.ucr.edu/…/celebrating-our-class-of-2021-lib…  PS: Please come visit us soon, sometime after campus reopens. We miss you already!   See More It looks like you may be having problems playing this video. If so, please try restarting your browser. Close Class of 2021: Library Student Employees Tribute Posted by  UC Riverside Library 11 Views See All Photos See All Videos FWSRvideo 1 GivingTuesday2020withMusic 1 WelcometoFall2020attheUCRLibrary 1 See All See More \n \n \n"
}