{
    "docno": "RJP347",
    "url": "https://spiritofthetribes5k.com/",
    "text": "\n \n \n \n \n \n Spirit of the Tribes 5K | Spirit of the Tribes 5K \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Home \n About \n Registration \n Course Map \n Sponsors \n Media \n Contact \n   \n \n \n Select Page \n \n \n     \n   \n \n \n \n   \n \n \n \n   \n \n \n \n \n \n \n \n \n \n \n \n 15th annual \n Spirit of the Tribes 5K \n   \n \n VIRTUAL \n November 22-28, 2020 \n   \n \n   \n \n Welcome to the official Spirit of the Tribes 5K website.  Embrace the Spirit! \n \n   \n \n Register Today!!! \n (Click Here) \n \n \n   \n   \n   \n \n   \n \n \n \n \n About \n \n   \n \n The 15th Annual Spirit of the Tribes 5K \n November 22-28, 2020 ⊕ UC Riverside \n Normally, the Annual Spirit of the Tribes 5K is hosted by Native American Student Programs office of the University of California Riverside and honors the Native American spirit and culture with a Saturday morning full of fun and exercise for students, family, and friends. We would invite everyone to come out and enjoy this fundraising event for UC Riverside student scholarships. \n However, as we move into the eighth month of closures and quarantine due to COVID-19 (Coronavirus) we are all experiencing anything but “normal” at these times. Nevertheless, we adapt and overcome. With the changes in routines and everyday life, it is vital now more than ever for self-care and safely getting out for some fresh air and physical activity. \n   This year, we’ve adapted the “15th Annual Spirit of the Tribes 5K” to this virtual terrain and invite you to join us from your neck of the woods! There are some changes from our previously held Spirit of the Tribes 5K so please read carefully to be fully informed. \n \n   \n \n \n \n \n \n \n   \n   \n \n \n \n   \n \n   \n \n A Virtual 5K! Something For Everyone! \n \n   \n \n Firstly, this year Spirit of the Tribes Virtual 5K will be  FREE  to register!  DONATIONS  will gladly be accepted. Please visit the following link to  Donate  and scroll down and select  Native American Student Programs Scholarship Fund . Select the amount you wish to donate and Add to Basket. \n Next, as we recognize the importance of physical activity and being flexible during these times, we’ve expanded this one-day event for the week of November 22 –28, 2020. During this time, you may participate and submit your activity via a provided survey link with a screenshot of a Fitness Tracker App (Strava, Samsung Health, etc…) of the activity logged for the day. \n In order to successfully participate and receive your Spirit of the Tribes Swag Bag, you must use a Fitness Tracker App to complete a minimum distance of 5 kilometers (3.1 miles). Only submissions with screenshots of the Fitness Tracker App that displays your distance and time will be accepted. This is to keep it consistent, fair, and transparent for all participants. See Example below for reference. \n \n   \n \n \n Register \n \n   \n \n \n \n \n \n   \n   \n   \n \n \n \n \n Race Day Countdown \n \n \n Day(s) \n \n : \n \n \n Hour(s) \n \n : \n \n \n Minute(s) \n \n : \n \n \n Second(s) \n \n \n \n   \n   \n \n \n \n Registration \n \n   \n \n Registration Now Available! \n When you register you will need to designate if you are registering as an Individual or a Team, and whether you will be Running or Walking. This cannot be changed once you’ve registered. \n Should I register as a Runner or Walker? \n “Runners” – You are going for speed. You aim to run a complete 5K and submit for fastest time. \n “Walkers” – You are going the distance. You are going at your own pace, whether a tortoise or a hare, the objective is to travel as many miles (kilometers) as possible by the end of the week. \n Teams: \n   If you’re looking for some motivation and a team effort this is for you! Assemble a team of five (5) participants and choose a Team Captain. The Team Captain will be the point person of contact and also will register the entire team at one time. Once you have your five (5) members decide whether you all will be Runners or Walkers. \n   In order to keep it fair across the board, Teams will need to have five (5) members as each team will be responsible for completing a minimum of 5K/3.1m each for a total of 25K/15.5m per team. \n   \n Team Runners: \n If you are looking for a little competition to claim Fastest Team in the West, this one is for you. Each team member must complete 5K/3.1m in a single outing and submit their screenshot with their time and distance along with other vital information via the provided survey link. We will average these submissions for a Team Best Time. \n   Team Walkers: \n If you would like to simply walk to Mordor, then gather your Fellowship and begin the journey! Each team member is responsible for completing a minimum of 5K/3.1Mi, however you are highly encouraged to do more throughout the week! We encourage you to complete the entire 5K/3.1M in one outing, however this category was intended to be more flexible at a relaxed pace. \n Guidelines: \n Individuals \n Runners: \n You will need to complete the entire 5K/3.1Mi. in one single outing. You will submit your screenshot with your time and distance along with other vital information via a survey link. As this is open all week long, if you decide to run multiple times, we will accept multiple submissions; your fastest time in one outing will be used. \n   \n Walkers: \n Individual walkers will need to complete a minimum of 5K/3.1Mi. and submit a screenshot with your time and distance along with other vital information via a provided survey link. We would encourage you to complete the entire 5K/3.1Mi. in one outing, however this category was intended to be more flexible and at a relaxed pace. We also encourage you to do more than the 3.1Mi. \n     \n Team Submissions: \n   Each Team Member will submit their completed Fitness Tracker screenshot and other vital Information via the provided survey link. There will be a section to include the Team Captain/Team Name. Please make sure this input is the same across all team members for each submission in order for the submission to count towards the Team effort. \n All Submissions: \n Please make sure when submitting information that it is kept the same throughout all submissions. Use the same name, team name for each submission. If the submission does not match the registration, it will not be counted. Example: if you register as “John Doe” and submit under anything other than that, (ie“John D.”, “J. Doe”, “Johnathon Doe”, etc.) the submission will not be counted toward your person. \n \n   \n \n \n \n Screenshot Example \n \n You can use your preferred Fitness Tracker App as long as it shows: Date, Distance, and Time. \n \n \n   \n   \n \n \n Register Now \n \n   \n   \n   \n   \n \n \n \n \n Sponsors \n \n   \n \n Thank You To Our Partners \n \n   \n   \n   \n \n \n \n \n   \n \n \n \n   \n \n \n \n   \n \n \n \n   \n   \n \n   \n   \n   \n   \n   \n   \n \n \n \n \n Media \n \n   \n   \n   \n   \n \n \n \n \n Contact Us \n \n   \n   \n   \n \n \n \n \n \n \n Name \n \n \n Email Address \n \n \n Message \n \n \n \n Number \n \n \n \n \n \n \n \n 5 + 10  =  \n \n   \n Submit \n \n \n \n   \n   \n   \n   \n   \n \n \n \n \n subscribe \n \n   \n \n Stay Up To Date With The Latest Updates and Event Info \n \n   \n E-Mail \n \n   \n   \n   \n \n \n \n \n Join \n \n   \n \n Register to Race! \n \n   \n \n The Spirit of the Tribes 5K is a fundraising event for UC Riverside student scholarships.  DONATIONS  will gladly be accepted. Please visit the following link to  Donate  and scroll down and select  Native American Student Programs Scholarship Fund . Select the amount you wish to donate and Add to Basket. \n \n   \n Register \n \n   \n   \n     \n     \n   \n   \n \n \n \n \n \n \n Facebook \n \n \n \n \n Instagram \n \n \n \n \n Youtube \n \n \n \n \n Flickr \n \n \n     \n \n   \n   \n   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n"
}