{
    "docno": "RJP337",
    "url": "https://www.nytimes.com/",
    "text": "\n \n The New York Times - Breaking News, US News, World News and Videos \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Continue reading the main story Sections SEARCH Skip to content Skip to site index U.S. International Canada Español 中文 Log in Today’s Paper World U.S. Politics N.Y. Business Opinion Tech Science Health Sports Arts Books Style Food Travel Magazine T Magazine Real Estate Video World U.S. Politics N.Y. Business Opinion Tech Science Health Sports Arts Books Style Food Travel Magazine T Magazine Real Estate Video Your Friday Evening Briefing Here’s what you need to know at the end of the day. Great Weekend Listens The cost of being an ‘interchangeable Asian’, how to advocate for your well-being at work and more. Listen to ‘The Modern Love Podcast’ Are our love lives predetermined? Justice Dept. Will Investigate Trump-Era Seizure of Lawmakers’ Data The agency’s independent inspector general opened an inquiry into the secret seizure of data from House Democrats and reporters. Senate Democrats also vowed to “vigorously investigate” the Trump administration’s actions and called on Republicans to join them. The former Attorney General William Barr said he was “not aware of any congressman’s records being sought in a leak case” while he was in office.   Oliver Contreras for The New York Times In Leak Investigation, Tech Giants Are Caught Between Courts and Customers Apple, under fire for turning over the data of two lawmakers to the Trump Justice Dept., said it did so unknowingly. House lawmakers introduced sweeping antitrust legislation aimed at Amazon, Apple, Facebook and Google. Frustrated Democrats Can Look to West Virginia to Understand Joe Manchin The senator has become an obstacle to President Biden’s agenda. In his home state, his belief in bipartisanship is recognized as the core of his being. Everyone Has an Opinion About Kamala Harris’s Vice Presidency In a role that seldom allows for error, Ms. Harris is trying to shape her vice presidency by tackling unwieldy policy issues. Attorney General Merrick Garland laid out an expansive plan to protect voting rights. The Biden administration plans to restore Alaskan forest protections stripped away by former President Trump. F.D.A. Tells Johnson & Johnson 60 Million Vaccine Doses Cannot Be Used The agency has not yet decided whether Emergent can reopen the troubled Baltimore vaccine factory, which closed because of contamination concerns. Europe’s Summer of Recovery Is More Fragile Than It Looks An anticipated surge of tourism in Portugal is suddenly not at all certain — a symbol of the global economy’s continued struggle with pandemic uncertainty. Britain downgraded Portugal from an approved holiday destination to a potentially dangerous breeding ground for coronavirus variants. At the beach in the Algarve, before the new Covid rules.   James Hill for The New York Times Live The C.D.C. is investigating cases of rare heart problems following immunization. Here’s the latest on Covid-19. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Tracking the Coronavirus › \n United States › \n United States › \n United States On Jun. 10 \n 14-day change \n New cases \n 11,841 \n –42% \n \n New deaths \n 412 \n –22% \n \n \n \n U.S. vaccinations › \n \n \n At least one dose \n Fully vaccinated \n Total pop. \n \n \n \n \n \n 18 and up \n \n \n \n \n \n \n \n \n Global hot spots › \n \n Global  vaccinations ›\n\t \n \n \n \n Other trackers: \n Choose your own places to track \n States reopening Vaccine development \n Other trackers: \n Global cases States reopening Vaccine development Choose your own places to track \n \n \n \n \n \n \n \n \n \n \n Cameras Off: G7 Summit Heralds the Return of In-Person Diplomacy Call it the much-welcomed death of Zoom diplomacy. And so far, proximity appears to be working in favor of cooperation. One question looms over this year’s Group of 7 summit: Where are all the protesters? Queen Elizabeth speaking with President Biden and the first lady, Jill Biden, during Friday’s gathering of world leaders.   Pool photo by Jack Hill Two Black Students Won School Honors. Then Came Calls for a Recount. After white families claimed a calculation error, a Mississippi school added their children as co-valedictorian and co-salutatorian, raising questions about race. Ikeria Washington was originally named the sole valedictorian of West Point High School in West Point, Miss.   Timothy Ivy for The New York Times The Great Read The Man Who Jumped Into Lake Michigan Every Day for Nearly a Year Dan O’Conor started one Saturday as the pandemic was raging. Then he just kept going, never mind Chicago’s winter. Dan O’Conor hurtling into Lake Michigan in Chicago on Wednesday.   Lyndon French for The New York Times Pulitzer Prizes Focus on Coverage of Pandemic and Law Enforcement The board recognized reporting on George Floyd, including a special citation for the teenager who filmed the killing. The Times won the public service prize. See the full list of this year’s Pulitzer winners and finalists. Consider the $34 Lobster Roll The pandemic has exacerbated a price spike in the iconic New England summer sandwich. A lobster roll piled high at Red’s Eats in Wiscasset, Maine.   Ryan David Brown for The New York Times Opinion Molly Worthen Is There a Way to Dial Down the Political Hatred?  Humans may be wired to need some kind of faith, but it doesn’t have to be like this. Annie Murphy Paul How to Think Outside Your Brain The days when we could do it all in our heads are  over. Timothy Egan Biden May Be the Calm Between Two Storms Bill McKibben The Keystone XL Pipeline Is Dead. Next Target: Line 3. Paul Krugman Why Won’t Republicans Rebuild America? David Brooks How to Build Trust: A Practical Guide Jesse Wegman A Humane Judge, Gone Too Soon Emma Marris The Case Against Zoos ‘The Ezra Klein Show’ How Machine Intelligence Will Reshape Wealth and Power Samuel Earle Boris Johnson Is a Terrible Leader. It Doesn’t Matter. Andrew J. Bacevich Secrets That Were No Secret, Lessons That Were Not Learned Editors’ Picks James Hill for The New York Times The Real Star of the French Open Our photographer takes an inside look at where the clay for the world famous Roland Garros tennis courts comes from. Traveling to Hawaii? Be Prepared to Pay. Four Secrets About ‘Raiders of the Lost Ark’ Advertisement Continue reading the main story We’d like your thoughts on the New York Times home page experience. Let us know what you think Site Index Site Information Navigation ©  2021   The New York Times Company NYTCo Contact Us Accessibility Work with us Advertise T Brand Studio Your Ad Choices Privacy Policy Terms of Service Terms of Sale Site Map Canada International Help Subscriptions \n \n \n \n \n \n \n \n \n \n \n \n \n"
}