{
    "docno": "RJP368",
    "url": "https://www.universityofcalifornia.edu/coronavirus",
    "text": "\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Coronavirus | University of California \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Skip to Main Content \n \n \n University of California \n Return to home page \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n News All News Research \n Health \n Arts & Humanities \n Students & Alumni \n Faculty & Staff \n Administration \n Global Food Initiative \n \n Video \n In the News \n Press Room \n \n More \n \n \n \n \n \n \n \n \n \n\t\t\tUC statement on Gov. Newsom’s 2021-22 revised budget\t\t \n \n The University of California is deeply grateful to Gov. Newsom for proposing the largest state investment in UC’s history: more than $807 million, which includes more than $506 million in ongoing funding for core campus operations, student needs and medical training. The budget, with the support of legislative leadership, reflects an earlier agreement to fully restore more than $300 million in budget reductions that were enacted in the 2020 state budget. \n \n \n \n \n \n \n \n \n \n \n More \n \n \n \n \n \n     \n \n \n \n @UofCalifornia \n \n \n . @ucriverside  historian Jorge Leal has taken a furtive step into documenting the Latinx community’s emerging L.A. f…  https://t.co/3GVXgmYXtB   \n \n \n   \n \n \n \n \n \n \n Priorities Spotlight Double the Pell \n Defending DACA recipients \n Civic Engagement \n Climate Lab \n Fig. 1 \n FirstGen \n Innovation and Entrepreneurship \n Student Opportunity \n Transfer Students \n \n Systemwide Programs UC-HBCU Initiative Programs \n President's Postdoctoral Fellowship Program \n \n Presidential Initiatives Carbon Neutrality Initiative \n Global Food Initiative \n Smoke and Tobacco-Free Student Fellowships \n UC-Mexico Initiative \n UC National Center for Free Speech and Civic Engagement \n Undocumented Students Initiative \n \n \n UC System Overview \n Parts of UC \n Stewardship \n Working at UC \n Leadership Academic Senate \n Board of Regents \n \n Information Center \n \n Support UC Advocate About the UC Advocacy Network \n UCAN Student Ambassadors \n Federal Budget \n State Budget \n Research Funding \n Enrollment \n Education \n Campus Housing \n Health Care \n Student & Faculty Diversity \n \n Donate \n Connect Alumni Career Network \n \n \n More \n \n \n \n \n \n \n  Become a UC Advocate \n \n Receive email alerts about issues that are important to UC and contact your legislators to ensure the university remains a hub of opportunity, excellence, and innovation. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n \n \n \n \n \n \n \n Admissions \n Jobs \n Contact \n \n \n \n \n \n \n Facebook \n Twitter \n Tumblr \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Coronavirus \n \n\n\tThe University of California is vigilantly monitoring and responding to new information about the coronavirus (COVID-19) outbreak, which has been declared a global health emergency.\n   \n \n \n \n \n \n \n \n \n \n \n \n \n New developments \n \n UC  encourages COVID-19 vaccinations for university communities while reviewing policy requirements \n Campus plans for fall instruction released to date \n The University of California issues financial aid plans for second round of emergency grant funding for students (CRRSAA) \n UC  plans for fall 2021 in-person instruction across its 10 campuses \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 2:08 pm   |   May 24, 2021 \n \n    The University of California issues new guidelines for awarding emergency grants to students \n New guidance is available with regard to  emergency grants for students under the new American Recovery Plan (ARP) . The University of California is also issuing  revised guidelines for the prior round of emergency grant funding (CRRSAA) . Please click the links to learn more. \n \n \n \n \n 12:53 pm   |   April 22, 2021 \n \n UC encourages COVID-19 vaccinations for university communities while reviewing policy requirements \n \n The University of California today (April 22) shared the details of a proposed policy on COVID-19 vaccination as part of its engagement with its community as it joins the California State University in supporting immunizations as part of an expected return of students, faculty, academic appointees and staff to in-person instruction across the state this fall. Read the  full release on encouraging COVID-19 vaccinations for university communities while reviewing policy requirements here .  Student FAQs  and  employee FAQs  are also available. Please send feedback on the policy to  CovidVaccinePolicyComments@ucop.edu \n \n \n \n \n 9:18 am   |   April 22, 2021 \n \n    Campus plans for fall instruction released to date \n Individual UC campuses have begun to release plans for fall instruction. Plans may be updated further in the future; this is a rolling list and campuses will be added as they release more information. Please check with individual campuses regarding any questions. The UC system as a whole  plans to return to primarily in-person instruction as of fall 2021 . \n UC Berkeley:  An update on UC Berkeley’s plans for the fall semester  (March 16, 2021) \nUC Irvine:  UC Irvine Admissions and COVID-19  (microsite) \nUCLA:  Planning for a fall return to campus  (April 2, 2021) \nUC Merced:  Campus ready: Fall 2021  (March 9, 2021) \nUC Riverside:  Color tiers will end; UC Riverside revisits fall plans  (April 21, 2021) \nUC San Diego:  Office of the Chancellor: Fall instruction planning update  (April 5, 2021) \nUC Santa Barbara:  Fall 2021 planning update: In-person instruction and housing  (April 16, 2021) \nUC Santa Cruz:  Update on fall quarter instructional planning  (March 23, 2021) \n \n \n \n \n 3:43 pm   |   March 22, 2021 \n \n The University of California issues financial aid plans for second round of emergency grant funding for students (CRRSAA) \n \n The Coronavirus Response and Relief Supplemental Appropriations Act, 2021 (CRRSAA) provided $23 billion to address higher education challenges created by the COVID-19 pandemic, about one-third of which is allocated to colleges and universities to provide emergency grant aid to students. See a summary of how the  University of California plans to implement the CRRSAA emergency aid . \n \n \n \n \n 3:57 pm   |   January 30, 2021 \n \n The New York Times: A California university tries to shield an entire city from coronavirus \n \n UC Davis is providing free testing, masks and quarantine housing to tens of thousands of people who live nearby. Click the link above to read the full story. \n \n \n \n \n 11:05 am   |   January 11, 2021 \n \n UCLA extends remote instruction and work for spring quarter \n \n To continue doing its part to help reduce the risk of COVID-19 transmission, UCLA will offer remote-only instruction for the spring 2021 quarter, which concludes June 11, extending the same protocols already in place this academic year. There will be a limited number of in-person or hybrid instruction courses that are necessary to train students for essential workforce position. Learn more by reading the announcement:  UCLA extends remote instruction and work for spring quarter . \n \n \n \n \n 10:46 am   |   January 11, 2021 \n \n UC plans for fall 2021 in-person instruction across its 10 campuses \n \n The University of California announced today (Jan. 11) that it is planning for a return to primarily in-person instruction systemwide starting fall 2021, enabling prospective and current students as well as their families to understand our goal well in advance amid the uncertainties of the pandemic. With robust research advancements and COVID-19 vaccines soon becoming available to students, staff and faculty, UC is preparing to welcome students back to all its campuses this fall, while remaining vigilant in all critical prevention efforts and continuing to prioritize the health and well-being of the University community. Learn more about  UC plans for fall 2021 in-person instruction across its 10 campuses . \n \n \n \n \n 8:32 pm   |   December 15, 2020 \n \n Fact sheet: Coronavirus vaccine information for health care workers \n \n A fact sheet produced by the federal government for health care workers prioritized for vaccination. \n \n \n \n Pages 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n … \n next › \n last » \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n How to help \n Interested in supporting  UC  students, health care workers and researchers? Campuses and medical centers are accepting donations for our communities in need. \n Find out more  about how you can donate and help out > \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Sign up for alerts \n Receive the latest developments on  UC’s  response to the coronavirus outbreak. \n Subscribe \n \n Share \n \n Share on Facebook \n Share on Twitter \n Share on LinkedIn \n Share on Reddit \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Resources \n \n Campus COVID-19 information \n \n UC  Berkeley \n UC  Davis  |  U C Davis  Health \n UC  Irvine \n UCLA  |  U C L A  Health \n UC  Merced Health Services  |  U C Merced  Emergency Management \n UC  Riverside \n UC  San Diego  |  U C San Diego  Health \n UC  San Francisco \n UC  Santa Barbara \n UC  Santa Cruz \n \n UC  faculty & staff \n \n UCnet \n \n Staying safe & healthy \n \n Public health \n Telemedicine \n Student influenza vaccine requirement 2020  (Revised Oct. 27, 2020) \n Employee Q&A for influenza vaccine requirement 2020  (Revised Oct. 27, 2020) \n Student FAQs for proposed COVID-19 vaccination policy  Send feedback to  CovidVaccinePolicyComments@ucop.edu \n Employee FAQs for proposed COVID-19 vaccination policy  Send feedback to  CovidVaccinePolicyComments@ucop.edu \n Fact sheet: Coronavirus vaccine information for health care workers \n \n California state resources \n \n State government & education \n City and county \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n @UC_Newsroom \n \n \n About 70 percent of people with COVID-19 suddenly lose their sense of smell, although fewer of them seem to realize it, according to a new “living analysis” by a research team that includes a \n       @ucmerced \n graduate student.  https://t.co/MBrjMxr32s?amp=1 \n \n \n \n View all tweets  >  (link opens in new window) \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Related stories \n What is COVID doing to our hearts? \n UC  San Francisco cardiologist Nisha Parikh, M.D., MPH, discusses what we know so far about COVID-19’s impact on the body’s cardiovascular system, from affecting the heart’s rhythm to impairing its ability to pump blood throughout the body. \n UC SF Magazine: Nov. 24, 2020 \n \n New solution to kill coronavirus on common surfaces in seconds \n UC LA engineers and scientists have demonstrated that treatments with near-room-temperature, cold atmospheric plasma can kill the coronavirus present on a variety of surfaces in as little as 30 seconds. \n UC  Newsroom: Nov. 24, 2020 \n \n UC  campuses pilot a smartphone app that aims to limit spread of COVID-19 \n The app uses privacy-first technology that allows users to receive automatic smartphone notifications of a potential exposure to the virus. \n UC  Newsroom: Nov. 12, 2020 \n \n \n \n \n \n   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Subscribe to Our Newsletter \n Email Address   \n \n \n \n \n \n Subscribe \n \n \n \n \n \n \n \n \n Office of the President \n Academic Senate \n Board of Regents \n   \n \n Accessibility \n Terms of Use \n   \n \n Facebook \n Twitter \n Tumblr \n   \n Copyright © The Regents of the University of California \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n"
}