{
    "docno": "RJP305",
    "url": "https://irecruitportal.ucr.edu/irecruit/!Controller?action=jobs_webui.show_page&page=jobs_detail&requisition_id=22709070&profile_id=&module=jobs",
    "text": "\n \n UCR Jobs - Position Details  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Skip Navigation \n \n \n Home Page \n \n \n \n \n \n \n \n \n Login   \n Register   \n \n \n \n \n \n \n \n HR Employment \n \n \n \n \n \n \n \n \n \n Home \n Browse Jobs \n How to Apply \n My Account \n Help \n About \n \n \n \n \n \n \n \n \n \n \n Position Details \n \n \n \n View All Details \n  \n          Back To Current Job Opportunities\n     \n \n Apply \n \n \n \n UCPath Training Lead     \n \n \n \n \n  Job Number \n  Full/Part Time  \n  Schedule    \n  Salary \n \n \n \n \n  22709070  \n  Full Time     \n  8AM - 5PM     \n      $69,000 -    $135,900     \n \n \n \n \n Position Information \n  \n**Please be advised that applicants are required to submit a cover letter and resume for full consideration.**\n\nUnder the direction of the Executive Director of the UCPath Campus Support Center (CSC), the UCPath Training lead is a key role that is responsible for formulating an updated UCPath training strategy and is responsible for the deployment and management of a comprehensive training plan for the UCPath system and related local systems such as the ServiceLink case management tool, etc. This position is responsible for the design, development, presentation and evaluation of training artifacts to include eModules, webinars, job aids, in-person presentations, user guides, data dictionaries, you tube type videos, quick reference guides, knowledgebase content and related UCPath training assets. This position serves as the operational partner to our campus UCPath units, SSCs and SMEs on campus and coordinates training activities/assignments among CSC team members, central office policy SMEs and campus UCPath partner units and team members. The ideal candidate has crossfunctional experience in the training field including experience and skills in developing and delivering a wide range of training modalities and direct experience producing eModules, Youtube type videos and related training assets. In addition, the candidate will be required to become a UCPath Subject Matter Expert and deliver various types of training content. The UCPath Training Lead serves as the UCPath training point of contact for the campus, UCPC and Systemwide UCPath Training SMEs. \n\n**Please note that the budgeted hiring salary is up to $96,500.00 based on candidate qualifications.**\t\n    \n     \n  Education   \n \n  Education Requirements  \n \n \n  Degree  \n  Requirement  \n \n \n \n  Bachelor's degree in related area and/or equivalent experience/training.  \n  Required  \n \n \n \n \n  Certifications  \n \n \n  Certification  \n  Requirement  \n \n \n \n  Certificate in Online Training  \n  Preferred   \n \n \n  Certificate in Delivering Technical Training Content  \n  Preferred   \n \n \n \n \n \n  Experience   \n \n \n \n  Experience  \n  Requirement \n \n \n \n      Experience with Oracle's PeopleSoft HRMS and UPK or other similar software and training modules.   \n  Preferred   \n \n \n  Minimum of 3 years   experience developing and presenting technical training materials.   \n  Preferred   \n \n \n      Crossfunctional experience in the training field including experience and skills in developing and delivering a wide range of training modalities and direct experience producing eModules, Youtube type videos and related training assets.   \n  Preferred   \n \n \n   6 - 10   years of related experience.   \n  Required   \n \n \n  Minimum of 3 years   experience developing and deploying eLearning (including rapid eLearning) training modules.   \n  Preferred   \n \n \n \n \n \n  Minimum Requirements  \n Advanced knowledge of organizational policies and procedures. Advanced knowledge of functional area and advanced understanding of how work impacts other areas in human resources and the organization. Advanced skills in planning, resourcing and monitoring effective training delivery. Advanced analytical skills to conduct analysis and develop recommendations, demonstrating organization and problem-solving skills. Advanced knowledge of training and development, performance management and workplace learning. Ability to apply knowledge to achieve successful organizational outcomes. Advanced verbal, written and interpersonal communication skills and advanced presentation skills. Advanced knowledge of training and delivery methodologies, organizational diagnosis and organization and business strategies. Demonstrated ability to work effectively as a part of a team in a Diverse Technical/Analytical Fast Paced Work Environment.   \n  Preferred Qualifications   \n   \n Additional Information  \n In the Heart of Inland Southern California, UC Riverside is located on nearly 1,200 acres near Box Springs Mountain in Southern California; the park-like campus provides convenient access to the vibrant and growing Inland region. The campus is a living laboratory for the exploration of issues critical to growing communities' air, water, energy, transportation, politics, the arts, history, and culture. UCR gives every student, faculty and staff member the resources to explore, engage, imagine and excel. UC Riverside is recognized as one of the most ethnically diverse research universities in the country boasting several key rankings of which we are extremely proud.     UC Riverside is proud to be ranked No. 12 among all U.S. universities, according to Money Magazine's 2020 rankings, and among the top 1 percent of universities worldwide, according to the 2019-20 Center for World University rankings.     UC Riverside is the top university in the United States for social mobility. - U.S. News 2020     UCR is a member of the University Innovation Alliance, the leading national coalition of public research universities committed to improving student success for low-income, first-generation, and students of color.     Among top-tier universities, UC Riverside ranks No. 2 in financial aid. - Business Insider 2019     Ranked No. 2 in the world for research, UCR's Department of Entomology maintains one of the largest collections of insect specimens the nation. - Center for World University Rankings     UCR's distinguished faculty boasts 2 Nobel Laureates, and 13 members of the National Academies of Science and Medicine.      The University of California is an Equal Opportunity/Affirmative Action Employer with a strong institutional commitment to the achievement of excellence and diversity among its faculty and staff. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veteran status, or any other characteristic protected by law.   For information about our generous employee benefits package, visit:  Employee Benefits Overview   \n Job Description Details \n \n  View complete Job Description for this position   \n \n \n \n \n \n \n \n \n \n \n More Information \n \n \n \n General Campus Information \n \n University of California, Riverside \n \n 900 University Ave. \n \n Riverside ,  CA  92521 \n \n \n                                Tel:  (951) 827-1012 \n \n \n \n Career Opportunities \n                            •  UCR Libraries \n \n Campus Status \n                            •  Maps and Directions \n \n \n \n Department Information \n \n Human Resources \n 1160 University Ave. \n Riverside, CA 92521\n                                     \n Fax: (951) 827-6493\n                                     E-mail:  jobshelp@ucr.edu \n \n \n \n Related Links \n \n Human Resources Home \n Diversity \n About UCR \n \n \n \n \n \n \n \n \n Campuswide Navigation \n \n \n Home \n \n \n About UCR \n \n \n Academics \n \n \n Admissions \n \n \n Athletics \n \n \n Happenings \n \n \n Research \n \n \n Campus Resources \n \n \n Giving to UCR \n \n \n \n Footer \n \n \n \n Privacy Policy \n \n \n Terms and Conditions \n \n \n                            © 2010 Regents of the University of California\n                         \n \n                            Last modified: 2010-Apr-22\n                         \n \n \n \n \n   \n \n \n"
}