{
    "docno": "RJP302",
    "url": "https://irecruitportal.ucr.edu/irecruit/!Controller?action=jobs_webui.show_page&page=jobs_detail&requisition_id=22682031&profile_id=&module=jobs",
    "text": "\n \n UCR Jobs - Position Details  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Skip Navigation \n \n \n Home Page \n \n \n \n \n \n \n \n \n Login   \n Register   \n \n \n \n \n \n \n \n HR Employment \n \n \n \n \n \n \n \n \n \n Home \n Browse Jobs \n How to Apply \n My Account \n Help \n About \n \n \n \n \n \n \n \n \n \n \n Position Details \n \n \n \n View All Details \n  \n          Back To Current Job Opportunities\n     \n \n Apply \n \n \n \n SOM Controller     \n \n \n \n \n  Job Number \n  Full/Part Time  \n  Schedule    \n  Salary \n \n \n \n \n  22682031  \n  Full Time     \n  8AM - 5PM     \n      $77,300 -    $152,200     \n \n \n \n \n Position Information \n  \nThe School of Medicine (SOM) Controller is a hands-on leader responsible for helping develop, establish and sustain financial policies, procedures and controls that help assure the integrity of our financial reporting and compliance of the SOM. They will will be responsible for helping develop standard accounting practices across the various financial operational activities across the three missions of Clinical, Education and Research. This position oversees accounting assignments of diverse scope, including preparation of key journal entries, reconciliations and analyses, bank reconciliation operations, chart of accounts, and annual update of our sales and service permanent budgets. This incumbent will possess a high attention to detail and the ability to execute multiple initiatives against time constraints. The Controller oversees the integrity of financial statements and reports in accordance with GAAP, serves as liaison with auditors and/or Campus Accounting Office and ensures the timeliness in the completion of the the annual year-end closing process. This position may travel up tp 25% of the time.\t\n    \n     \n  Education   \n \n  Education Requirements  \n \n \n  Degree  \n  Requirement  \n \n \n \n  Bachelor's degree in related area.  \n  Required  \n \n \n  Master's degree in Business or Accounting.  \n  Preferred  \n \n \n \n \n  Licenses  \n \n \n  License  \n  Requirement  \n \n \n \n  Certified Public Accountant (CPA) license.  \n  Preferred   \n \n \n \n \n  Certifications  \n \n \n  Certification  \n  Requirement  \n \n \n \n  Professional certification.  \n  Preferred   \n \n \n \n \n \n  Experience   \n \n \n \n  Experience  \n  Requirement \n \n \n \n   8 - 13   years of related experience.   \n  Required   \n \n \n      Demonstrated experience with UCR Financial System (UCRFS), SuperDOPE and/or Peoplesoft.   \n  Preferred   \n \n \n \n \n \n  Minimum Requirements  \n Expert knowledge of analytical procedures used in accounting projects of complex scope which involve unique issues. Expert knowledge of common desktop/web applications. Advanced understanding of the interrelationship between procedures and desired results. Ability to gather, organize, analyze, and report on data that is complex in nature. Expert ability to effectively communicate complex information to management verbally and in writing. Expert level accounting related knowledge and skills; in-depth knowledge of the accounting function. Highly experienced using financial transactions and financial systems, as well as related policy, accounting, and unique and complex regulatory compliance requirements. Demonstrated skill querying, analyzing and forecasting financial data effectively and efficiently using PC based tools and online systems; and utilizing financial tools to improve processes.   \n  Preferred Qualifications   \n Strong technical knowledge in Fund Accounting, Generally Accepted Accounting Principles (GAAP) Governmental Accounting Standards Board (GASB), and Financial Accounting Standards Board (FASB). Excellent written and verbal communication. Knowledge of UC and UCR policies and procedures, organizational structure, and systems.   \n Additional Information  \n In the Heart of Inland Southern California, UC Riverside is located on nearly 1,200 acres near Box Springs Mountain in Southern California; the park-like campus provides convenient access to the vibrant and growing Inland region. The campus is a living laboratory for the exploration of issues critical to growing communities' air, water, energy, transportation, politics, the arts, history, and culture. UCR gives every student, faculty and staff member the resources to explore, engage, imagine and excel. UC Riverside is recognized as one of the most ethnically diverse research universities in the country boasting several key rankings of which we are extremely proud.     UC Riverside is proud to be ranked No. 12 among all U.S. universities, according to Money Magazine's 2020 rankings, and among the top 1 percent of universities worldwide, according to the 2019-20 Center for World University rankings.     UC Riverside is the top university in the United States for social mobility. - U.S. News 2020     UCR is a member of the University Innovation Alliance, the leading national coalition of public research universities committed to improving student success for low-income, first-generation, and students of color.     Among top-tier universities, UC Riverside ranks No. 2 in financial aid. - Business Insider 2019     Ranked No. 2 in the world for research, UCR's Department of Entomology maintains one of the largest collections of insect specimens the nation. - Center for World University Rankings     UCR's distinguished faculty boasts 2 Nobel Laureates, and 13 members of the National Academies of Science and Medicine.      The University of California is an Equal Opportunity/Affirmative Action Employer with a strong institutional commitment to the achievement of excellence and diversity among its faculty and staff. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veteran status, or any other characteristic protected by law.   For information about our generous employee benefits package, visit:  Employee Benefits Overview   \n Job Description Details \n \n  View complete Job Description for this position   \n \n \n \n \n \n \n \n \n \n \n More Information \n \n \n \n General Campus Information \n \n University of California, Riverside \n \n 900 University Ave. \n \n Riverside ,  CA  92521 \n \n \n                                Tel:  (951) 827-1012 \n \n \n \n Career Opportunities \n                            •  UCR Libraries \n \n Campus Status \n                            •  Maps and Directions \n \n \n \n Department Information \n \n Human Resources \n 1160 University Ave. \n Riverside, CA 92521\n                                     \n Fax: (951) 827-6493\n                                     E-mail:  jobshelp@ucr.edu \n \n \n \n Related Links \n \n Human Resources Home \n Diversity \n About UCR \n \n \n \n \n \n \n \n \n Campuswide Navigation \n \n \n Home \n \n \n About UCR \n \n \n Academics \n \n \n Admissions \n \n \n Athletics \n \n \n Happenings \n \n \n Research \n \n \n Campus Resources \n \n \n Giving to UCR \n \n \n \n Footer \n \n \n \n Privacy Policy \n \n \n Terms and Conditions \n \n \n                            © 2010 Regents of the University of California\n                         \n \n                            Last modified: 2010-Apr-22\n                         \n \n \n \n \n   \n \n \n"
}