{
    "docno": "RJP303",
    "url": "https://irecruitportal.ucr.edu/irecruit/!Controller?action=jobs_webui.show_page&page=jobs_detail&requisition_id=23391606&profile_id=&module=jobs",
    "text": "\n \n UCR Jobs - Position Details  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Skip Navigation \n \n \n Home Page \n \n \n \n \n \n \n \n \n Login   \n Register   \n \n \n \n \n \n \n \n HR Employment \n \n \n \n \n \n \n \n \n \n Home \n Browse Jobs \n How to Apply \n My Account \n Help \n About \n \n \n \n \n \n \n \n \n \n \n Position Details \n \n \n \n View All Details \n  \n          Back To Current Job Opportunities\n     \n \n Apply \n \n \n \n Executive Assistant to the Provost & Executive Vice Chancellor (EVC)     \n \n \n \n \n  Job Number \n  Full/Part Time  \n  Schedule    \n  Salary \n \n \n \n \n  23391606  \n  Full Time     \n  8AM - 5PM     \n      $61,600 -     $91,400     \n \n \n \n \n Position Information \n  \n**Candidates are required to submit a cover letter and resume for full consideration.**\n\nUC Riverside career employees who have passed their probationary period will receive priority consideration for this position. If a qualified pool of candidates from the campus is not identified, qualified candidates from the UC system or external candidates may be considered at the discretion of the hiring department.\n\nThe Executive Assistant provides high-level support and coordination to the Provost and Executive Vice\nChancellor. The incumbent is a creative, independent problem-solver who is confident, proactive, adaptable, and\nobservant. Sound judgment, tact, discretion, close attention to detail, and the ability to multi-task under pressure\nare essential characteristics. The ability to learn quickly and a willingness to welcome new challenges also are\nindispensable. The Executive Assistant is responsible for representing the Provost's office in a professional\nmanner to a variety of internal and external constituents, including Deans, Vice Chancellors, staff, students,\ncommunity members, visitors, and the UC Office of the President. The incumbent has a thorough understanding\nof the Provost's priorities and expectations, coordinates and prioritizes the Provost's schedule, and ensures that\nthe Provost is briefed and prepared for meetings and events. The incumbent also assists with university\ncommunications and events sponsored by the Provost's office, and provides partial scheduling support for the\nAssociate Provost. The Executive Assistant is also expected to continually enhance his/her skillset through\nongoing professional development.\n\n\t\n    \n     \n  Education   \n \n  Education Requirements  \n \n \n  Degree  \n  Requirement  \n \n \n \n  Bachelor's degree in related area and/or equivalent experience/training.  \n  Required  \n \n \n  Advanced degree in related area.  \n  Preferred  \n \n \n \n \n \n  Experience   \n \n \n \n  Experience  \n  Requirement \n \n \n \n   6 - 10   years of related experience.   \n  Required   \n \n \n      Demonstrated extensive and progressive experience providing high-level executive, project management and analytical support within a complex organization; including experience in coordinating special events, appointments, meetings, briefings and committees.   \n  Required   \n \n \n \n \n \n  Minimum Requirements  \n Skill in expressing ideas clearly and convincingly; skill in identifying the correct issues to be communicated, the appropriate audience, the method of communication and the timing of communication. Skill in establishing and maintaining cooperative working relationships, establishing rapport and gaining the trust of others, Ability to work with diverse populations at all levels internal and external to the organization. Demonstrated skill in use of informational systems with software in a Windows-environment (Word, Microsoft Exchange, Corp Time, Excel, Access, PowerPoint). Strong skills to communicate and influence effectively with all levels of staff, faculty, alumni/donors, students and external constituents, both verbally and in writing. Demonstrated ability to use sound judgment and tact in all matters, while paying close attention to detail. Ability to work independently, functioning confidently, proactively, and observantly while welcoming new challenges. Political acumen and sensitivities to the differing perspectives and political circumstances within all levels of the organization as well as the Office of the President and external constituencies. Advanced service orientation. Ability to use a high level of discretion and maintain all confidentiality. Ability to multi-task with demanding timeframes. Small to mid-level project management skills. Strong analytical/problem-solving skills.   \n  Preferred Qualifications   \n Advanced knowledge of the organization's processes, protocols and procedures. Demonstrated working knowledge of university structure, organization and key administrative players. Advising and counseling skills. Knowledge of federal regulations such as FERPA. Intermediate to advanced knowledge of common organization-specific computer applications.   \n Additional Information  \n In the Heart of Inland Southern California, UC Riverside is located on nearly 1,200 acres near Box Springs Mountain in Southern California; the park-like campus provides convenient access to the vibrant and growing Inland region. The campus is a living laboratory for the exploration of issues critical to growing communities' air, water, energy, transportation, politics, the arts, history, and culture. UCR gives every student, faculty and staff member the resources to explore, engage, imagine and excel. UC Riverside is recognized as one of the most ethnically diverse research universities in the country boasting several key rankings of which we are extremely proud.     UC Riverside is proud to be ranked No. 12 among all U.S. universities, according to Money Magazine's 2020 rankings, and among the top 1 percent of universities worldwide, according to the 2019-20 Center for World University rankings.     UC Riverside is the top university in the United States for social mobility. - U.S. News 2020     UCR is a member of the University Innovation Alliance, the leading national coalition of public research universities committed to improving student success for low-income, first-generation, and students of color.     Among top-tier universities, UC Riverside ranks No. 2 in financial aid. - Business Insider 2019     Ranked No. 2 in the world for research, UCR's Department of Entomology maintains one of the largest collections of insect specimens the nation. - Center for World University Rankings     UCR's distinguished faculty boasts 2 Nobel Laureates, and 13 members of the National Academies of Science and Medicine.      The University of California is an Equal Opportunity/Affirmative Action Employer with a strong institutional commitment to the achievement of excellence and diversity among its faculty and staff. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veteran status, or any other characteristic protected by law.   For information about our generous employee benefits package, visit:  Employee Benefits Overview   \n Job Description Details \n \n  View complete Job Description for this position   \n \n \n \n \n \n \n \n \n \n \n More Information \n \n \n \n General Campus Information \n \n University of California, Riverside \n \n 900 University Ave. \n \n Riverside ,  CA  92521 \n \n \n                                Tel:  (951) 827-1012 \n \n \n \n Career Opportunities \n                            •  UCR Libraries \n \n Campus Status \n                            •  Maps and Directions \n \n \n \n Department Information \n \n Human Resources \n 1160 University Ave. \n Riverside, CA 92521\n                                     \n Fax: (951) 827-6493\n                                     E-mail:  jobshelp@ucr.edu \n \n \n \n Related Links \n \n Human Resources Home \n Diversity \n About UCR \n \n \n \n \n \n \n \n \n Campuswide Navigation \n \n \n Home \n \n \n About UCR \n \n \n Academics \n \n \n Admissions \n \n \n Athletics \n \n \n Happenings \n \n \n Research \n \n \n Campus Resources \n \n \n Giving to UCR \n \n \n \n Footer \n \n \n \n Privacy Policy \n \n \n Terms and Conditions \n \n \n                            © 2010 Regents of the University of California\n                         \n \n                            Last modified: 2010-Apr-22\n                         \n \n \n \n \n   \n \n \n"
}