{
    "docno": "RJP41",
    "url": "https://emergency.ucr.edu/ENS",
    "text": "\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Emergency Notification System | Office of Emergency Management \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Skip to main content \n \n University of California, Riverside \n \n \n \n \n Search \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n UC Riverside \n \n \n \n \n  Office of Emergency Management   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Home \n \n \n Emergency Notification System \n \n \n Emergency Preparedness Resources \n \n \n Mission Continuity \n \n \n Contact us \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Emergency Notification System \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n   \n The Emergency Notification System (ENS) is used to notify and update the campus about an emergency or dangerous situation involving an immediate threat.  to the health or safety of our university community. Built on existing methods of information distribution the system is made up of several methods to quickly and reliably distribute communications or instructions in an emergency.  \n   \n To ensure that UCR’s Emergency Notification System (ENS) is  effective in keeping all Highlanders safe and alert , Chancellor Wilcox has called for an update to our system. On December 9, 2019, all UCR faculty, staff, and students will be asked to verify their mobile phone number(s) on file in UCR's ENS please see FAQ's on how to verify your mobile phone numbers. \n   \n \n \n \n \n \n \n \n \n Emergency Notification \n Installing Alertus  \n Monthly Alertus Tests \n \n \n \n \n \n   \n Emergency Notification \n \n When a verified dangerous situation exists on campus that could impact the immediate health or safety of our campus community (e.g. a dangerous person, fires, chemical release or other event requiring immediate action), or \n \n \n When UCR administration has determined that immediate notification would assist in locating an offender or \n \n \n When urgent conditions affect the status of the campus (e.g. earthquake, weather, wildfire, etc.) \n \n Once initiated, the Emergency Notification System includes several tools that could be used to disseminate critical information or instructions which may include text/SMS messaging, verbal broadcasts from the campus belltower, messaging displayed on University computer screens, email, voicemail to campus phones, UCR websites, and Official UCR social media sites. When you receive or see an emergency message, it is essential that you follow instructions and tell others around you.  \n \n \n   \n Installing Alertus \n Alertus is a mass notification system used at UC Riverside to notify students, staff, faculty, and visitors of an emergency on campus. Alertus Desktop is a small application installed on desktops, laptops, and monitors throughout campus, It displays an emergency notification directly to the computer's display.  Information Technology Solutions recommends that everyone with a UCR issued computer install the Alertus Desktop application. Having the Alertus Desktop application installed on your desktop is an effective method for you to receive critical information and instructions during an emergency when seconds and minutes matter.  \n   \n Install Alertus \n \n Click Here \n \n   \n \n \n   \n Monthly Alertus Test \n The campus conducts an Alertus Bell Tower Speaker Test on the First Friday of the month at 12:00 PM (Noon). During this time you will hear multiple tones periodically from the Bell Tower. A loud steady siren will sound varying in intensity and type, providing verbal instructions will be heard. UC Riverside is committed to providing a safe and secure environment for all campus stakeholders. An important aspect of this commitment is ongoing testing and refinement of the various communications technologies, systems, and processes used during emergencies. \n   \n \n \n \n \n \n \n \n \n \n ENS Menu \n \n \n FAQ's \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n University of California, Riverside \n \n 900 University Ave. \n            Riverside, CA 92521 \n Tel: (951) 827-1012 \n \n \n UCR Library \n Campus Status \n Campus Store \n Career Opportunities \n Diversity \n Maps and Directions \n Visit UCR \n \n \n \n \n \n Office of Emergency Management  \n \n               Building and Safety Building\n             900 University Ave (P5532-Telecom)              Riverside, CA 92521              \n  tel: (951) 827-5528                         email:  emergency@ucr.edu   \n \n \n  Find Us \n \n \n \n \n \n \n \n \n \n \n \n \n Privacy Policy \n Terms and Conditions \n © 2021 Regents of the University of California \n \n \n \n \n \n \n \n \n \n \n × \n \n \n \n \n \n \n Let us help you with your search \n \n \n Enter your Search Criteria. \n \n \n \n Search All UCR \n \n \n Search This Site \n \n \n Cancel \n \n \n \n \n \n \n \n \n \n \n \n \n"
}