{
    "docno": "RJP477",
    "url": "https://about.twitter.com/en/who-we-are/our-company.html",
    "text": "\n \n \n \n About Twitter | Our company purpose, principles, leadership \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Skip to main content \n \n \n \n \n \n \n \n \n                  About\n                 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n          Our company\n         \n \n \n \n \n \n \n \n \n \n \n Twitter is an open service thatâ\u0080\u0099s home to a world of diverse people, perspectives, ideas, and information. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n OUR PURPOSE \n \n \n \n \n \n \n \n          We serve the public conversation.\n         \n \n \n \n \n \n \n It matters to us that people have a free and safe space to talk. Thatâ\u0080\u0099s why weâ\u0080\u0099re constantly improving our rules and processes, technology and tools.Â  \n \n Weâ\u0080\u0099re not perfect â\u0080\u0094 thatâ\u0080\u0099s why we listen to you, the people on Twitter. Itâ\u0080\u0099s also why we work to be as transparent as possible. \n \n \n \n \n \n Having a global impact \n In 2021, we published our first Global Impact Report. We're committed to sharing the work we know is important to the people we serve.Â  \n \n \n \n \n \n \n \n    Download\n   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n OUR PRINCIPLES \n \n \n \n \n \n \n \n          We live by the following principles:\n         \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Promoting health \n Freedom of speech is a fundamental human right â\u0080\u0094 but freedom to have that speech amplified by Twitter is not. Our rules exist to promote  healthy conversations . \n \n \n \n \n \n \n \n \n \n \n \n Earning peopleâ\u0080\u0099s trust \n Twitter is whatâ\u0080\u0099s happening. To stay reliable and credible, we must always be earning your trust.Â  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Making it straightforward \n Simple is good, but straightforward is better. Our product, our behavior, and our work habits should all be transparent and to the point. \n \n \n \n \n \n \n \n \n \n \n \n Uniting profit and purpose \n Twitter is a purpose-driven company that does good. Visit  Twitter for Good  to find out more about how we tie philanthropy to our business objectives. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Being fast, free, and fun \n We should move fast, feel free to be ourselves, and have fun. Thatâ\u0080\u0099s Twitter.   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n OUR TEAM \n \n \n \n \n \n \n \n          Weâ\u0080\u0099re a global team.\n         \n \n \n \n \n \n \n We believe in working from anywhere, because itâ\u0080\u0099s all about giving people choice. And a flexible workforce is foundational to building a team that is both diverse and inclusive.  \n \n \n \n \n    \n    Work with us\n   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n          Our leadership\n         \n \n \n \n \n \n \n Our board Â and leadership team, guided by Twitterâ\u0080\u0099s principles, are shaping our next era of growth and social responsibility. They represent our team, our culture, and our purpose. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Parag Agrawal \n \n CTO \r\n â\u0080\u008e Bio  |  @paraga \n \n \n \n \n \n \n \n \n \n \n \n Leslie Berland \n \r\nCMO \n â\u0080\u008e Bio  |  @leslieberland \n \n \n \n \n \n \n \n \n \n \n \n Kayvon Beykpour \n \r\nProduct Lead \n â\u0080\u008e Bio  |  @kayvz \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jennifer Christie \n \r\nCHRO \n â\u0080\u008e Bio  |  @jenchristiehr \n \n \n \n \n \n \n \n \n \n \n \n Dantley Davis \n \r\nHead of Design and Research \n â\u0080\u008e Bio  |  @dantley \n \n \n \n \n \n \n \n \n \n \n \n Matt Derella \n \r\nCustomers Lead \n â\u0080\u008e Bio  |  @derella \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jack Dorsey \n \r\nCEO \n â\u0080\u008e Bio  |  @jack \n \n \n \n \n \n \n \n \n \n \n \n Bruce Falck \n \r\nRevenue Product Lead \n â\u0080\u008e Bio  |  @boo \n \n \n \n \n \n \n \n \n \n \n \n Vijaya Gadde \n \r\nHead of Legal, Policy, and Trust \n â\u0080\u008e Bio  |  @vijaya \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Michael Montano \n \r\nEngineering Lead \n â\u0080\u008e Bio  |  @michaelmontano \n \n \n \n \n \n \n \n \n \n \n \n Ned Segal \n \r\nCFO \n â\u0080\u008e Bio  |  @nedsegal \n \n \n \n \n \n \n \n \n \n \n \n Peiter â\u0080\u009cMudgeâ\u0080\u009d Zatko \n \r\nHead of Security \n â\u0080\u008e Bio  |  @ dotMudge \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n          Company resources\n         \n \n \n \n \n \n \n \n \n \n \n    \n    Inclusion and Diversity Report â\u0086\u0092\n   \n \n \n \n    \n    Transparency Center â\u0086\u0092\n   \n \n \n \n    \n    Brand toolkit â\u0086\u0092\n   \n \n \n \n    \n    Investor Relations â\u0086\u0092\n   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n CTO \n \n \n \n \n Parag is the technology lead, responsible for Twitterâ\u0080\u0099s technical strategy and overseeing machine learning and AI across the consumer, revenue, and science teams. Since joining Twitter in 2011, Parag has led efforts on scaling Twitter Ads systems, as well as reaccelerating user growth by improving Home timeline relevance. \n \n Prior to joining Twitter, Parag did research in large-scale data management with collaborators at Microsoft Research, Yahoo! Research, and AT&T Labs. \n He holds a bachelorâ\u0080\u0099s degree from IIT Bombay and a Ph.D. in computer science from Stanford University. \n \n \n \n \n \n \n \n    High resolution photo\n   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Read previous \n Peiter â\u0080\u009cMudgeâ\u0080\u009d Zatko \n \n \n \n \n \n \n \n \n \n \n Read next \n Leslie Berland \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Read next \n Leslie Berland \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n CMO \n \n \n \n \n Leslie Berland is the marketing lead responsible for Twitterâ\u0080\u0099s global consumer, product and sales marketing and communications. A core part of Leslieâ\u0080\u0099s focus is to align the companyâ\u0080\u0099s external brand identity with the internal culture that defines Twitter. \n \n Prior to joining the company in 2016, she was executive vice president of global advertising and marketing and digital partnerships at American Express. As a member of the companyâ\u0080\u0099s global management team, Leslie oversaw advertising, media, sponsorships, content, brand identity, and digital partnerships. Earlier in her career, Leslie led PR and online communications strategies for global brands on the agency side. Leslie joined American Express in 2005 and led a global team responsible for creating marketplace demand and driving commerce through differentiated products, marketing, and customer experiences globally. \n \n Her marketing work has been recognized with several awards from the Cannes Lions, D&AD, FEPE, OBIE, and One Show. In 2017, 2018, and 2019, Leslie was named one of Forbesâ\u0080\u0099 Most Influential CMOs, and she has also been recognized by Ad Age, Adweek, and Business Insider as an industry leader. \n Leslie earned a B.S. from Boston Universityâ\u0080\u0099s College of Communication. \n \n \n \n \n \n \n \n    High resolution photo\n   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Read previous \n Parag Agrawal \n \n \n \n \n \n \n \n \n \n \n Read next \n Kayvon Beykpour \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Read next \n Kayvon Beykpour \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Product Lead \n \n \n \n \n Kayvon Beykpour leads Twitterâ\u0080\u0099s product team, responsible for its product strategy and development. Previously, he was responsible for integrating Twitterâ\u0080\u0099s live video products, optimizing video to best serve every customer and creating a world-class product experience. \n \n Kayvon co-founded Periscope, a live video platform where people can create, watch, discover and share live video, which was acquired by Twitter in 2015. Prior to Periscope, he co-founded Terriblyclever Design LLC, a software company that was sold to Blackboard Inc. Following the acquisition, Kayvon led Blackboardâ\u0080\u0099s mobile division for four years where he grew its team from five to more than 100 employees and helped the company become one of the most downloaded apps in the education industry. \n Kayvon attended Stanford and graduated with a degree in computer science. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Read previous \n Leslie Berland \n \n \n \n \n \n \n \n \n \n \n Read next \n Jennifer Christie \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Read next \n Jennifer Christie \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n CHRO \n \n \n \n \n Jennifer Christie is the chief human resources officer at Twitter, leading its global people team and working with executive management andthe board of directors to support the companyâ\u0080\u0099s strategic direction. \n Prior to joining Twitter, Jennifer was senior vice president and head of human resources for the Global Consumer Services Group at American Express. Before her work at American Express, Jennifer was a consultant at a leading executive search firm and spent two years as a special assistant to the president of the United States in the White House Office of Presidential Personnel. Her career began in the federal government, where she worked for more than a decade to support community safety and implement offender reentry initiatives. Previously, she also served on the board of directors for both the Prevent Cancer Foundation and Compass Family Services.Â  \n \n Jennifer earned a bachelorâ\u0080\u0099s degree in political science from the University of North Carolina at Chapel Hill and her masterâ\u0080\u0099s degree in criminal justice from George Washington University. \n \n \n \n \n \n \n \n    High resolution photo\n   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Read previous \n Kayvon Beykpour \n \n \n \n \n \n \n \n \n \n \n Read next \n Dantley Davis \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Read next \n Dantley Davis \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Head of Design and Research \n \n \n \n \n Dantley Davis leads design and research at Twitter. Prior to joining Twitter, Dantley was at Facebook, where he led product design for Stories, News Feed, and Video. He spent seven years at Netflix, where he was responsible for design and product strategy for television and mobile experiences. His work transformed streaming user interfaces across the SVOD industry. \n \n Dantley received his undergrad degree and MBA from the University of San Francisco. \n \n \n \n \n \n \n \n    High resolution photo\n   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Read previous \n Jennifer Christie \n \n \n \n \n \n \n \n \n \n \n Read next \n Matt Derella \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Read next \n Matt Derella \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Customers Lead \n \n \n \n \n Matt leads Twitterâ\u0080\u0099s customer-facing operations, overseeing the companyâ\u0080\u0099s ad revenue organizations including global advertising sales, global content partnerships, live content and revenue operations, and customer experience. \n \n Prior to joining Twitter, Matt served in various leadership roles at Google. Matt also worked at The Weather Channel companies, leading marketing solutions for their largest revenue teams. \n Matt holds a B.A. in English from Georgetown University and is an inductee in the Advertising Hall of Achievement. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Read previous \n Dantley Davis \n \n \n \n \n \n \n \n \n \n \n Read next \n Jack Dorsey \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Read next \n Jack Dorsey \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n CEO \n \n \n \n \n Jack Dorsey co-founded Twitter Inc. in 2006, and returned as chief executive officer in September 2015. Additionally, Jack co-founded Square, where he serves as CEO and chairman. \n \n \n \n \n \n \n \n    High resolution photo\n   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Read previous \n Matt Derella \n \n \n \n \n \n \n \n \n \n \n Read next \n Bruce Falck \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Read next \n Bruce Falck \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Revenue Product Lead \n \n \n \n \n Bruce Falck is the revenue product lead, overseeing the strategy and execution of advertising products for marketers on Twitter. For over two decades, Bruce Falck has built a deep understanding of monetization and digital advertising. He was most recently CEO of Turn which sold to Singtel/Amobee. Prior to Turn he was COO of BrightRoll, the leading programmatic video ads platform, which sold to Yahoo. He also spent eight years at Google, where he helped build and lead multiple billion-dollar-plus advertising businesses including the Google Display Network, DoubleClick Bid Manager (DBM), and Googleâ\u0080\u0099s Advertising Exchange. \n \n Bruce graduated from Stellenbosch University in South Africa with a degree in computer science. \n \n \n \n \n \n \n \n    High resolution photo\n   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Read  previous \n Jack Dorsey \n \n \n \n \n \n \n \n \n \n \n Read next \n Vijaya Gadde \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Read next \n Vijaya Gadde \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Head of Legal, Policy, and Trust \n \n \n \n \n Vijaya Gadde is Twitterâ\u0080\u0099s legal, public policy, and trust and safety lead. Prior to joining Twitter in 2011, Vijaya was senior director, legal at Juniper Networks; previously, for nearly a decade she worked at Wilson Sonsini Goodrich & Rosati. Vijaya serves on the Board of Trustees of NYU Law School and the Board of Directors of Mercy Corps, a global humanitarian aid and development organization, which partners withÂ communities, corporations, and governments.Â Vijaya is also a co-founder of  #Angels , an investment collective focused on funding diverse and ambitious founders pursuing bold ideas. \n \n Vijaya earned a J.D. from New York University School of Law and a B.S. in industrial and labor relations from Cornell University. \n \n \n \n \n \n \n \n    High resolution photo\n   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Read  previous \n Bruce Falck \n \n \n \n \n \n \n \n \n \n \n Read next \n Michael Montano \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Read next \n Michael Montano \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Engineering Lead \n \n \n \n \n Michael Montano leads Twitterâ\u0080\u0099s global engineering team. Before joining Twitter, he co-founded BackType to focus on organizing online conversations and helping people follow what was being talked about. The company created and open-sourced the Apache Storm project, a distributed realtime computation system. BackType was acquired by Twitter in 2011. Since joining Twitter, Michael has led teams across the platform, advertiser products and the consumer product. \n \n Michael grew up in Canada and studied Electrical and Computer Engineering from the University of Toronto. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Read  previous \n Vijaya Gadde \n \n \n \n \n \n \n \n \n \n \n Read previous \n Ned Segal \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Read next \n Ned Segal \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n CFO \n \n \n \n \n Ned Segal is Twitter's chief financial officer, leading the companyâ\u0080\u0099s traditional finance functions along with corporate development and business development. \n Prior to joining Twitter, Ned was senior vice president of finance for Intuit's Small Business Group, responsible for the divisionâ\u0080\u0099s financial and strategic planning. He has also served as chief financial officer of RPX, the leader in patent risk management solutions to technology companies around the world, and spent 17 years at Goldman Sachs, most recently as managing director and head of global software investment banking. Ned also serves on the board of directors of Beyond Meat, a plant-based meat company, where he serves as a member of the audit committee. \n Ned received his B.S. from Georgetown University. He resides in San Francisco with his wife and three children. \n \n \n \n \n \n \n \n    High resolution photo\n   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Read previous \n Michael Montano \n \n \n \n \n \n \n \n \n \n \n Read next \n Peiter â\u0080\u009cMudgeâ\u0080\u009d Zatko \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Read next \n Peiter â\u0080\u009cMudgeâ\u0080\u009d Zatko \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Head of Security \n \n \n \n \n Peiter â\u0080\u009cMudgeâ\u0080\u009d Zatko is the head of Twitterâ\u0080\u0099s global security team. Over the course of his career Mudge pioneered many of the technical aspects the cybersecurity field is built upon and held senior leadership positions in DARPA, Google, and Stripe. He is the recipient of the highest medal able to be bestowed upon a civilian by the Office of the Secretary of Defense. \n \n Mudge is a practicing brown belt in the art of Brazilian Jiu-Jitsu and an accomplished musician with an undergraduate degree from Berklee College of Music. \n \n \n \n \n \n \n \n    High resolution photo\n   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Read previous \n Ned Segal \n \n \n \n \n \n \n \n \n \n \n Read next \n Parag Agrawal \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Read next \n Parag Agrawal \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n              Twitter platform\n               \n \n \n \n \n \n \n \n \n                  Twitter.com\n                 \n \n \n \n                  Status\n                 \n \n \n \n                  Card validator\n                 \n \n \n \n                  Privacy Center\n                 \n \n \n \n                  Transparency Center\n                 \n \n \n \n \n \n              Twitter, Inc.\n               \n \n \n \n \n \n \n \n \n                  About the company\n                 \n \n \n \n                  Twitter for Good\n                 \n \n \n \n                  Company news\n                 \n \n \n \n                  Brand toolkit\n                 \n \n \n \n                  Jobs and internships\n                 \n \n \n \n                  Investors\n                 \n \n \n \n \n \n              Help\n               \n \n \n \n \n \n \n \n \n                  Help Center\n                 \n \n \n \n                  Using Twitter\n                 \n \n \n \n                  Twitter Media\n                 \n \n \n \n                  Ads Help Center\n                 \n \n \n \n                  Managing your account\n                 \n \n \n \n                  Safety and security\n                 \n \n \n \n                  Rules and policies\n                 \n \n \n \n                  Contact us\n                 \n \n \n \n \n \n              Developer resources\n               \n \n \n \n \n \n \n \n \n                  Developer home\n                 \n \n \n \n                  Documentation\n                 \n \n \n \n                  Forums\n                 \n \n \n \n                  Communities\n                 \n \n \n \n                  Developer blog\n                 \n \n \n \n                  Engineering blog\n                 \n \n \n \n                  Developer terms\n                 \n \n \n \n \n \n              Business resources\n               \n \n \n \n \n \n \n \n \n                  Advertise\n                 \n \n \n \n                  Twitter for business\n                 \n \n \n \n                  Resources and guides\n                 \n \n \n \n                  Twitter for marketers\n                 \n \n \n \n                  Marketing insights\n                 \n \n \n \n                  Brand inspiration\n                 \n \n \n \n                  Twitter Data\n                 \n \n \n \n                  Twitter Flight School\n                 \n \n \n \n \n \n \n \n \n \n              © 2021 Twitter, Inc.\n             \n \n \n \n                Cookies\n               \n \n \n \n                Privacy\n               \n \n \n \n                Terms and conditions\n               \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n            By using Twitterâ\u0080\u0099s services you agree to our  Cookies Use . We use cookies for purposes including analytics, personalisation, and ads.\n\n           \n \n \n \n OK \n \n \n \n \n \n \n \n \n \n \n \n \n            This page and certain other Twitter sites place and read third party cookies on your browser that are used for non-essential purposes including targeting of ads. Through these cookies,  Google ,  LinkedIn  and  NewsCred  collect personal data about you for their own purposes.  Learn more . \n \n \n \n \n \n Accept \n Decline \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n"
}