{
    "docno": "RJP42",
    "url": "https://emergency.ucr.edu/emergency-procedures",
    "text": "\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Emergency Preparedness | Office of Emergency Management \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Skip to main content \n \n University of California, Riverside \n \n \n \n \n Search \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n UC Riverside \n \n \n \n \n  Office of Emergency Management   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Home \n \n \n Emergency Notification System \n \n \n Emergency Preparedness Resources \n \n \n Mission Continuity \n \n \n Contact us \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n   \n Emergency preparedness is a well-known concept in protecting workers' safety and health. Anticipating and planning UCR's campus emergency response minimizes possible injuries and property damage during a campus-wide emergency and eases the return to normal campus operations.  \n   \n \n \n \n \n \n \n \n \n \n \n            Utility Outages     \n \n Immediate Actions \n Electricity  (power failure) \n Evacuate darkened areas with caution \n If working with high heat, open flame, or a hazardous experiment or procedure, complete safety shutdown procedures  if it is safe to do so , and then evacuate the building \n Call Facility Services at (951) 827-4214 (8:00 am - 5:00 pm) or Steam Plant at (951) 827-4677 (after 5:00 pm or weekends/holidays), then call UCPD at (951) 827-5222 \n Report the location and hazards of machinery or operations that were interrupted \n Report emergencies to UCPD at 911 \n Riverside Public Utilities outage map \n Public Safety Power Shutoff (PSPS) \n When severe weather and fire conditions threaten a portion of the electric infrastructure or community,  Southern California Edison may turn off electricity supply to Riverside Public Utilities in the interest of public safety. \n Public Safety Power Shutoff's may occur with as little as a day's notice and can remain active for days. It is best to be prepared for a power outage at all times.  \n In the event of a PSPS, recharging stations will be setup by the University prioritizing students with medical needs or other vital functions.  \n How to Prepare for a Power Outage in a Laboratory \n Be sure the contact information on your lab door placard is up-to-date. Ideally, contacts should be knowledgeable about all of the lab’s sensitive operations. \n Put essential equipment on emergency power circuits, if available. \n Hazardous processes that operate unattended should be programmed to shut down safely during a power failure and not restart automatically when power returns. \n Identify an emergency source of dry ice for items that must be kept cold. Do not use dry ice in small enclosed and occupied areas because hazardous concentrations of CO2 can accumulate. Unopened refrigerators/ freezers will maintain temperature for several hours. \n During Power Outage in a Laboratory \n Shut down experiments that involve hazardous materials or equipment that automatically restart when power is available. \n Make sure that experiments are stable. Cap all chemical containers that are safe to cap, and then close fume hood sashes. \n Check equipment on emergency power. In some cases, it may take 20 to 30 seconds for the emergency power to activate after a power failure. \n Disconnect unattended equipment and turn off unnecessary equipment. \n When power returns, reset/restart/check equipment. Check the airflow of your fume hood. Often, hoods will not automatically restart. \n Learn more about how to prepare before, during and after a  power outage \n Elevator  (failure) \n Report elevator failures to Facility Services at (951) 827-4214 (8:00 am - 5:00 pm) or Steam Plant at (951) 827-4677 (after 5:00 pm or weekends/holidays), then call UCPD at (951) 827-5222 \n If outside the elevator, try to communicate to trapped elevator occupants that help is on the way \n If trapped inside the elevator, use the elevator phone to request help, or activate the emergency alarm within the elevator (The elevator phone has no dial tone so do not hang up after picking up the receiver) \n Flooding  (plumbing failure) \n Do not touch any electrical appliances \n Call Facility Services at (951) 827-4214 (8:00 am - 5:00 pm) or Steam Plant at (951) 827-4677 (after 5:00 pm or weekends/holidays), then call UCPD at (951) 827-5222 \n If it is safe to do so, lift valuable, or critical, items above the reach of the water \n Gas leak  (natural gas) \n Evacuate the building using evacuation routes \n Do not turn \"on/off\" switches on lights or electrical equipment \n If working with high heat, open flame, or a hazardous experiment or procedure, complete safety shutdown procedures  if it is safe to do so , and then evacuate the building \n Stay to the right of hallways and stairs; do not use elevators \n Assist people with disabilities if needed \n Once outside, call UCPD at 911 \n Go to the building's Emergency Assembly Area (EAA) and notify emergency staff that you have evacuated safely \n Steam Line failure \n Leave the immediate area \n Call Facility Services at (951) 827-4214 (8:00 am - 5:00 pm) or Steam Plant at (951) 827-4677 (after 5:00 pm or weekends/holidays), then call UCPD at (951) 827-5222 \n Ventilation problem  (odors) \n Call Facility Services at (951) 827-4214 (8:00 am - 5:00 pm) or Steam Plant at (951) 827-4677 (after 5:00 pm or weekends/holidays), then call UCPD at (951) 827-5222 \n \n \n \n \n \n            Earthquake      \n \n Immediate Actions \n Indoors:  \n Drop  to the floor immediately \n Take  Cover  under sturdy furniture or near an interior wall \n   Hold On  until the shaking stops  \n Outdoors: \n Move away from buildings \n Drop, Cover, and Hold on \n If you are driving pull over to a clear area \n Other Tips: \n Stay away from windows \n Stay away from things that could fall on you \n Do not run outside \n Don't stand in a doorway (It's not safe for shelter) \n Do not use the elevator \n \n \n \n \n \n            Exposure to Blood or Bodily Fluids      \n \n Definition \n Exposure . Direct contact between eye, mouth, mucous membrane, skin cut, or abrasion with blood or any other potentially infectious material \n Immediate Actions \n Skin exposure: Thoroughly wash the contact area with soap and water immediately \n Eye exposure: Flush eyes with water for 15 minutes using eyewash \n Needlestick, cut, bite exposure: Thoroughly wash the wound with soap and water \n Call 911 for medical help \n Additional Information / Follow Up Activities \n Notify supervisor of exposure to a potentially infectious fluid \n Notify EH&S as soon as possible of potential infection from blood or body fluid due to exposure\n\t During business hours contact  Environmental Health & Safety  (951) 827-5528 to report exposure (Monday through Friday, 8:00 am - 5:00 pm) \n After hours contact  UCPD  Dispatch (951) 827-5222 and request they notify EH&S \n \n \n \n \n \n \n            Fire or Smoke      \n \n Immediate Actions \n Alert others nearby of the condition \n Activate the building fire alarm \n Call 2-5222, or 911 to report any fire or smoke condition, if it is safe and possible to do so \n Quickly leave the building when the fire alarm sounds or evacuation is initiated by emergency personnel \n If working with high heat, open flame or a hazardous experiment or procedure, complete safety shutdown procedures if it is safe to do so, and then evacuate the building \n Quickly take personal items or other important materials with you if it is safe to do so. You may not be returning for some time \n Close doors as you leave \n Stay to the right of hallways and stairs; do not use elevators \n Assist people with disabilities if needed \n Avoid any smoke-filled area if possible; if you are in a smoke-filled area, stay low to the floor and crawl under the smoke to an exit \n If your clothing catches fire: Stop, Drop, and Roll to extinguish flames \n Follow evacuation routes directly to building's  Emergency Assembly Area  (EAA) \n Notify  emergency staff  at the Emergency Assembly Area that you have evacuated safely \n If mobility impaired: \n Locate and proceed to an area of safe refuge such as an enclosed stairwell \n Request others evacuating to notify emergency responders of your location \n Wait for emergency responders to arrive \n Additional Information / Follow Up Activities \n Remain in the Emergency Assembly Area until directed otherwise \n Never try to re-enter a building until cleared to do so by UCR officials or emergency responders \n \n \n \n \n \n            Bomb Threat      \n \n Immediate Actions \n If a bomb threat is received by phone \n Take the caller seriously and remain calm \n Try to keep the caller on the phone by asking questions using the  Bomb Threat Checklist \n Listen carefully: don’t interrupt the caller or hang up \n If possible, write a note to a coworker asking him/her to “call 911 to report a bomb threat” \n Call 911 immediately once the call has ended to report the details \n If a bomb threat is received by mail \n Stop additional handling of the letter or parcel \n Call 911 immediately \n UCPD or UCR officials will determine if evacuation is necessary \n Secure room/area if possible, allowing entry to emergency responders only \n Advise campus personnel not to use 2-way radios in the area \n If a bomb threat is received by email \n Call 2-5222, or 911 immediately \n Print a copy for UCPD \n Do not delete the message \n Additional Information / Follow Up Activities \n If instructed to do so, initiate building evacuation by activating any fire alarm box (pull alarm) \n Evacuate the building and report to Emergency Assembly Area (EAA) \n Wait for emergency response personnel or the Building Supervisor for Emergency Conditions ( BSEC ) to authorize that it is safe to reenter affected area \n Provide the completed  Bomb Threat Checklist  to UCPD officer-in-charge at the scene \n Notify your supervisor or department head of bomb threat if they were not in the area when it occurred \n \n \n \n \n \n            Emergency Communication      \n \n Immediate Actions \n For police or medical emergencies \n Dial 9-1-1 or 2-5222 from any campus phone \n Use emergency call boxes, campus emergency phones or elevator emergency \n\tphones/intercoms \n If necessary, the campus fire alarm pull-boxes can be used to summon an emergency response from UCPD \n Note: Dialing 911 from a cell phone while on campus will connect you to the nearest California Highway Patrol Dispatch (there may be a delay in answering your call) and they will transfer your call to UCPD \n For fire, earthquake, or campus closures: \n Only use phones or cell phones to dial 9-1-1 for emergency situations \n Listen to radio bulletins, watch TV news, and check the campus status \n Additional Information / Follow Up Activities \n Information concerning emergencies at UCR and related topics will be available to the campus community through the following resources: \n UCR Website at  www.ucr.edu \n UCR   Campus Status    \n UCR Campus Radio KUCR: 88.3 FM or  www.KUCR.edu   \n Riverside Area News and Information Radio\n\t KFRG 95.1 FM or KGGI 99.1 FM \n KFI 640 AM or KNX 1070 AM \n \n Riverside Area Emergency Information – Charter Cable Channel 32 or 33 \n \n \n \n \n \n            Evacuation     \n \n Immediate Actions \n Quickly leave the building when the fire alarm sounds or evacuation is initiated by emergency personnel \n \n If working with high heat, open flame or a hazardous experiment or procedure, complete safety shutdown procedures if it is safe to do so, and then evacuate the building quickly  \n \n \n Take personal items or other important materials with you if it is safe to do so. You may not be returning for some time  \n \n \n Close doors as you leave \n \n Stay to the right of hallways and stairs; do not use elevators \n Assist the mobility impaired if they request help \n Avoid any smoke-filled area if possible; if you are in a smoke-filled area, stay low to the floor and crawl under the smoke to an exit \n Follow evacuation routes directly to building's  Emergency Assembly Area (EAA) \n Notify   emergency staff  at the Emergency Assembly Area  that you have evacuated safely \n   \n If mobility impaired: \n Locate and proceed to an area of safe refuge, such as an enclosed stairwell  \n Request others evacuating to notify emergency responders of your location \n Wait for emergency responders to arrive \n Additional Information / Follow Up Activities \n \n Remain in the Emergency Assembly Area until directed otherwise \n \n \n Never try to re-enter a building until cleared to do so by UCR officials or emergency responders \n \n \n \n \n \n \n            Hazardous Material Exposure / Spill     \n \n Immediate Actions \n   \n For exposures \n Skin contact: External exposure or splash: \n Call 2-5222, or 911 and ask for assistance from co-workers if available \n Start shower/eyewash \n Remove contaminated clothing, if appropriate \n Wash for at least 15 minutes \n Seek additional assistance as necessary \n Inhalation: \n Leave the area and go to an area with fresh air \n If you have shortness of breath or trouble breathing, call 2-5222, or  911 for help \n Ingestion: \n Call 911 for help \n Call the National Capital Poison Center (800) 222-1222 for poison emergencies. \n For Spills \n If Hazardous Material Spill or Release: \n If you have been trained and have the proper materials, contain or clean up the spill and call  EH&S  at (951) 827-5528 \n If you have not been trained or cannot contain the spill, call 911 for help \n Additional Information / Follow Up Activities \n Report all incidents to your supervisor \n Decontaminate all useable equipment \n Properly dispose of hazardous waste through EH&S at (951) 827-5528 \n \n \n \n \n \n            Medical Emergencies and First Aid     \n \n Immediate Actions \n General steps in medical emergencies \n Check the scene to see that it is safe and that you and victim are not in danger \n Call 2-5222, or 911 (or ask someone to call 911) to request medical assistance; state the type of medical emergency it appears to be (cut, head injury, heart attack, etc.) \n Get office First Aid Kit and use needed supplies as directed or to the level of your first aid training \n Retrieve and use any other appropriate and available emergency medical equipment (e.g., automatic external defibrillator (AED)) \n Remain calm and reassure the victim while waiting for emergency personnel \n Additional Information / Follow Up Activities \n Report any injury to your immediate supervisor \n Replace any materials used from the First Aid Kit \n Do not move the victim if unsure about head/neck injury \n \n \n \n \n \n            Radioactive Contamination / Spill     \n \n Immediate Actions \n For Exposures \n For events that create an immediate danger to life/property or if an injury has already occurred: \n Call  2-5222, or 911 for help and ask for assistance from co-workers if available \n For unexpected exposure to radiation or ingestion of radioactive materials \n Call  EH&S  at  (951) 827-5528 for instructions \n Call 2-5222, or 911 if it is after 5PM or a weekend/holiday \n For eye contamination \n Call 2-5222, or 911 for help and ask for assistance from co-workers if available \n Use eye wash for at least 15 minutes \n Completely rinse the entire eye area, including eyelid and skin underneath eye \n For skin contamination \n Call EH&S at (951) 827-5528 for decontamination instructions and a dose assessment; Call 2-5222, or 911 if it is after 5PM or a weekend/holiday \n Contain area of contamination by proper monitoring techniques \n Wash area several times with soap and warm (not hot) water \n Use a mildly abrasive soap, soft-bristled brush or emery board if detectable contamination is still present \n Resurvey the contaminated area after each decontamination \n Repeat decontamination steps until survey results do not change or if the skin is getting more irritated \n For contaminated lab coat, clothing or shoes: \n Remove contaminated items and check skin underneath for contamination \n If skin is contaminated, follow instructions for skin contamination \n Call EH&S at (951) 827-5528 for instructions; Call 2-5222, or 911 if it is after 5:00 pm or a weekend/holiday \n For Spills \n For radioactive liquid spills: \n If you have been trained and have the proper materials, contain or clean up spill and call EH&S at (951) 827-5528 \n If you have not been trained or can’t contain the spill, call 2-5222, or 911 for help \n For airborne release of radioactive gas, dust, volatile liquid or rupture of a sealed source: \n Call 2-5222, or 911 for help \n Do not attempt to decontaminate anything \n Turn off fans and blowers and close all ventilation \n Evacuate the area, closing and locking doors after leaving the room(s) \n Place warning signs that no one should enter room (s) on every access door \n Any potentially contaminated people should move to a nearby secure area until monitoring can take place \n For loss or theft of radioactive materials, sealed sources, or radiation producing machines: \n Call 2-5222, or 911 for help \n Additional Information / Follow-up Activities \n Report all incidents to your supervisor \n Decontaminate all useable equipment unless directed otherwise within procedures or by EH&S \n Properly dispose of radioactive waste through EH&S at 827-5528 \n \n \n \n \n \n            Suspicious Mail or Package     \n \n Definitions \n Suspicious Parcel or Object . Anything that is out of place and cannot be accounted for, or any item suspected of \nbeing an explosive device \n Immediate Actions \n If you receive or discover a suspicious letter or package: \n Do not touch, tamper with, or move it \n Call 2-5222, or 911 and report what you suspect immediately to UCPD \n Campus police will determine if evacuation or other action is necessary \n Notify your supervisor of what you suspect  \n Additional Information / Follow Up Activities \n Indicators that make a letter or package suspicious \n Powdery substance, oily stains, major discoloration, or crystallization on outside \n An unexpected letter from someone unfamiliar, has no return address, or is postmarked from a foreign country that may or may not match the return address \n Excessive postage, a handwritten or poorly typed address, no name, or misspelled common words \n The unusual weight given size, excessively bulky or lopsided or oddly shaped, or has an unusual amount of tape \n Has a strange odor \n Addressed to someone no longer with your organization, uses a wrong title, or reflects outdated personal information concerning addressee \n Has restrictive endorsements such as \"Personal\" or \"To Be Opened By Addressee Only\" \n \n \n \n \n \n            Violence or Crime on Campus     \n \n Immediate Actions \n If you are a victim of, or witness any crime or act of violence on campus: \n Call UCPD immediately, using 2-5222, or  911 (by phone, cell phone or payphone), an Emergency Call Box, a campus emergency phone, an elevator emergency phone/intercom; in a dire emergency, use a fire alarm pull station \n Be prepared to give the police dispatcher as much information as possible, including: \n Nature of incident \n Location of incident \n Description of person(s) involved \n Location or direction of travel of person(s) and/or vehicles involved \n Any obvious injuries to the victim or object \n Type of weapon (knife, pistol, rifle, shotgun, club, chain), if used \n Your name, location, department and extension number \n Additional Information / Follow Up Activities \n Do not take unnecessary chances or put yourself at risk \n Never argue with or attack a person committing a crime \n Try to get a good description of the criminal if you can do so without putting yourself at risk, and write it down \n Height, weight, sex, physical appearance, approximate age, clothing, method and direction of travel, perpetrator's name, if known to you or others at the scene \n Note anything that was touched or held by the criminal \n If the criminal leaves the area in a vehicle, note the type: make and model, license number (if possible), color, decals or stickers, or any outstanding characteristics \n If safe to do so, remain where you are until a police officer arrives \n Do not interfere with: \n People who are committing a crime or creating a disturbance \n Individuals behaving in an irrational or bizarre manner \n Law enforcement or medical responders at the scene \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n University of California, Riverside \n \n 900 University Ave. \n            Riverside, CA 92521 \n Tel: (951) 827-1012 \n \n \n UCR Library \n Campus Status \n Campus Store \n Career Opportunities \n Diversity \n Maps and Directions \n Visit UCR \n \n \n \n \n \n Office of Emergency Management  \n \n               Building and Safety Building\n             900 University Ave (P5532-Telecom)              Riverside, CA 92521              \n  tel: (951) 827-5528                         email:  emergency@ucr.edu   \n \n \n  Find Us \n \n \n \n \n \n \n \n \n \n \n \n \n Privacy Policy \n Terms and Conditions \n © 2021 Regents of the University of California \n \n \n \n \n \n \n \n \n \n \n × \n \n \n \n \n \n \n Let us help you with your search \n \n \n Enter your Search Criteria. \n \n \n \n Search All UCR \n \n \n Search This Site \n \n \n Cancel \n \n \n \n \n \n \n \n \n \n \n \n \n"
}