{
    "docno": "RJP452",
    "url": "http://riversidecvb.com/",
    "text": "              Riverside Convention Center & Visitors Bureau - RiversideCVB                 \n \n \n \n       Convention Center Sports Commission Contact Us     Submit RFP >   Menu Meet Meet Special Promotions Events Stay Dining Play Play Shopping Nightlife & Entertainment Arts & Culture Activities Our Team Parking Gallery News Testimonials COVID-19 Update                                 Discover Riverside   Learn More   Meet in Riverside   Welcome to Riverside A new ‘side of classic California, the most hospitable place in America! The Riverside Convention & Visitors Bureau family works tirelessly to ensure that meetings and convention guests feel right at home in Riverside. It’s industry-unique  Concierge Program  caters to every meeting planner’s need – one of the reasons Riverside’s percentage of repeat business is the envy of the Convention & Visitors Bureau industry!   Maps, Directions & Transportation The hub of inland Southern California Riverside is located just 20 miles from Ontario International Airport ( ONT ), home to seven major airlines, serving fourteen destinations with non-stop service, and offering 400 weekly departures. ONT makes travel easy, offering large airport amenities with small airport convenience, including easy exit and entrance, quick ticketing and gate access. With its central location, Riverside is also served by Los Angeles International Airport –  LAX  (50 miles), John Wayne Airport, Orange County –  SNA  (40 miles), Long Beach Airport –  LGB  (45 miles) and Palm Spring International Airport –  PSP  (50 miles). Riverside is also served by Uber, Lyft, Metrolink, Amtrak, Super Shuttle, limousines, and taxi services.   Get Directions Parking Information The 25 Suburbs Where Millennials Are Moving Time Magazine Hails Riverside Thousands of millennials are moving to the suburbs of Riverside, Calif., San Antonio, Texas and Orlando, Fla. The burbs of those three metro areas saw the greatest growth in the number of adults aged 25 to 34 between 2010 and 2015, according to data from the Urban Land Institute provided to TIME. CLICK HERE TO SEE SOME EXCITING NEWS  ABOUT  OUR EXPANSION! Current Weather   Awards                                 ©2021 Riverside Convention & Visitors Bureau, a division of Raincross Hospitality Corporation 3750 University Avenue #570, Riverside, CA. 92501   •  Phone: (951) 335-7040 Raincross Hospitality Corporation FAQ Site Map Privacy Policy / Terms and Conditions Careers                            "
}