{
    "docno": "RJP591",
    "url": "https://www.facebook.com/University-of-California-Riverside-Bell-Tower-207513156040/?ref=py_c",
    "text": "\n University of California, Riverside Bell Tower - Home | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home About Photos Reviews Posts Community See more of University of California, Riverside Bell Tower on Facebook Log In or Create New Account See more of University of California, Riverside Bell Tower on Facebook Log In Forgot account? or Create New Account Not Now Community See All 485 people like this 513 people follow this 6,239 check-ins About See All University of California, Riverside (74.03 mi)  Riverside, CA, CA 92521 Get Directions www.belltower.ucr.edu/index.html Landmark & Historical Place  ·  College & University  ·  School Hours  Always Open Page Transparency See More Facebook is showing information to help you better understand the purpose of a Page. See actions taken by the people who manage and post content. Page created - October 27, 2009 People 485  likes 6,239   visits Related Pages UC Riverside International Affairs College & University UCR CHALK THE WALK Arts & Entertainment Original Hacienda Grill Mexican Restaurant Tony's Mexican Grill - Riverside, CA Mexican Restaurant UCR Campus Apartments & Family Housing Apartment & Condo Building UCR Los Angeles Alumni College & University Culinary Kids Academy Elementary School UC Riverside Athletics Association School Trattoria Ponte Vecchio Italian Restaurant Xenia Bistro Italian Restaurant Holiday Inn Express North Hollywood - Burbank Area Hotel The Discovery Prep School, grades 6-12 Private School Mt. San Antonio College Foundation and Alumni Association Nonprofit Organization UCR Women's Resource Center College & University UCR Tomás Rivera Library College & University Barstow College Faculty Association Interest UC Riverside Ethnic Studies Education UCR Orbach Science Library Library Gluck Fellows of University of California, Riverside College & University UCR Transportation Services Parking Garage / Lot See More triangle-down Pages Liked by This Page UC Riverside, Graduate School of Education UCR ARTSblock KUCR University of California Police Department, Riverside UCR Cycling UCR Undergraduate School of Business UC Riverside - Education Abroad City of Riverside, CA - City Government UC Riverside Office of Sustainability Bourns College of Engineering at UC Riverside The WELL at UCR Puente Connection at UCR AGSM Graduate Business Programs UC Riverside Athletics UCR Alumni Association UCR Transportation Services UC Riverside Associated Students Program Board (ASPB) UCR Cheer & Dance Team University of California UC Riverside Library See More triangle-down Places Riverside, California University of California, Riverside Bell Tower English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 Photos See All Posts University of California, Riverside Bell Tower June 2 at 1:39 PM  ·  Check out this joyous carillon recital by the UCR Carilloneur, David Christensen. David Christensen, carillonneurUniversity of California, RiversideBernard Gordillo B., video production youtube.com The William H. Reynolds Memorial Carillon Recital - UCR 2021 David Christensen, carillonneurUniversity of California, RiversideBernard Gordillo B., video production David Christensen, carillonneurUniversity of California, RiversideBernard Gordillo B., video production University of California, Riverside Bell Tower April 1, 2020  ·  Whenever we all return to campus, the carillon is ready for us! The carillon at the UC Riverside Bell Tower is ringing a little clearer and brighter following a recent maintenance project. The long-needed work consisted of cleaning, repairing, or replacing the many components that make up the carillon. It also got some improved technology with the installation o... insideucr.ucr.edu A brighter sound for the carillon The carillon at the UC Riverside Bell Tower is ringing a little clearer and brighter following a recent maintenance project. The long-needed work consisted of cleaning, repairing, or replacing the many components that make up the carillon. It also got some improved technology with the installation o... The carillon at the UC Riverside Bell Tower is ringing a little clearer and brighter following a recent maintenance project. The long-needed work consisted of cleaning, repairing, or replacing the many components that make up the carillon. It also got some improved technology with the installation o... See All See More \n \n \n"
}