{
    "docno": "RJP515",
    "url": "https://developer.twitter.com/en/developer-terms/policy",
    "text": "\n \n \n \n Developer Policy â\u0080\u0093 Twitter Developers | Twitter Developer Platform   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Developer terms \n \n \n \n \n \n \n \n \n \n \n          Developer Policy\n         \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n          Let's get started\n         \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n                Twitter + Developers\n               \n \n \n \n                Using this policy\n               \n \n \n \n \n \n \n \n \n \n \n \n \n   \n \n \n \n \n \n \n \n \n \n \n \n \n                        Twitter + Developers\n                     \n \n \n \n                        Using this policy\n                     \n \n \n \n \n \n \n \n \n \n \n   \n \n \n \n Twitter + DevelopersÂ  \n \n Twitter loves developers. Weâ\u0080\u0099re delighted and amazed by the tools and services this community creates by harnessing the power of Twitter data. As part of our commitment to this community, we aim to provide data access that is open and fair for developers, safe for people on Twitter, and beneficial for the Twitter platform as a whole. To further these goals weâ\u0080\u0099ve crafted the Developer Policy as a guide to help people understand our rules and expectations about appropriate API and Twitter Content usage. \n This Developer Policy (â\u0080\u009cPolicyâ\u0080\u009d) provides rules and guidelines for developers who interact with Twitterâ\u0080\u0099s ecosystem of applications, services, website, web pages and content. It is part of your contract with Twitter governing access to and use of the Twitter API and Twitter Content (either as part of the Developer Agreement or other written agreement with Twitter). Policy violations are considered violations of your agreement. This Policy may be changed from time to time without notice. Capitalized terms used in this Policy, which are not defined in this Policy, will have the respective meanings ascribed to them in the  Developer Agreement  or the Master License Agreement. \n \n \n \n \n \n \n   \n \n \n \n Using this policy \n \n Weâ\u0080\u0099ve structured this policy to make it as easy to follow as possible. Please keep information from the following policy sections top of mind as you use the Twitter API and Twitter Content: \n Set Yourself Up for Success  -Â You are responsible for complying with all Twitter policies. Itâ\u0080\u0099s important that you review and understand this Policy, as well as the policies we link to in this document, before you access the Twitter API and Twitter Content. The time spent reviewing our policies may save you hours of rework down the road. Privacy and Control are Essential  - Protecting and defending the privacy of people on Twitter is built into the core DNA of our company. As such, we prohibit the use of Twitter data in any way that would be inconsistent with peopleâ\u0080\u0099s reasonable expectations of privacy. By building on the Twitter API or accessing Twitter Content, you have a special role to play in safeguarding this commitment, most importantly by respecting peopleâ\u0080\u0099s privacy and providing them with transparency and control over how their data is used. Follow the Platform Usage Guidelines  - Getting approved to access the Twitter API and Twitter Content is just the first step. Our Platform Usage Guidelines should be your first stop anytime you have questions about how to ensure policy compliance for your planned use of the Twitter platform. \n Weâ\u0080\u0099ve provided a lot more detail on what each of these three key sections mean below. Please review them carefully to ensure that your usage of the Twitter API and Twitter Content is consistent with our policies.Â  \n If we believe you are in violation of this Policy (or any other Twitter policy), we may suspend or permanently revoke your access to the Twitter API and Twitter Content. If this happens to you, do not apply for or register additional API keys. Instead, contact us via the  API Policy Support form .Â Â  \n Finally, please note that Twitter may monitor your use of the Twitter API to improve the Twitter Applications, to examine any commercial use, and to ensure your compliance with your approved use case and this Policy. \n Thanks for reading, and thank you for building with us! We look forward to seeing what you create! \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n          Chapter 1\n         \n \n          Set yourself up for success\n         \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n                Set yourself up for success\n               \n \n \n \n \n \n \n \n \n \n \n \n \n   \n \n \n \n \n \n \n \n \n \n \n \n \n                        Set yourself up for success\n                     \n \n \n \n \n \n \n \n \n \n \n   \n \n \n \n Set yourself up for success \n You can avoid many potential pitfalls while using the Twitter API by ensuring that your service has been built the right way from day 1. This section of the Developer Policy contains rules that all developers must follow before using the Twitter API or Twitter Content. \n We review all proposed uses of the Twitter developer platform to verify policy compliance â\u0080\u0094 so youâ\u0080\u0099re required to disclose (and update, as applicable) your planned use of the Twitter API and Twitter Content in order to be granted and to maintain access.  All new developers must  apply for a developer account  to access the Twitter API. Current developers without an approved developer account must apply for one as directed to do so by Twitter. As part of this process, youâ\u0080\u0099ll need to provide us with a written description of your intended uses of the Twitter API and Twitter Content. \n Your use case description is binding on you, and any substantive deviation from it may constitute a violation of our rules and result in enforcement action. You must notify us of any substantive modification to your use case and receive approval before you may begin using Twitter Content for that new purpose. Failure to do so may result in suspension and termination of your API and data access. You can update your use case by visiting our  API Policy Support form , selecting  I need to update my developer use case,  or as otherwise agreed by Twitter. \n By building on the Twitter API or accessing Twitter Content, you must comply with ALL Twitter policies.  These include this  Developer Policy , the  Automation Rules , the  Display Requirements , the  API Restricted Uses Rules , the  Twitter Rules , the  Twitter Brand Resources , the  Periscope Community Guidelines , and the  Periscope Trademark Guidelines , as well as any other agreements you enter into with Twitter relating to your use of the Twitter API or Twitter Content, including but not limited to the  Developer Agreement  or a Master Licensing Agreement or Order (as applicable). You must also comply with any modifications to these policies and any new policies launched by Twitter. It is your responsibility to monitor the use of your service and to design your service to prevent violations of Twitter policy by people who use it. Failure to do so may result in suspension or termination of your API and Twitter Content access. \n You may not register multiple applications for a single use case or substantially similar or overlapping use cases.  In this context, a â\u0080\u009cuse caseâ\u0080\u009d is a consistent set of analyses, displays, or actions performed via an application. Please note that providing the same service or application to different people (including â\u0080\u009cwhite labelâ\u0080\u009d versions of a tool or service) counts as a single use case. \n As a single exception to these rules,  you may create and use a maximum of 3 applications for development, staging, and production instances of the same service. These apps must be registered to a single account, and should be clearly identified (in the name and description) as dev, staging, and prod instances of a single service.  You may not use development or staging applications for production purposes. \n \n You must keep all API keys or other access credentials private.  You may not use, and may not encourage or facilitate others to use, API keys or other access credentials owned by others. \n Your license agreement with Twitter limits your use of the Twitter API and Twitter Content. Among other things, the Twitter API has rate limits which help to ensure fair data usage and to combat spam on the platform.  You may not exceed or circumvent rate limits, or any other limitations or restrictions described in this Policy or your agreement with Twitter, listed on the  Developer Site , or communicated to you by Twitter. \n You may not remove or alter any proprietary notices or marks on Twitter Content received via the Twitter API.  This helps to make sure that people know where Twitter Content is coming from, and who it belongs to. \n For data integrity and platform health reasons, you may not interfere with, intercept, disrupt, or disable any features of the Twitter API or the Twitter service.  In other words, use the APIs as intended and documented on  developer.twitter.com . Refer to our  HackerOne guidelines  for more details about acceptable use. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n          Chapter 2\n         \n \n          Privacy and control are essential\n         \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n                Privacy and control are essential\n               \n \n \n \n                Consent & permissions \n               \n \n \n \n                Content compliance\n               \n \n \n \n                Off-Twitter matching\n               \n \n \n \n                Your privacy policy\n               \n \n \n \n                Using geo-data\n               \n \n \n \n                Twitter passwords\n               \n \n \n \n \n \n \n \n \n \n \n \n \n   \n \n \n \n \n \n \n \n \n \n \n \n \n                        Privacy and control are essential\n                     \n \n \n \n                        Consent & permissions \n                     \n \n \n \n                        Content compliance\n                     \n \n \n \n                        Off-Twitter matching\n                     \n \n \n \n                        Your privacy policy\n                     \n \n \n \n                        Using geo-data\n                     \n \n \n \n                        Twitter passwords\n                     \n \n \n \n \n \n \n \n \n \n \n   \n \n \n \n Privacy and control are essential \n Twitter takes privacy seriously, and we expect everyone using Twitter Content and the Twitter API to do the same. Any use of the Twitter developer platform, Twitter API, or Twitter Content in a manner that is inconsistent with peoplesâ\u0080\u0099 reasonable expectations of privacy may be subject to enforcement action, which can include suspension and termination of API and Twitter Content access. \n Your commitment to privacy and control must extend to all uses of Twitter Content and all aspects of the service that you build using our API. To that end, the people using your service must understand and consent to how you use their data, and how you access Twitter on their behalf. This can be accomplished through providing people with a clear, comprehensive, and transparent privacy policy, as well as ensuring that you get express and informed consent from each person using your service before taking any action on their behalf.  Please note that a person authenticating into your service does not by itself constitute consent.  \n \n \n \n \n \n \n   \n \n \n \n Consent & permissions \n In particular, you must get express and informed consent from people before doing any of the following: \n Taking  any  actions on their behalf. This includes (but is not limited to):Â  \n Posting content to Twitter \n Following/unfollowing accounts \n Modifying profile or account information \n Starting a Periscope Broadcast \n Adding hashtags or any other content to Tweets \r\nÂ  \n \n Republishing content accessed by means other than via the Twitter API or other Twitter tools \n Using someoneâ\u0080\u0099s Twitter Content to promote a product or service \n Storing non-public content such as Direct Messages (DMs), or any other private or confidential information \n Sharing or publishing protected content, or any other private or confidential information \n \n If your service allows people to post content to Twitter you must do the following before publishing: \n Show exactly what will be published \n Make it clear to people using your service what geo information (if any) will be added to the content \n \n If your service allows people to post content to both your service and Twitter, you must do the following before publishing: \n Obtain permission to post the content \n Explain where you will post the content \n \n You must respect the protected and blocked status of all Twitter Content. You may not serve content obtained using one personâ\u0080\u0099s authentication token to a different person who is not authorized to view that content. \n Protected accounts:  A  protected account â\u0080\u0099s content is only available to people who have been approved by the owner to follow that account. So, if you run a service that accesses protected accounts, you may only do so to serve such content to the specific people with permission to view that content. \n Blocked accounts:  People on Twitter are able to  block  access to their accounts for any reason they choose. Commingling information obtained from tokens (or any other API-based action) to bypass this choice is not permitted. \n \n As Direct Messages (DMs) are non-public in nature, services that provide DM features must take extra steps to safeguard personal privacy. You may not serve DM content to people who are not authorized to view that content. If your service provides DM functionality you must also: \n Notify people if you send read receipt events for DMs. You can do this by providing a notice directly in your service, or by displaying read receipts from other participants in a conversation. Get consent before configuring media to be sent in a DM as \"shared\" (i.e. reusable across multiple DMs). If you do allow media in a DM to be â\u0080\u009cshared,â\u0080\u009d you must provide a clear notice that this content will be accessible to anyone with the mediaâ\u0080\u0099s URL. \n \n \n \n \n \n \n \n   \n \n \n \n Content compliance \n If you store Twitter Content offline, you must keep it up to date with the current state of that content on Twitter.  Specifically, you must delete or modify any content you have if it is deleted or modified on Twitter. This must be done as soon as reasonably possible, or within 24 hours after receiving a request to do so by Twitter or the applicable Twitter account owner, or as otherwise required by your agreement with Twitter or applicable law. This must be done unless otherwise prohibited by law, and only then with the express written permission of Twitter. \n Modified content can take various forms. This includes (but is not limited to):Â  \n Content that has been made private or gained protected status \n Content that has been suspended from the platform \n Content that has had geotags removed from it \n Content that has been withheld or removed from Twitter \n \n \n \n \n \n \n \n   \n \n \n \n Off-Twitter matching \n We limit the circumstances under which you may match a person on Twitter to information obtained or stored off-Twitter. Â Off-Twitter matching involves associating Twitter Content, including a Twitter @handle or user ID, with a person, household, device, browser, or other off-Twitter identifier. You may only do this if you have express opt-in consent from the person before making the association, or as described below. \n In situations in which you donâ\u0080\u0099t have a personâ\u0080\u0099s express, opt-in consent to link their Twitter identity to an off-Twitter identifier, we require that any connection you draw be based only on information that someone would reasonably expect to be used for that purpose. In addition, absent a personâ\u0080\u0099s express opt-in consent you may only attempt to match your records about someone to a Twitter identity based on: \n Information provided directly to you by the person.Â  Note that records about individuals with whom you have no prior relationship, including data about individuals obtained from third parties, do not meet this standard; and/or \n Public data.  â\u0080\u009cPublic dataâ\u0080\u009d in this context refers to: \n Information about a person that you obtained from a public, generally-available resource (such as a directory of members of a professional association) \n Information on Twitter about a person that is publicly available, including: \n Tweets \n Profile information, including an account bio and publicly-stated location \n Display name and @handle \n \n \n \n \n \n \n \n \n \n   \n \n \n \n Your privacy policy \n You must display your serviceâ\u0080\u0099s privacy policy to people before they are permitted to download, install, or sign up to your service.  It must disclose at least the following information: \n The information that you collect from people who use your service \n How you use and share that information (including with Twitter) \n How people can contact you with inquiries and requests regarding their information \n \n Your privacy policy must be consistent with all applicable laws, and be no less protective of people than  Twitterâ\u0080\u0099s Privacy Policy  and the  privacy policy of our other services and corporate affiliates . You must cease your access to the Twitter API and the use of all Twitter Content if you are unable to comply with your and/or Twitterâ\u0080\u0099s Privacy Policy. \n \n \n \n \n \n \n   \n \n \n \n Using geo-data \n Use of geo data comes with additional restrictions due to the sensitive nature of this information.  If your service adds location information to Tweets or Periscope Broadcasts, you must disclose to people: \n When you add location information \n Whether you add location information as a geotag or annotations data \n Whether your location information is listed as a place, or as geographic coordinates \n \n If your application allows people to Tweet with their location you must comply with Twitterâ\u0080\u0099s  geo guidelines  in full.Â  \n Any use of location data or geographic information on a standalone basis is prohibited.  You may not (and may not permit others to) store, aggregate, or cache location data and other geographic information contained in Twitter Content, except as part of a Tweet or Periscope Broadcast. For example, you may not separate location data or geographic information out from Tweets to show where individuals have been over time. Heat maps and related tools that show aggregated geo activity (e.g.: the number of people in a city using a hashtag) are permitted. \n \n \n \n \n \n \n   \n \n \n \n Twitter passwords \n You may not store Twitter passwords, or request that people provide their Twitter password, account credentials, or developer application information (including consumer key) to you directly.  We suggest the use of  Sign-in with Twitter  as the authentication tool to link your service and people on Twitter. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n          Chapter 3\n         \n \n          Platform usage guidelines\n         \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n                Platform usage guidelines\n               \n \n \n \n                Spam, bots, and automation\n               \n \n \n \n                Twitter performance benchmarking\n               \n \n \n \n                Public display of Tweets\n               \n \n \n \n                Content redistribution\n               \n \n \n \n                Replicating the Twitter experience\n               \n \n \n \n                Pay to Engage\n               \n \n \n \n                Service authenticy\n               \n \n \n \n                Twitter name, logo, and likeness\n               \n \n \n \n                Advertising on Twitter\n               \n \n \n \n \n \n \n \n \n \n \n \n \n   \n \n \n \n \n \n \n \n \n \n \n \n \n                        Platform usage guidelines\n                     \n \n \n \n                        Spam, bots, and automation\n                     \n \n \n \n                        Twitter performance benchmarking\n                     \n \n \n \n                        Public display of Tweets\n                     \n \n \n \n                        Content redistribution\n                     \n \n \n \n                        Replicating the Twitter experience\n                     \n \n \n \n                        Pay to Engage\n                     \n \n \n \n                        Service authenticy\n                     \n \n \n \n                        Twitter name, logo, and likeness\n                     \n \n \n \n                        Advertising on Twitter\n                     \n \n \n \n \n \n \n \n \n \n \n   \n \n \n \n Platform usage guidelines \n Have you taken care to review Twitterâ\u0080\u0099s policies and set up your API access the right way? Does your service follow Twitterâ\u0080\u0099s privacy and control guidelines? If you can answer yes to these two questions, then you are ready to start using the Twitter API and Twitter Content. Twitterâ\u0080\u0099s Platform Usage Guidelines provide the assistance needed to ensure that your use of Twitter Content is compliant from day 1 throughout the lifecycle of your service. We suggest reviewing these rules on a regular basis to make sure that your integration is operating in a way that is safe and beneficial to people on Twitter and the Twitter platform as a whole. \n \n \n \n \n \n \n   \n \n \n \n Spam, bots, and automation \n The use of the Twitter API and developer products to create spam, or engage in any form of platform manipulation, is prohibited.  You should review the Twitter Rules on  platform manipulation and spam , and ensure that your service does not, and does not enable people to, violate our policies. \n Services that perform write actions, including posting Tweets, following accounts, or sending Direct Messages, must follow the  Automation Rules .  In particular, you should:Â  \n Always get explicit consent before sending people  automated replies or Direct Messages \n Immediately respect requests to opt-out of being contacted by you \n Never perform bulk, aggressive, or spammy actions, including  bulk following \n Never post identical or substantially similar content across  multiple accounts \n \n If youâ\u0080\u0099re operating an API-based bot account you must clearly indicate what the account is and who is responsible for it. Â You should never mislead or confuse people about whether your account is or is not a bot. A good way to do this is by including a statement that the account is a bot in the profile bio. \n \n \n \n \n \n \n   \n \n \n \n Twitter performance benchmarking \n You may not use the Twitter API to measure the availability, performance, functionality, or usage of Twitter for benchmarking, competitive, or commercial purposes.  For example, you should never use the Twitter API to: \n Calculate aggregate Twitter metrics, such as the total number of Monthly Actives (MAs) or Daily Actives (DAs) \n Calculate aggregate Periscope metrics, such as total number of broadcast views \n Calculate aggregate Twitter Tweet metrics, such as the total number of Tweets posted per day, or the number of account engagements \n Measure or analyze the responsiveness of Twitter \n Measure or analyze spam or security on Twitter, except as permitted below \n \n We support research that helps improve conversational health on Twitter.  You may use the Twitter API and Twitter Content to measure and analyze topics like spam, abuse, or other platform health-related topics for non-commercial research purposes. You may not develop, create, or offer commercial services using the Twitter API or Twitter Content that measure, analyze, or attempt to identify behaviors or content which violate Twitter policies without express written permission from Twitter. \n If you have questions about whether your use case qualifies as non-commercial research for this purpose please submit a request via the  API Policy Support form . \n \n \n \n \n \n \n   \n \n \n \n Public display of Tweets \n You must maintain the integrity of all Twitter Content that you display publicly or to people who use your service.  If you donâ\u0080\u0099t use  Twitter for Websites  to display content, then you must use the Twitter API to retrieve the most current version available for display. If displayed content ceases to be available through the Twitter API, then you must remove it from your service as soon as reasonably possible, or within 24 hours after the receipt of a removal request from Twitter, or the applicable Twitter account owner, or as otherwise required by applicable law. \n There are specific rules you must follow if you display Twitter Content offline. Â  Follow the  guidelines  for using Tweets in broadcast if you display Tweets offline. Follow the  guidelines  for using Periscope Broadcasts if you display Periscope Broadcasts offline. \n If you embed or display Tweets, you must contact us about your Twitter API access if your site exceeds 10 million daily impressions.  Twitter reserves the right to require additional terms as a condition to your use of the Twitter API.Â  Additional restrictions on Twitter for Websites developer use include: \n Embedded Tweets and/or embedded timelines \n \n You must provide people with legally sufficient notice that fully discloses Twitterâ\u0080\u0099s collection and use of data about browsing activities on your website, including for interest-based advertising and personalization. You must also obtain legally sufficient consent from people for such collection and use \n You must provide legally sufficient instructions on how people can opt out of Twitterâ\u0080\u0099s interest-based advertising and personalization as described  here \r\nÂ  \n Twitter for Websites widgets \n \n You must ensure that people are provided with clear and comprehensive information about, and consent to, the storing and accessing of cookies or other information on their devices as described in Twitterâ\u0080\u0099s  cookie use , where providing such information and obtaining such consent is required by law \r\nÂ  \n Services targeted to children under 13 \n \n Services targeted to children under 13 must opt out of tailoring Twitter in any embedded Tweet and/or embedded timelines by setting the opt-out parameter to be â\u0080\u0098trueâ\u0080\u0099 as described  here \n \n \n \n \n \n \n \n   \n \n \n \n Content redistribution \n The best place to get Twitter Content is directly from Twitter. Consequently, we restrict the redistribution of Twitter Content to third parties. Â  If you provide Twitter Content to third parties, including downloadable datasets or via an API, you may only distribute Tweet IDs, Direct Message IDs, and/or User IDs (except as described below). We also grant special permissions to academic researchers sharing Tweet IDs and User IDs for non-commercial research purposes. \n In total, you may not distribute more than 1,500,000 Tweet IDs to any entity (inclusive of multiple individuals associated with a single entity) within any 30 day period unless you have received written permission from Twitter. In addition, all developers may provide up to 50,000 public Tweets Objects and/or User Objects to each person who uses your service on a daily basis if this is done via non-automated means (e.g., download of spreadsheets or PDFs). \n Academic researchers are permitted to distribute an unlimited number of Tweet IDs and/or User IDs if they are doing so on behalf of an academic institution and for the sole purpose of non-commercial research. For example, you are permitted to share an unlimited number of Tweet IDs for the purpose of enabling peer review or validation of your research. If you have questions about whether your use case qualifies under this category please submit a request via the  API Policy Support form . \n Any Twitter Content provided to third parties remains subject to this Policy, and those third parties must agree to the Twitter  Terms of Service ,  Privacy Policy ,  Developer Agreement , and  Developer Policy  before receiving such downloads. You may not enable any entity to circumvent any other limitations or restrictions on the distribution of Twitter Content as contained in this  Policy , the  Developer Agreement , or any other agreement with Twitter. \n \n \n \n \n \n \n   \n \n \n \n Replicating the Twitter experience \n \r\nThe best place to experience Twitter is on Twitter owned and operated (TOO) products.  As such, we discourage developers from building services that replicate Twitterâ\u0080\u0099s core experience or features. \n If you create a service that replicates Twitterâ\u0080\u0099s core experience or features you will be subject to additional rules beyond what is already included in the Developer Policy.  In particular, you must: \n Obtain our permission to have more than 100,000 tokens. You may be subject to additional terms if this request is approved \n Use the Twitter API for functionalities in your service that are substantially similar to Twitter features. This includes, but is not limited to, Tweets, follows, unfollows, retweets, likes, comments, and replies. \n Display a prominent link or button in your service that directs new people to Twitterâ\u0080\u0099s account creation page \n \n If you create a service that replicates Twitterâ\u0080\u0099s core experience or features you may not do any of the following: \n Pay, or offer to pay, third parties for distribution. This includes offering compensation for downloads (other than transactional fees) or other mechanisms of traffic acquisition \n Arrange for your service to be pre-installed on any other device, promoted as a \"zero-rated\" service, or marketed as part of a specialized data plan \n Use Twitter Content or other data collected from people to create or maintain a separate conversational platform, social network, status update, private messaging or live broadcasting database or service \n \n \n \n \n \n \n   \n \n \n \n Pay to Engage \n Your service shouldnâ\u0080\u0099t compensate people to take actions on Twitter, as that results in inauthentic engagement that degrades the health of the platform.  As you use the Twitter API you may not sell or receive monetary or virtual compensation for any Twitter or Periscope actions. This includes, but is not limited to, Tweets, follows, unfollows, retweets, likes, comments, and replies. \n \n \n \n \n \n \n   \n \n \n \n Service authenticity \n You must clearly identify your service so that people can understand its source and purpose.  Donâ\u0080\u0099t use names, logos, or URLs that mask your serviceâ\u0080\u0099s identity and features, or that falsely imply an affiliation with Twitter or third parties. Note that creating applications for the purpose of selling names, or to prevent others from using names, is prohibited. \n You may not use any URL (including shortened URLs) for your service that directs people to: \n A site that is unrelated to your service \n A spam or malware site \n A site that encourages people to violate Twitter policy \n \n \n \n \n \n \n \n   \n \n \n \n Twitter name, logo, and likeness \n You may only use and display the Twitter name and logo to identify Twitter as the source of Twitter Content.  You should never use the Twitter name and logo, the Twitter Official Partner Program badge, or any other similar marks or names in a manner that creates a false sense of endorsement, sponsorship, or association with Twitter. The Twitter  Brand Resources  contain detailed information to help you use the Twitter brand in the right way. \n You may only use the Twitter Verified Account badge and any other enhanced account categorization as it is reported to you by Twitter through the API.  This helps people know that the content your service displays is equivalent to that shown on Twitter. \n \n \n \n \n \n \n   \n \n \n \n Advertising on Twitter \n There are restrictions regarding how and where you are allowed to advertise around Twitter Content.  To start, your advertisements canâ\u0080\u0099t resemble or reasonably be confused by people as a Tweet or Periscope Broadcast. Other rules on advertising include: \n There must be a clear separation between Twitter Content and your advertisements.  You may not place any advertisements within the Twitter timeline or on or within Periscope Broadcasts on your service other than Twitter Ads or advertisements made available through the official Twitter Kit integration with MoPub. \n Twitter reserves the right to serve advertising via the Twitter API.  If you decide to serve Twitter Ads once we start delivering them via the API, we will share a portion of advertising revenue with you in accordance with the relevant terms and conditions. \n You may not use Twitter Content, or information obtained from the Twitter API to target people with advertising outside of the Twitter platform. \n \n You must  contact us  if you find that your service will require more than 1 million tokens.  Services that require more than 1 million tokens may be subject to additional terms regarding Twitter API access. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n          Chapter 4\n         \n \n          Rules for specific Twitter services or features\n         \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n                Twitter Login\n               \n \n \n \n                Twitter Cards\n               \n \n \n \n                Periscope Producer\n               \n \n \n \n                Definitions\n               \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n   \n \n \n \n \n \n \n \n \n \n \n \n \n                        Twitter Login\n                     \n \n \n \n                        Twitter Cards\n                     \n \n \n \n                        Periscope Producer\n                     \n \n \n \n                        Definitions\n                     \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n The following additional rules apply for any use of the Twitter services or features listed below: \n \n \n \n \n \n \n   \n \n \n \n Twitter Login \n You must present people with easy to find options to log into and out of Twitter, for example via the OAuth protocol.  The  Sign in with Twitter  option must be displayed at least as prominently as any other sign-up or sign-in feature on your service. You must also provide people without a Twitter account the opportunity to create one via Twitter. \n Once someone on your service authenticates via  Sign in with Twitter  you must clearly display their Twitter identity.  Twitter identity includes the personâ\u0080\u0099s current Twitter @handle, avatar, and Twitter logo. Any display of someoneâ\u0080\u0099s Twitter followers on your service must clearly show that the relationship is associated with Twitter. \n \n \n \n \n \n \n   \n \n \n \n Twitter Cards \n To ensure a quality experience you must develop your Card to render across all platforms where Cards are displayed.  Additional rules that you must follow when using Cards include: \n You must mark your Tweet as â\u0080\u0098trueâ\u0080\u0099 for sensitive media if you plan to display such media within a Card \n You must use HTTPS for hosting all assets within your Card. Your Card should never generate active mixed content browser warnings \n Audio and video content should include stop or pause controls, and default to â\u0080\u0098sound offâ\u0080\u0099 for videos that automatically play content \n \n You may not exceed or circumvent Twitterâ\u0080\u0099s limitations placed on any Cards, including the Cardâ\u0080\u0099s intended use.  Additional restrictions on Cards use include: \n You may not place third-party sponsored content within Cards without Twitterâ\u0080\u0099s approval \n You may not attach monetary incentives (including virtual currency) within your Card or on Twitter from your Card \n You may not include content or actions within your Card that are misleading or not contextually relevant, such as URLs and media. \n You may only attach an App Card to a Tweet when someone is explicitly promoting or referring to the app in the Tweet \n \n \n \n \n \n \n \n   \n \n \n \n Periscope Producer \n \n You must  contact us  about your Twitter API access if you expect your service to exceed 10 million daily broadcasts.  You may be subject to additional terms if you exceed this threshold. Additional restrictions on Periscope developer use include: \n You must provide a reasonable user-agent, as described in the Periscope Producer technical documentation, for your service when accessing the Periscope API \n You must honor requests from people to log out of their Periscope account on your service \n You may not provide tools in your service to allow people to circumvent technological protection measures \n \n \n \n \n \n \n   \n \n \n \n Definitions \n \n Twitter Content  â\u0080\u0092 Tweets, Tweet IDs, Twitter end user profile information, Periscope Broadcasts, Broadcast IDs and any other data and information made available to you through the Twitter API or by any other means authorized by Twitter, and any copies and derivative works thereof. \n Developer Site  â\u0080\u0092 Twitterâ\u0080\u0099s developer site located at  https://developer.twitter.com . \n Periscope Broadcast  - A live or on-demand video stream that is publicly displayed on Twitter Applications and is generated by a user via Twitterâ\u0080\u0099s Periscope Producer feature (as set forth at  https://help.periscope.tv/customer/en/portal/articles/2600293 ). \n Services  â\u0080\u0092 Your websites, applications and other offerings that display Twitter Content or otherwise use the Licensed Material as explicitly approved by Twitter. \n Tweet ID  â\u0080\u0092 A unique identification number generated for each Tweet. \n Tweet  â\u0080\u0092 a posting made on Twitter Applications. \n â\u0080\u009cTwitterâ\u0080\u009d  means Twitter, Inc., with an office located at 1355 Market Street, Suite 900, San Francisco, CA, 94103, USA.Â  If you enter into this Agreement or an Order outside of the United States, Canada or Latin America, Twitter International Company with its registered offices at One Cumberland Place, Fenian Street, Dublin 2, D02 AX07, Ireland (â\u0080\u009cTICâ\u0080\u009d) is the contracting entity.Â  \n Direct Message  - A messageÂ  that is privately sent on Twitter Applications by one end user to one or more specific end user(s) using Twitterâ\u0080\u0099s Direct Message function. \n Twitter API  â\u0080\u0092 The Twitter Application Programming Interface (â\u0080\u009cAPIâ\u0080\u009d), Software Development Kit (â\u0080\u009cSDKâ\u0080\u009d) and/or the related documentation, data, code, and other materials provided by Twitter with the API, as updated from time to time, including without limitation through the Developer Site. \n Twitter Applications  â\u0080\u0092 Twitterâ\u0080\u0099s consumer facing products, services, applications, websites, web pages, platforms, and other offerings, including without limitation, those offered via  https://twitter.com  and Twitterâ\u0080\u0099s mobile applications. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n            Developer policy and terms\n           \n \n \n \n            Follow @twitterdev\n           \n \n \n \n \n    Subscribe to developer news\n\n    \n    \n\n    \n    \n   \n \n \n \n \n \n \n \n \n \n \n \n \n \n              Twitter platform\n               \n \n \n \n \n \n \n \n \n                  Twitter.com\n                 \n \n \n \n                  Status\n                 \n \n \n \n                  Card validator\n                 \n \n \n \n                  Privacy Center\n                 \n \n \n \n                  Transparency Center\n                 \n \n \n \n \n \n              Twitter, Inc.\n               \n \n \n \n \n \n \n \n \n                  About the company\n                 \n \n \n \n                  Twitter for Good\n                 \n \n \n \n                  Company news\n                 \n \n \n \n                  Brand toolkit\n                 \n \n \n \n                  Jobs and internships\n                 \n \n \n \n                  Investors\n                 \n \n \n \n \n \n              Help\n               \n \n \n \n \n \n \n \n \n                  Help Center\n                 \n \n \n \n                  Using Twitter\n                 \n \n \n \n                  Twitter Media\n                 \n \n \n \n                  Ads Help Center\n                 \n \n \n \n                  Managing your account\n                 \n \n \n \n                  Safety and security\n                 \n \n \n \n                  Rules and policies\n                 \n \n \n \n                  Contact us\n                 \n \n \n \n \n \n              Developer resources\n               \n \n \n \n \n \n \n \n \n                  Developer home\n                 \n \n \n \n                  Documentation\n                 \n \n \n \n                  Forums\n                 \n \n \n \n                  Communities\n                 \n \n \n \n                  Developer blog\n                 \n \n \n \n                  Engineering blog\n                 \n \n \n \n                  Developer terms\n                 \n \n \n \n \n \n              Business resources\n               \n \n \n \n \n \n \n \n \n                  Advertise\n                 \n \n \n \n                  Twitter for business\n                 \n \n \n \n                  Resources and guides\n                 \n \n \n \n                  Twitter for marketers\n                 \n \n \n \n                  Marketing insights\n                 \n \n \n \n                  Brand inspiration\n                 \n \n \n \n                  Twitter Data\n                 \n \n \n \n                  Twitter Flight School\n                 \n \n \n \n \n \n \n \n \n \n              © 2021 Twitter, Inc.\n             \n \n \n \n                Cookies\n               \n \n \n \n                Privacy\n               \n \n \n \n                Terms and conditions\n               \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n            By using Twitterâ\u0080\u0099s services you agree to our  Cookies Use . We use cookies for purposes including analytics, personalisation, and ads.\n\n           \n \n \n \n OK \n \n \n \n \n \n \n \n \n \n \n \n \n            This page and certain other Twitter sites place and read third party cookies on your browser that are used for non-essential purposes including targeting of ads. Through these cookies,  Google ,  LinkedIn  and  Demandbase  collect personal data about you for their own purposes.  Learn more . \n \n \n \n \n Accept \n Decline \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n"
}