{
    "docno": "RJP550",
    "url": "https://portal.facebook.com/",
    "text": "\n Video Calling Devices with Alexa Built-in | Portal from Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Portal devices starting at $99 now through 6/26.* Free shipping. Easy Returns. Share something real with Portal For a limited time, Portal devices starting at $99. Ends 6/26.*  Shop Now  Watch the Demo Starting at $99 through 6/26*  Ship to multiple addresses at no extra cost. Smart video calling on the biggest screen in your home Smart video calling on a  10”  HD display Smart video calling on a  15.6”  HD display Smart video calling on an  8”  HD display  Portal to Portal or practically anything   Video call friends with WhatsApp, Messenger, Zoom and more. Even to their smartphones and tablets if they don’t have Portal.  How to Use Apps with Portal Don’t just read the story. Be the story.  Story Time makes you the star of iconic children’s tales, with music, animation and AR effects.  Discover Put a smile on your face with AR masks  Transform any video call with the magic and delight of AR masks and more.   A photo frame that’s picture perfect   Display memorable photos and videos. Easily add images from your phone or Instagram.   “Alexa, show me the front door.”  Alexa Built-in.  Now you’re talking.  Say hello to your new personal assistant, Alexa Built-in. Control your smart home, check who’s at the door, throw on some music, start a call and more–just by asking.  Learn More Private by design  Easily disable the camera and microphone or quickly block the lens with the camera cover. And rest assured knowing that all Portal video calls are encrypted.   Learn More  Work smarter from home  Whether you and your co-workers use Workplace, BlueJeans, GoToMeeting, Webex or Zoom, Portal has the tools to keep you productive while working from home.   Learn More  Spotlight and community Find the Portal that’s right for you  Starting at $99 through 6/26*  Ship to multiple addresses at no extra cost. Compare Products Get emails from Facebook about Portal and other Facebook hardware products. Sign Up Facebook Instagram Twitter Youtube United States    (English  / US Dollars )  Home Products Features Private by Design Support Sitemap Privacy Policy Cookies Terms of Use Legal Terms of Sale Ad Choices “Hey Portal” voice command availability varies.  Learn more . Screen images simulated. User experience may vary. Requires wireless internet connection and Facebook or WhatsApp account. WhatsApp is not available on tablets. Features, functionality, and content vary and may not be available on all Portal models or in all areas and languages. Some features may require a Facebook account and downloading the Portal mobile app. Additional account registration, terms and fees may apply.   *Portal and Portal TV Sale: Offer valid 5/27/21 (9:00 pm PST) – 6/26/21 (11:59 pm PST). Limit 4 devices per transaction. Valid on qualifying purchases at  portal.facebook.com . Subject to availability, quantities are limited. Not valid on prior orders or purchases; cannot be transferred or otherwise redeemed for cash. Cannot be combined with other offers, discounts, bundles, or coupons. Savings automatically applied at checkout. Facebook Technologies, LLC reserves the right to cancel or modify this offer at any time without notice. Void where prohibited.   ©2021 Facebook, Inc. or its affiliates. All rights reserved. Facebook, Portal from Facebook and the Facebook logo are trademarks of Facebook, Inc. Amazon, Alexa and all related logos are trademarks of Amazon.com, Inc. or its affiliates. Other names and brands may be claimed as the property of others.  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n   \n"
}