{
    "docno": "RJP592",
    "url": "https://www.facebook.com/westlyprize/?ref=py_c",
    "text": "\n Westly Foundation & Westly Prize - Home | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home About Events Photos Videos Community Groups Reviews Posts See more of Westly Foundation & Westly Prize on Facebook Log In or Create New Account See more of Westly Foundation & Westly Prize on Facebook Log In Forgot account? or Create New Account Not Now Community See All 393 people like this 441 people follow this 7 check-ins About See All PO Box 7804 (293.99 mi)  Menlo Park, CA, CA 943026 Get Directions Contact Westly Foundation & Westly Prize on Messenger westly.org Nonprofit Organization  ·  Charity Organization Page Transparency See More Facebook is showing information to help you better understand the purpose of a Page. See actions taken by the people who manage and post content. Page created - April 4, 2015 People 393  likes 7   visits Related Pages Leland Scholars Program at Stanford University Education The Audacious Project Company Alison Cormack Political Candidate Cardinal Ventures Nonprofit Organization Stanford Asian American Activism Committee - SAAAC Community Organization Room to Read: San Francisco Bay Area Chapter Nonprofit Organization Neighbors Abroad of Palo Alto Nonprofit Organization Stanford South Asian Society Community Organization SIRUM Nonprofit Organization HealthPlusPlus Medical Company Effective Altruism at UCLA Youth Organization Stanford + Mental Health Mental Health Service MEChA de Stanford Community Organization Me, Myself, & You Games/Toys The Board Match Nonprofit Organization Peerlift Nonprofit Organization Theta Tau, Omicron Gamma Organization Social Entrepreneurship Association at UCSD Entrepreneur DataKind SF Bay Area Nonprofit Organization Cardinal Calypso Musician/Band See More triangle-down Pages Liked by This Page Singularity Hub Echoing Green Waste No Food The Hidden Genius Project Evelyn and Walter Haas, Jr. Fund SCU Ciocca Center for Innovation and Entrepreneurship Children Now Advance Social Innovation Volunteer Opportunities Miller Center for Social Entrepreneurship Steve Westly GreatNonprofits Cisco CSR Pivotal Silicon Valley Council of Nonprofits Breakthrough Silicon Valley Immigrants Rising OpenIDEO Chan Zuckerberg Initiative Science is Elementary Digital NEST See More triangle-down Places Menlo Park, California Community Organization Charity Organization Westly Foundation & Westly Prize English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 Photos See All Videos Dante & Itzel of LELP 1 Apply today! 2 See All See More \n \n \n"
}