{
    "docno": "RJP588",
    "url": "https://www.facebook.com/SummitPSRainier/?ref=py_c",
    "text": "\n Summit Public School: Rainier - Home | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home Reviews Photos Videos Posts Events About Community See more of Summit Public School: Rainier on Facebook Log In or Create New Account See more of Summit Public School: Rainier on Facebook Log In Forgot account? or Create New Account Not Now Summit Public School: Rainier High School in San Jose, California 5 5 out of 5 stars. Always Open Community See All 190 people like this 205 people follow this 209 check-ins About See All 1750 S White Rd (274.29 mi)  San Jose, CA, CA 95127 Get Directions (408) 831-3104 rainier.summitps.org High School  ·  Public School  ·  Campus Building Hours  Always Open Page Transparency See More Facebook is showing information to help you better understand the purpose of a Page. See actions taken by the people who manage and post content. Page created - January 6, 2015 People 190  likes 209   visits Related Pages Summit Public Schools - Washington High School Professor Phoebe Public Figure Alariss Education Summit News News & Media Website Old Orchard School Elementary School Summit Public Schools Nonprofit Organization Westly Foundation & Westly Prize Nonprofit Organization KIPP Heartwood Academy Middle School Jenny Aquino, Realtor Real Estate Agent UC LEADS Science, Technology & Engineering Everest Public High School High School Sunrise Middle School Public School KIPP San Jose Collegiate School DCP Alum Rock Middle School Middle School UCI Blum Center for Poverty Alleviation Education Summit Olympus High School DCP Alum Rock High School High School Valle Vista Elementary - San Jose Education Summit Public School: Tahoma High School Larson Communications Education See More triangle-down Pages Liked by This Page Prepared Parents Next Door Solutions to Domestic Violence The Women's Building of San Francisco Places San Jose, California Campus Building Summit Public School: Rainier English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 Photos See All Videos 6 5 Rainier seniors celebrate getting into college!! 5 3 Choose Summit Rainier 7 See All Posts Summit Public School: Rainier May 21, 2019  ·  Congratulations! Rainier is of the best high schools in San Jose and in the country, receiving a gold medal each from   U.S. News and World Report . Read the coverage from  El Observador  here! Two San Jose high schools, Summit Public School: Tahoma and Summit Public School: Rainier, are among those ranked as the best in the nation by U.S. News & World Report. The 2019 U.S. News Best H... el-observador.com Two San Jose High Schools Ranked as Best in the Country Two San Jose high schools, Summit Public School: Tahoma and Summit Public School: Rainier, are among those ranked as the best in the nation by U.S. News & World Report. The 2019 U.S. News Best H... Two San Jose high schools, Summit Public School: Tahoma and Summit Public School: Rainier, are among those ranked as the best in the nation by U.S. News & World Report. The 2019 U.S. News Best H... Summit Public School: Rainier June 5, 2020  ·  CELEBRATING THE CLASS OF 2020! This year has been full of challenges and surprises. Our seniors met their goals and challenges head on, and have persevered. They have the knowledge and skills required to take their next big life step.WE ARE SO PROUD OF THEM ALL! Please join us in celebrating our seniors! Make some noise people! #SummitSeniors #SummitStrong #SummitRainier  ¡CELEBRANDO LA CLASE DE 2020! Este año ha estado lleno de desafíos y sorpresas. Nuestros adultos mayores cumplieron sus objetivos y desafíos de frente, y han perseverado. Tienen el conocimiento y las habilidades necesarias para dar el siguiente gran paso en su vida. ¡ESTAMOS ORGULLOSOS DE TODOS! ¡Únase a nosotros para celebrar a nuestros mayores! ¡Haz ruido a la gente!  # SummitSeniors   # SummitStrong   # SummitRainier See All See More \n \n \n"
}