{
    "docno": "RJP584",
    "url": "https://www.facebook.com/studentdesigncenter/?ref=py_c",
    "text": "\n Student Design Center - Home | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home About Photos Events Videos Reviews Posts Community See more of Student Design Center on Facebook Log In or Create New Account See more of Student Design Center on Facebook Log In Forgot account? or Create New Account Not Now Student Design Center Graphic Designer in Riverside, California Closed Now Community See All 118 people like this 124 people follow this 2 check-ins About See All 900 University Ave (73.94 mi)  Riverside, CA, CA 92521 Get Directions ucrhub.wufoo.com/forms/zdfl3pt0sqson0 Graphic Designer  ·  Interior Design Studio Price Range $ Opens Monday Closed Now Page Transparency See More Facebook is showing information to help you better understand the purpose of a Page. See actions taken by the people who manage and post content. Page created - October 2, 2015 People 118  likes 2   visits Related Pages Bourns Science and Engineering Day Event UC Riverside International Affairs College & University Humans of UC Riverside Arts & Humanities Website BCOE Advising College & University UCR ECE Day Science, Technology & Engineering Riverside Health Connect College & University Cutie Hack Interest Zeta Phi Rho, Kappa Chapter Organization Kindling Intellectual Development (KID) Program Nonprofit Organization Maty's Cleaning Service- Northwest Arkansas Cleaning Service Johara Studio Digital Creator Katherine L. D. Wallin Designs Graphic Designer UCR Resistance to Mass Incarceration Community Organization tidbit Graphic Designer 42 Printing Inc. Printing Service UCR CARA College & University Victory Road Organization Couey Creative Professional Service UC Merced AIAA Student Chapter Page College & University UCSB Weightlifting School Sports Team See More triangle-down Places Riverside, California Home Improvement Interior Design Studio Student Design Center English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 Photos See All Videos Learn The Basics of Video Editing See All See More \n \n \n"
}