{
    "docno": "RJP587",
    "url": "https://www.facebook.com/UCRUCDC/?ref=py_c",
    "text": "\n UCR UCDC Academic Internship Program - Home | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home About Photos Reviews Videos Posts Events Community See more of UCR UCDC Academic Internship Program on Facebook Log In or Create New Account See more of UCR UCDC Academic Internship Program on Facebook Log In Forgot account? or Create New Account Not Now UCR UCDC Academic Internship Program College & University in Riverside, California Closed Now Community See All 498 people like this 522 people follow this 4 check-ins About See All 1100 A Hinderaker Hall (71.99 mi)  Riverside, CA, CA 92521 Get Directions www.ucdc.ucr.edu College & University  ·  School Opens Monday Closed Now Page Transparency See More Facebook is showing information to help you better understand the purpose of a Page. See actions taken by the people who manage and post content. Page created - November 9, 2010 People 498  likes 4   visits Related Pages Humans of UC Riverside Arts & Humanities Website Undocumented Student Programs at UCR Education ASUCR External Affairs Political Organization Arturo Gomez Personal Blog CALPIRG at UCR Public & Government Service Spoiled Minds Media/News Company Brophy Office of E&I Education Website CAUSA College & University Forever Buffs Los Angeles: University of Colorado Boulder Alumni Organization Hylander Financial Group Mortgage Brokers Martin Financial Group Financial Planner Assemble All Install Home Improvement Jan Ouwens Website UCR Women's Resource Center College & University Gamma Beta Phi Honor Society at UCR Nonprofit Organization Sterling Wealth Partners Financial Consultant Chicano Student Programs Cultural Center TEDxUCR Nonprofit Organization Fraternity and Sorority Involvement Center at UCR Sorority & Fraternity UCR Tomás Rivera Library College & University See More triangle-down Pages Liked by This Page Washington Internship Institute Georgetown, Washington, D.C. College Democrats at UCR UC Riverside - Education Abroad UCR University Extension UCR UC Sacramento UC Riverside Community Garden UCR ARC UCR Undergraduate School of Business SUNY Brockport Washington Internship Program UC Center Sacramento UCR Anthropology UCR School of Public Policy Capitol Washington Dc RISE - Regional Internships in Science & Engineering Washington D.C. Temple Visitors' Center UCR Preventive Care DC Mayor's Centralized College Internship Program Capitol Hill, Washington, D.C. UCR Alumni Association See More triangle-down Places Riverside, California UCR UCDC Academic Internship Program English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 Photos See All Videos Winter 2018 Ariya Haghighat Video 2 Matthew Yamamoto - UCDC Intern Fall 2015 2 Andrew Sall - Fall UCDC Participant 8 See All Posts UCR UCDC Academic Internship Program August 12, 2020  ·  Worried about getting an internship during this global pandemic?  Have no fear because UCDC is (remotely) here!  We are happy to announce a remote option for UCDC as a way to gain experience in federal agencies, nonprofit organizations, and advocacy groups from the comfort of your own home. The Winter 2021 application deadline will be September 1st. Please visit our website (link in bio) for more information.   # ucdc   # ucr   # firstgen   # engageucr UCR UCDC Academic Internship Program June 11, 2020  ·  We have an informational interview with one of the 1st remote participants for the UCCS program. Wendy Rincon is a 3rd year Bioengineering major, recipient of the Health Justice Scholarship, and an intern for the CCST (California Council on Science and Technology). She gives us some insight on the first virtual UCCS quarter ever. She gives some advice on managing an internship and school, how she applied, program expectations, and her own experience with her internship in how it has benefited her and much more. To view this informational interview, visit  ucdc.ucr.edu  or click this link:  http://ow.ly/NQS850A5y0u See All See More \n \n \n"
}