{
    "docno": "RJP55",
    "url": "https://www.universityofcalifornia.edu/infocenter/fall-enrollment-glance",
    "text": "\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Fall enrollment at a glance | University of California \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Skip to Main Content \n \n \n University of California \n Return to home page \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n News All News Research \n Health \n Arts & Humanities \n Students & Alumni \n Faculty & Staff \n Administration \n Global Food Initiative \n \n Video \n In the News \n Press Room \n \n More \n \n \n \n \n \n \n \n \n \n\t\t\tUC statement on Gov. Newsom’s 2021-22 revised budget\t\t \n \n The University of California is deeply grateful to Gov. Newsom for proposing the largest state investment in UC’s history: more than $807 million, which includes more than $506 million in ongoing funding for core campus operations, student needs and medical training. The budget, with the support of legislative leadership, reflects an earlier agreement to fully restore more than $300 million in budget reductions that were enacted in the 2020 state budget. \n \n \n \n \n \n \n \n \n \n \n More \n \n \n \n \n \n     \n \n \n \n @UofCalifornia \n \n \n . @ucriverside  historian Jorge Leal has taken a furtive step into documenting the Latinx community’s emerging L.A. f…  https://t.co/3GVXgmYXtB   \n \n \n   \n \n \n \n \n \n \n Priorities Spotlight Double the Pell \n Defending DACA recipients \n Civic Engagement \n Climate Lab \n Fig. 1 \n FirstGen \n Innovation and Entrepreneurship \n Student Opportunity \n Transfer Students \n \n Systemwide Programs UC-HBCU Initiative Programs \n President's Postdoctoral Fellowship Program \n \n Presidential Initiatives Carbon Neutrality Initiative \n Global Food Initiative \n Smoke and Tobacco-Free Student Fellowships \n UC-Mexico Initiative \n UC National Center for Free Speech and Civic Engagement \n Undocumented Students Initiative \n \n \n UC System Overview \n Parts of UC \n Stewardship \n Working at UC \n Leadership Academic Senate \n Board of Regents \n \n Information Center \n \n Support UC Advocate About the UC Advocacy Network \n UCAN Student Ambassadors \n Federal Budget \n State Budget \n Research Funding \n Enrollment \n Education \n Campus Housing \n Health Care \n Student & Faculty Diversity \n \n Donate \n Connect Alumni Career Network \n \n \n More \n \n \n \n \n \n \n  Become a UC Advocate \n \n Receive email alerts about issues that are important to UC and contact your legislators to ensure the university remains a hub of opportunity, excellence, and innovation. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n \n \n \n \n \n \n \n Admissions \n Jobs \n Contact \n \n \n \n \n \n \n Facebook \n Twitter \n Tumblr \n \n \n \n \n \n \n \n \n \n \n \n \n \n You are here UC System Infocenter Fall enrollment at a glance   \n Fall enrollment at a glance \n \n \n \n \n \n \n \n \n \n     \n \n \n \n \n Broad Discipline  – Groups that categorize areas of study into architecture, arts and humanities, business, education, engineering and computer science, law, life sciences, medicine, other health sciences, multiple majors, interdisciplinary, physical sciences, social sciences and undeclared. \n Enrollment Status  – Status of student at the end of fall 3wk classes — new (N) or continuing (C). \n Undergraduate  – A student that enrolls in a degree program after post-secondary education (high school) or after a two-year enrollment at a community college. The term encompasses freshmen through senior college students. \n Academic Doctoral  – Programs at the University of California that are offering doctoral degrees that are designated as academic. \n Academic Masters  – Programs at the University of California that are offering masters degrees that are designated as academic. \n Graduate Professional  – Programs at the University of California that are offering degrees that are designated as professional. These programs very often lead to clinical practice – MD, DDS e.g. \n Graduate Self-supporting Programs  - Some UC graduate professional programs, primarily master’s programs, follow a self-supporting funding model. These programs receive no state support and are funded entirely by revenues generated by the program and other non-state revenues. Many self-supporting programs serve nontraditional populations such as full-time employees, mid-career professionals, international students with specialized goals and students whose education is supported by their employers. \n Health Science Resident  – Individuals completing the residency portion of their health science professional degree (e.g., Medicine, Pharmacy, Optometry) \n CA Resident  - Students who are eligible for California resident tuition and fees. \n Non-Resident Domestic  - Nonresident students who come from outside California but within the United States to attend a UC campus. They must meet higher admissions criteria and pay Non-resident Supplemental Tuition in addition to in-state charges. \n Non-Resident International  - Nonresident students who come from outside the United States to attend a UC campus. They must meet higher admissions criteria and pay Non-resident Supplemental Tuition in addition to in-state charges. \n Other/Unknown  - Students in self-supporting programs, medical residents, and students whose residency is not known \n \n This page is best viewed in  Chrome  and  Firefox  browsers. \n Instructions on how to download this data .\n\t\t\t\t Please  send us any feedback or suggestions , or to let us know something isn’t working.\n\t\t\t \n \n \n \n \n\n\tNotes\n \n CA residency data for graduate students in the most recent year is preliminary and excludes some categories of residency not yet reflected in UCOP data. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Subscribe to Our Newsletter \n Email Address   \n \n \n \n \n \n Subscribe \n \n \n \n \n \n \n \n \n Office of the President \n Academic Senate \n Board of Regents \n   \n \n Accessibility \n Terms of Use \n   \n \n Facebook \n Twitter \n Tumblr \n   \n Copyright © The Regents of the University of California \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n × Close \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n"
}