{
    "docno": "RJP590",
    "url": "https://www.facebook.com/UCRCNAS/?ref=py_c",
    "text": "\n UCR College of Natural and Agricultural Sciences (CNAS) - Home | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home Posts Photos Videos Reviews About Community Social Channels Events See more of UCR College of Natural and Agricultural Sciences (CNAS) on Facebook Log In or Create New Account See more of UCR College of Natural and Agricultural Sciences (CNAS) on Facebook Log In Forgot account? or Create New Account Not Now UCR College of Natural and Agricultural Sciences (CNAS) College & University in Riverside, California Closed Now Community See All 747 people like this 836 people follow this 6 check-ins About See All 900 University Ave (73.81 mi)  Riverside, CA, CA 92521 Get Directions cnas.ucr.edu/contact College & University Opens Monday Closed Now Page Transparency See More Facebook is showing information to help you better understand the purpose of a Page. See actions taken by the people who manage and post content. Page created - October 22, 2012 People 747  likes 6   visits Related Pages UC Riverside International Affairs College & University Humans of UC Riverside Arts & Humanities Website UCR Financial Wellness Program Education UCR School Psychology Program Campus Building Exploring Your Universe at UCLA Education Website Bruin Spacecraft Group at UCLA Aerospace Company Summit Public School: Rainier High School Streaming, Sharing, Stealing: Big Data and the Future of Entertainment Book Post March Salon - PMS Community Organization Southern California Section of the American Chemical Society Nonprofit Organization Shadow M.D. Medical Service UC San Diego NanoEngineering Department Educational Research Center Engineers for a Sustainable World - UC San Diego Interest Development Engineering Master Education Website Untethered Event UCR Orbach Science Library Library University of Michigan Middle East Studies College & University Cerritos College Art Gallery College & University UCR ARC Tutor/Teacher Mini Medical School at UCR School See More triangle-down Pages Liked by This Page California Agriculture and Food Enterprise - CAFÉ UCR Urban Pest Management Conference - UCR UPMC UCR Neuroscience Graduate Program Places Riverside, California UCR College of Natural and Agricultural Sciences (CNAS) English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 Posts UCR College of Natural and Agricultural Sciences (CNAS) June 9 at 5:34 PM  ·  Join us for the  UCR College of Natural and Agricultural Sciences (CNAS)  Graduation Celebration on Saturday, June 12 at 2p... Honoring the CNAS  # Classof2021 !!!   CNAS graduating students— check your email for the Zoom registration link. Family, friends, and loved ones can watch on  http://youtube.com/UCRCNAS   # CNASgrad  FMI visit  https://cnas.ucr.edu/graduation UCR College of Natural and Agricultural Sciences (CNAS) 5 mins  ·  The UC Riverside College of Natural and Agricultural Sciences Virtual Commencement Ceremony begins at 6 p.m. today... Here's the link to watch... See you there!!!  # CNASgrad  @UCRCNAS    https://www.youtube.com/watch?v=z9JYfGfaYI4 2021 UCR Virtual Commencement Ceremony - College of Natural and Agricultural Sciences youtube.com 2021 UCR Virtual Commencement Ceremony - College of Natural and Agricultural Sciences 2021 UCR Virtual Commencement Ceremony - College of Natural and Agricultural Sciences 2021 UCR Virtual Commencement Ceremony - College of Natural and Agricultural Sciences See All Photos See All Videos Calling all UCR Alumni and University Extension Grads! 1 1 See All See More \n \n \n"
}