{
    "docno": "RJP594",
    "url": "https://www.facebook.com/UCLEADSprogram/?ref=py_c",
    "text": "\n UC LEADS - Home | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home Posts Reviews Videos Photos About Community See more of UC LEADS on Facebook Log In or Create New Account See more of UC LEADS on Facebook Log In Forgot account? or Create New Account Not Now UC LEADS Science, Technology & Engineering  Community See All 207 people like this 225 people follow this About See All ucleads.ucop.edu Science, Technology & Engineering Page Transparency See More Facebook is showing information to help you better understand the purpose of a Page. See actions taken by the people who manage and post content. Page created - January 30, 2018 People 207  likes Related Pages UCSC SACNAS Chapter Nonprofit Organization Emily Henderson - My Just Right Life Blogger SOLES at UCLA Nonprofit Organization Center for Urban Education Nonprofit Organization UC Graduate and Professional Council Government Organization BASED Political Organization UCSD Biomedical Sciences College & University UC Merced UROC Local Business Terry Freitas Café Cafe SACNAS @ UC Davis Nonprofit Organization UC San Diego Department of Anthropology School CaHPSA Berkeley Community Organization Gaucho Tour Association College & University SACNAS-UCLA Chapter College & University Undergraduate Research & Creative Activities at UCSB Educational Research Center UCLA Psychology Undergraduate Research Conference Education The Astronomy Club at UCI College & University Graduate Students for Diversity in Science College & University UCSC Muslim Students Association Community Organization UCSB ONDAS Center College & University See More triangle-down Pages Businesses Science, Technology & Engineering UC LEADS English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 Posts UC LEADS May 18 at 8:48 AM  ·  Congratulations UC LEADS Scholar Jose Magana on your acceptance to the  UC Berkeley  earthquake and geotechnical engineering graduate program. Such a story of leadership.  https://news.berkeley.edu/…/im-a-berkeleyan-jose-magana-on…/ Graduating Berkeley CalNerds scholar was uprooted from his life in El Salvador and forced to flee his country as an undocumented refugee news.berkeley.edu I’m a Berkeleyan: Jose Magana on having faith in your journey, despite the turmoil Graduating Berkeley CalNerds scholar was uprooted from his life in El Salvador and forced to flee his country as an undocumented refugee Graduating Berkeley CalNerds scholar was uprooted from his life in El Salvador and forced to flee his country as an undocumented refugee UC LEADS April 27  ·  UC LEADS alumna Jessica Lopez Lara is such a wonderful role model. Check out this IGTV from  UC Merced   https://www.instagram.com/tv/CN8j2dLD8ym/… Instagram Jessica Lopez Lara is a UC Merced alum who graduated in May 2020. She is currently pursuing her Ph.D. in chemistry at UC Santa Barbara. She is a University of California Leadership Excellence through Advanced Degrees (UC LEADS) scholar who conducted research with Professor Benjamin Stokes. ⁣\n⁣\nJessica is passionate about representing women in science, technology, engineering, and math (STEM). She hosted a female empowerment conference at UC Merced to motivate college students as well as K-12 girls to pursue STEM.⁣\n⁣\n#WeAreUCMerced #UCMerced See All Videos Anoop Praturu UC LEADS Scholar Spotlight 7 2 UC LEADS Scholar Spotlight, Chance Ornelas-Skarin, UC Irvine 7 Looking forward to seeing you tomorrow at the 2018 Symposium! 10 See All Photos See All See More \n \n \n"
}