{
    "docno": "RJP593",
    "url": "https://www.facebook.com/ucrethnicstudies/?ref=py_c",
    "text": "\n UC Riverside Ethnic Studies - Home | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home About Photos Events Posts Community See more of UC Riverside Ethnic Studies on Facebook Log In or Create New Account See more of UC Riverside Ethnic Studies on Facebook Log In Forgot account? or Create New Account Not Now UC Riverside Ethnic Studies Education  Community See All 403 people like this 419 people follow this About See All www.ethnicstudies.ucr.edu Education Page Transparency See More Facebook is showing information to help you better understand the purpose of a Page. See actions taken by the people who manage and post content. Page created - September 25, 2016 People 403  likes Related Pages Undocumented Student Programs at UCR Education UCR Latino and Latin American Studies Research Center College & University Mecha De UC Riverside Organization UC Riverside Student Workers Union UAW Local 2865 Political Organization Ballet Folklórico De UC Riverside School UC Riverside International Affairs College & University Arturo Gomez Personal Blog UCR Resistance to Mass Incarceration Community Organization Vegan Moni Vegetarian/Vegan Restaurant Neighborhood Church Social Justice Religious Center USC Marshall Brittingham Social Enterprise Lab College & University LatinX Caucus at UCLA Luskin Social Club UC Riverside Media and Cultural Studies Department College & University UC Berkeley Ethnic Studies Library Library Los Angeles Archivists Collective Community Organization N.A.C.C.S. Southern California Foco Education Gender and Sexuality Studies Department, UC Riverside College & University Chicano Student Programs Cultural Center UCSD CALPIRG Political Organization UCR Women's Resource Center College & University See More triangle-down Pages Businesses Education UC Riverside Ethnic Studies English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 Photos See All Posts UC Riverside Ethnic Studies May 31 at 7:43 PM  ·  Day 1: Analysis Panel Tuesday 12pm - 1pm  Register at  tinyurl.com/ucpalestine1  Day 1’s panel will focus on the history of Palestine, the connection of recent events in Sheikh Jarrah to the history of dispossession and occupation in Palestine, and the legal and political implications of US involvement. ...  Faculty Panelists: Samera Esmeir (UC Berkeley), Mark Levine (UC Irvine), Baki Tezcan (UC Davis)  Moderators: Doaa Dorgham (UC Berkeley South, Southwest Asian, and North African Initiative), Ali Saadat (UC Riverside Middle Eastern Student Center)  Day 2: Action Panel Wednesday 12pm - 1pm  Register at  tinyurl.com/ucpalestine2  Day 2’s panel will focus on the challenges around navigating censorship, lack of Palestinian advocacy, and share techniques to sustain activism against oppression.  Faculty Panelists: Esmat Elhalaby (UC Davis), Lisa Rofel (UC Santa Cruz), David Lloyd (UC Riverside), Sunaina Maira (UC Davis)  Moderators: Affaf Waseem (UC Davis Middle Eastern, North African, & South Asian Student Resources), Omar Aziz (UC Riverside Middle Eastern Student Center)  Day 3: Community Healing Space Thursday 12pm - 1pm  Register at  tinyurl.com/ucpalestine3  Day 3 of the week-long series, Perspectives on Palestine, will be a processing space to explore how recent events are affecting the Palestinian student community and its community of solidarity.   See More UC Riverside Ethnic Studies May 18 at 12:02 PM  ·  Why is Palestine a Feminist Issue? A conversation with members of the Palestinian Feminist Collective. It looks like you may be having problems playing this video. If so, please try restarting your browser. Close FB Live with the Members of the Palestinian Feminist Collective: Why is Palestine a Feminist Issue? Posted by  Palestinian Feminist Collective 2,451 Views 2,451 Views Palestinian Feminist Collective  was live. April 10 Why is Palestine a Feminist Issue? A conversation with members of the Palestinian Feminist Collective:  Dr. Nada Elia, a Diaspora Palestinian from Jerusalem, she ...  writes about Palestinian and transnational feminisms, gendered state violence, and organizing for social and political liberation. Nada is a former member of the organizing collective of INCITE! Women and Trans People of Color against Violence, as well as of the Steering Collective of AWSA (Arab Women's Solidarity Association).  Dr. Hana Masri, a steering member of the Palestinian Feminist Collective and a feminist scholar of communication and rhetoric.  Yazan Za3za3, a steering member of PFC and a longtime organizer with the Palestinian Youth Movement. Yazan is also the current Community Organizer at Vigilant Love, a healing justice organization committed to challenging the structural and communal impacts of Islamophobia and the War on Terror at large. Yazan holds an MA in Women's and Gender Studies from San Diego State University. Their own research focuses on the relationship between war, migration, surveillance, and social welfare programming.  The conversation was facilitated by Mira Nabulsi, a researcher and audio producer based in the San Francisco Bay Area.   See More See All See More \n \n \n"
}