{
    "docno": "RJP546",
    "url": "https://pay.facebook.com/",
    "text": "\n Facebook Pay: Simple, Secure, Free Payments \n \n \n \n \n \n \n \n Home Using Facebook Pay Getting Started Security & Protection FAQ Facebook Pay is an easy, secure way to pay in more places than ever Help Build Our Skatepark Fundraiser by Eleanora  $15,880  raised of  $18,000  Donate  Use it to send money, shop or donate on the apps you already use  Now available in the US Facebook Pay is available in the US on  Facebook ,  Messenger ,  Instagram , and  Portal . It’s rolling out soon to more apps in countries around the world.  Not in the US?  Check Availability Facebook Pay on Facebook Learn More $30 Send seller a message Hello, is this still available? Send  $1440   $1600   See it, buy it  Make purchases from your favorite brands available on Facebook Shop or buy unique items from the people in your community on Marketplace.  Show you care  When a fundraiser captures your attention, contribute to its success with Facebook Pay.  Share experiences  Purchase games and tickets to live events, and get access to entertainment on Facebook Watch. Use Facebook Pay seamlessly between Facebook and Instagram Add your preferred payment method just once on Facebook, then connect Facebook Pay to other apps you love. Facebook Pay on Instagram Learn More Donate  Shop the latest  When a brand or creator posts something you love, buy it without leaving the Instagram app.  Show you care  Donation stickers can be used for fundraising within Instagram Stories. If you see a cause that speaks to you, contribute using Facebook Pay. Facebook Pay on Messenger Learn More The beach trip was fun! How much do I owe you for gas? Hi! How about $15? Cool, I can pay you here. $ 15 Request Pay  Send money while you chat  Transfer money to friends and family as easily as sending a message, with no fees and without interrupting your conversation. Facebook Pay on Portal Learn More  Purchase Portal products  Portal’s family of smart video calling devices can be purchased using Facebook Pay. Use Facebook Pay for a seamless checkout when you purchase Portal’s family of smart video calling devices. Getting started is easy Learn More Home Using Facebook Pay On Facebook On Messenger On Instagram On Portal Getting Started Security & Protection FAQs United States Data Policy Facebook Community Payments Terms Privacy Policy Facebook Payments Privacy Policy Sitemap \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n"
}