{
    "docno": "RJP53",
    "url": "https://csp.ucr.edu/",
    "text": "\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Chicano Student Programs | UC Riverside \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Due to the impact of COVID-19, our Ethnic & Gender campus locations are closed until further notice. Our staff is working remotely and available to support you along your Highlander journey. We look forward to being back on campus and supporting you in-person. Please continue to wash your hands, wear a face covering, and maintain physical distance. \n \n × \n \n \n \n \n \n \n \n \n \n \n \n \n \n Skip to main content \n \n University of California, Riverside \n \n \n \n \n \n \n A to Z Listing \n \n \n Campus Map \n \n \n Find People \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n UC Riverside \n \n \n \n \n  Chicano Student Programs  \n \n \n \n MÁS DE 45 AÑOS DE FAMILIA, ORGULLO Y CORAZÓN \n \n \n \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n Home \n \n \n Programs and Services \n \n \n SCHOLARSHIPS & INTERNSHIPS \n \n \n Awards & Honors \n \n \n MUNDO CHICANO/LATINO THEME HALL \n \n \n AB 540 RESOURCE GUIDE \n \n \n \n \n Get Involved \n \n \n Student Organizations \n \n \n Outreach \n \n \n Chicano Link Peer Mentor Program  \n \n \n \n \n Alumni \n \n \n Giving to CSP \n \n \n \n \n Events \n \n \n CÉSAR E. CHÁVEZ 5K RUN/WALK  \n \n \n Radio Aztlan \n \n \n Raza Grad 2021 \n \n \n \n \n Contact Us \n \n \n Contact CSP \n \n \n Applications and Forms \n \n \n Common Ground Partners \n \n \n \n \n \n \n \n \n \n \n A to Z Listing \n \n \n Campus Map \n \n \n Find People \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Chicano Student Programs \n \n \n \n \n \n \n \n \n \n \n \n \n \n Breadcrumb \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Previous Next \n \n \n \n \n \n \n \n \n Bienvenidos a nuestra familia de UCR! \n We celebrate the traditions of Chicano/Latino culture while sharing the spirit of La Raza with our campus and community. To our Chicano/Latino students, we are one big familia, and like a family, we fully support your academic, cultural, and social success. \n If you ask our students about Chicano Student Programs, the first thing they will tell you is that we are one big family. Our caring  staff  supports UCR’s Chicano/Latino community with incredible programs and resources. Our  faculty’s  research and experiences speak to issues about La Raza, and provide priceless networking and mentorship opportunities. Our shared goals and values make the  Common Ground Collective  a strong branch of our family tree. Our  student organizations  are some of our most inspirational family members. Contact us any time. You are part of our family, too. \n   \n \n \n \n \n \n \n \n \n \n \n \n Student Affairs \n COVID-19 Resources for Student Health and Safety \n Learn More \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Contact Us \n Chicano Student Programs \nUniversity of California, Riverside \n145 Costo Hall, Riverside, CA 92521 Main Phone:  951-827-3821 Our Staff \n Office Hours: M-F 8 a.m. - 5 p.m. \n(Office hours subject to change) Campus Map Directions to UC Riverside \n \n \n \n \n \n \n \n \n \n Our Mission \n Read  our mission statement  and learn more about our goals and commitments. We also invite you to read  the collective mission  of all of the ethnic and gender programs. \n SUPPORT \n We create a positive environment for Chicano/Latino students at UCR by offering supportive  services and programs  that encourage academic success and retention. We provide service referral when necessary, and serve as a resource for advocacy as well. \n SHARE \n We educate our campus and community about Chicano/Latino culture through our exciting  events , active  student organizations , and rewarding  outreach programs . \n CONNECT \n We collaborate with other  UCR departments with shared goals ; encourage  faculty and staff  mentorship; reach out to our local community; and maintain a helpful campus, community and  alumni network  that help our students grow. \n INSPIRE \n Our outstanding  faculty ,  staff , and  students  inspire future members of  our familia  and demonstrate true orgullo y corazón. \n \n \n \n \n \n \n \n \n \n Here for You, Always \n Student Affairs is here to support you throughout the campus closure. \n Connect \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Events \n \n See Events Calendar \n \n \n \n \n \n \n \n \n \n The Origins of Chicano Student Programs \n Former Staff and Directors \n \n \n \n \n \n   \n The Origins of Chicano Student Programs \n   \n The office first started on the second floor of UCR’s Library South, adjacent to the “El Centro” meeting room, across the hall from the Chicano Studies Department and the offices of EOP/SAA Support Services. As the population of Raza students continued to grow, CSP was relocated to a more visible space in the “Commons Area.” Due to renovations to this space, CSP was housed in trailers in parking lot 19 until it was moved to Costo Hall. The office is now located in 145 Costo Hall, which offers more space for offices, student meeting rooms and the planning and execution of our events.  \n While the location of CSP has varied over the years, the mural representing the history of Raza students and CSP still remains part of the office. The wall-length mural was created by local artist Chano Gonzalez, and funded by a National Council of the Arts grant in 1975. During the first relocation of the office, the mural was threatened to be white-washed. However, student, faculty, and staff protests ensured the security of the artwork. The remaining 10 panels are now displayed at CSP’s current location. \n \n \n   \n Former Staff and Directors \n \n The program was founded by a committee that included faculty members organizing around the needs of Raza faculty and students at UCR. Dr. Eugene Cota-Robles was a microbiologist and the department chair of Chicano Studies at the time. Dr. Carlos Cortés was a historian and Chicano studies professor. Alberto Richard Chavez was the assistant dean of student services. \n With the support of many students, staff and community members, the committee was able to advocate for a “home away from home” for Chicano students at the UCR campus. \n Alberto R. Chavez served as director of Chicano Student Programs for 15 years. In 1986, he was succeeded by Rebecca Chavez, who held the position for one year. Robert Nava was appointed to serve as director in 1989. Alfredo Figueroa, currently an assistant dean at UCR, served as director for another 15 years. During a one-year interim period in the early eighties, UCR alumnus Raymond Navarro also served as program director. In 2004, after having worked as CSP’s student assistant, senior clerk and social/cultural programmer Estella Acuña became CSP’s present director.  \n Support staff has included Aurora Gonzalez, Armida Amaya, Estela Figueroa, Jacalyn López Garcia, Lydia Enriquez, Nora Cornejo and currently John Valdez. The social/cultural programmer position, created in 1988, has been held by Josefina Canchola, Carolyn Sandoval, Veronica O.Hernandez, Elena Perez and now Arlene Cano. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n University of California, Riverside \n \n 900 University Ave. \n            Riverside, CA 92521 \n Tel: (951) 827-1012 \n \n \n UCR Library \n Campus Status \n Campus Store \n Career Opportunities \n Diversity \n Maps and Directions \n Visit UCR \n \n \n \n \n \n \n \n \n Chicano Student Programs \n \n               145 Costo Hall\n             Riverside, CA 92521                          \n  tel: (951) 827-3821                         email:  estella.acuna@ucr.edu   \n \n \n  Find Us \n \n \n \n \n Follow US: \n \n Facebook \n Csp_UCR \n \n \n \n \n \n Related Links \n \n \n African Student Programs \n \n Asian Pacific Student Programs \n \n Chicano Student Programs \n \n LGBT Resource Center \n \n Native American Student Programs \n \n Middle Eastern Student Center \n \n Undocumented Student Programs \n \n Women's Resource Center \n \n \n \n \n \n \n \n \n \n \n \n \n \n Privacy Policy \n Terms and Conditions \n © 2021 Regents of the University of California \n \n \n \n \n \n \n \n \n \n \n × \n \n \n \n \n \n \n Let us help you with your search \n \n \n Enter your Search Criteria. \n \n \n \n Search \n \n \n Cancel \n \n \n \n \n \n \n \n \n \n \n \n \n"
}