{
    "docno": "RJP544",
    "url": "https://www.facebook.com/directory/places",
    "text": "\n Places Directory \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Sign Up Browse Places Check out our new and improved places directory. Places allows you to see where your friends are and share your location in the real world. When you use Places, you'll be able to see if any of your friends are currently checked in nearby and connect with them easily. You can check into nearby Places to tell your friends where you are, tag your friends in the Places you visit, and view comments your friends have made about the Places you visit. Use Places to experience connecting with people on Facebook in a completely new way. \n People Pages Places A B C D E F G H I J K L M N O P Q R S T U V W X Y Z @ Places with Most Check-ins London, United Kingdom City Places to visit in London, United Kingdom New York, New York City Things to do in New York, New York Paris, France City Places to go in Paris, France Bangkok, Thailand City Things to do in Bangkok, Thailand Barcelona, Spain City Things to do in Barcelona, Spain São Paulo, Brazil City Things to do in São Paulo, Brazil Las Vegas, Nevada City Las Vegas, Nevada attractions Rome, Italy City Places to visit in Rome, Italy Dubai, United Arab Emirates City Dubai, United Arab Emirates attractions Rio de Janeiro, Rio de Janeiro City Attractions in Rio de Janeiro, Rio de Janeiro Hong Kong Country/Region Places to visit in Hong Kong Los Angeles, California City Places near Los Angeles, California Chicago, Illinois City Attractions in Chicago, Illinois Bogotá, Colombia City Bogotá, Colombia attractions Singapore Country/Region Places to visit in Singapore Madrid, Spain City Places to visit in Madrid, Spain Istanbul, Turkey City Places near Istanbul, Turkey San Francisco, California City Attractions in San Francisco, California Berlin, Germany Region Places to visit in Berlin, Germany Amsterdam, Netherlands City Places near Amsterdam, Netherlands English (US) Español Français (France) 中文(简体) العربية Português (Brasil) 한국어 Italiano Deutsch हिन्दी 日本語 Sign Up Log In Messenger Facebook Lite  Watch  People Pages Page Categories Places Games Locations Marketplace Facebook Pay Groups Jobs Oculus Portal Instagram Local Fundraisers Services Voting Information Center About Create Ad Create Page Developers Careers Privacy Cookies Ad Choices Terms Help Settings Activity Log  Facebook © 2021 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n"
}