{
    "docno": "RJP54",
    "url": "https://diversity.universityofcalifornia.edu/policies-guidelines/covid-19.html",
    "text": "\n \n \n \n \n \n \n \n \n \n \n\n\nEquity and Inclusion During COVID-19\n| UC Diversity \n \n \n \n \n \n \n \n \n \n \n \n \n \n Skip to content \n \n \n \n \n \n Toggle navigation       \n   \n Home \n \n Programs \n \n Kâ\u0080\u009312 and community college students \n Advisory Groups \n Undergraduate students \n Graduate students \n Faculty and other academic personnel \n Staff diversity \n \n \n \n Events \n \n UCBAC Conference \n UC Chicanx/Latinx Leadership Summit \n UC First-Generation Virtual Symposium \n Webinars \n \n \n \n Policies \n \n Coronavirus (COVID-19) \n Campus Climate \n \n \n Reports \n \n Anti-Racism Resources \n \n Anti-Asian racism \n Anti-Black racism \n Additional anti-racism resources \n \n \n Contact \n \n \n \n \n \n Home \n > \n Policies \n > \n                        \n                                                \n            \n                    Coronavirus (COVID-19)\n        \n       \n \n Equity and Inclusion During COVID-19 \n This guidance document has been prepared by the Council of Chief Diversity Officers at the University of California to assist campus decision makers, faculty, administrators, students and staff on providing supportive positive and inclusive campus climates during the COVID-19 crisis. \n \n Reject racism, sexism, xenophobia and all hateful or intolerant speech, both in person and online. Be an \"up-stander,\" and discourage others from engaging in such behavior. \n Address unequal access to technology, hardware and software. Ask students about their level of access to technology. Use that information to inform the technology choices for your courses. For employees, consider offering loaner laptops or assisting with access to internet service. \n Ensure web accessibility for students with disabilities when using online learning or remote instruction. See this   webinar  for more tips. \n Be inclusive and remember that everyone has different circumstances. Continue to treat everyone with respect, both in their presence and in their absence. Do not resort or revert to unkind discussions about people, individuals or groups who may not be in your immediate social circle. \n Advocate for students who have fewer resources. Many students rely on the housing, dining, health care and employment provided on campus. Consider keeping residence and dining halls open and allow for access to campus food pantries, basic needs, health resources and child care centers. \n For student employees and part-time or seasonal employees, explore work assignments that can be performed remotely. If that’s not possible, consider offering paid administrative leave under UC systemwide policy. \n In completing faculty and staff recruitments, try to make the virtual interview process as consistent for all candidates and as similar as possible to to the experience (e.g., if people can ask questions during an in-person job talk, arrangements should be made to permit them to ask questions during a remote job interview). \n Be patient with one another during email, text and video conversations. There can be a tendency to want immediate answers, and typically friendly ways of communicating can break down without deliberate effort to maintain kindness. Try to be as clear as possible in online conversations. Don't assume that broad, sweeping statements will be fully understood. \n Be kind and understanding regarding expectations. Relax requirements that can become impositions, such as demanding business attire for online video meetings or classes, or penalizing participants in online classes for wearing casual attire. Remember that people may be operating without resources and access to many material items and services. Keep the focus on what is most important. \n Build community through virtual coffee/tea hours with colleagues, office-mates, students and faculty. \n Consider offering commencement and recognition events online and/or postposing in-person ceremonies for a later date. Many UC students will be the first in their families to graduate from college, so the physical act of crossing the stage is very important.  \n Do not use terms such as \"Chinese Virus\" or other terms which cast either intentional or unintentional projections of hatred toward Asian communities, and do not allow the use of these terms by others. Refer to the virus as either \"COVID-19\" or \"coronavirus\" in both oral and written communications. \n Support the health care workers who are on the front line of this pandemic. Help ensure that they get the rest they need, can attend to personal and familial needs, and are supported as health care workers and as people. \n \"Flatten the curve\" by attending to the health-related guidelines set forth by federal and local governments. \n Remember to practice self-care! Recognize your own stress, manage yourself before managing others, and make time for your physical and emotional needs. \n \n Download a PDF of the guidelines. \n Resources \n \n Coronavirus: University of California Updates and Resources , Office of the President, University of California \n Rejecting Coronavirus Xenophobia , Office of Diversity, Equity and Inclusion, UC Davis \n COVID-19: What's in a Name , Office of Equity, Diversity and Inclusion, UCLA \n At Our Best: Embodying the Principles of Community , Newsroom, UC Merced \n Inclusivity During Difficult Times , UC Irvine Office of Equity, Diversity and Inclusion, UC Irvine \n Online Learning Research Center , School of Education, UC Irvine \n Inclusion, Equity, and Access While Teaching Remotely , Center for Teaching Excellence, Rice University \n Webinar on Online Education and Website Accessibility , Office of Civil Rights, U.S. Department of Education \n Completing Ongoing Faculty Searches , Office of Academic Personnel, UC Irvine \n \n Council of Chief Diversity Officers, University of California  \n \n Ricardo Alcaino, Director, Equal Opportunity & Discrimination Prevention Office, UC Santa Barbara \n Oscar Dubon, Vice Chancellor for Equity & Inclusion, UC Berkeley \n Douglas Haynes, Vice Chancellor for Inclusive Excellence, UC Irvine \n Jerry Kang, Vice Chancellor for Equity, Diversity and Inclusion, UCLA \n Mariam Lam, Associate Vice Chancellor and Chief Diversity Officer, UC Riverside \n Dania Matos, Associate Chancellor and Chief Diversity Officer, UC Merced \n Renee Navarro, Vice Chancellor of  Diversity and Outreach, UC San Francisco \n Becky Petitt, Vice Chancellor for Equity, Diversity, and Inclusion, UC San Diego \n Teresa Maria Linda Scholz, Interim Associate Vice Chancellor and Chief Diversity Officer, UC Santa Cruz \n Renetta Garrison Tull, Vice Chancellor for Diversity, Equity and Inclusion, UC Davis \n Yvette Gullatt, Vice Provost for Diversity and Engagement, UC Office of the President \n Liz Halimah, Associate Vice Provost for Diversity and Engagement, UC Office the President \n \n Updated 3/18/2020 \n \n \n \n \n \n \n Overview \n \n \n Coronavirus (COVID-19) \n \n \n Campus Climate \n \n \n \n \n \n \n Coronavirus Updates from UC \nThe University of California is vigilantly monitoring and responding to new information about the coronavirus (COVID-19) outbreak.  See the latest news from UC. \n \n \n \n \n \n \n \n UCOP - Graduate, Undergraduate and Equity Affairs \n University of California \n \n \n © Regents of the University of California |  Terms of use \n \n \n \n \n \n \n \n \n \n \n \n"
}