{
    "docno": "RJP555",
    "url": "https://about.facebook.com/",
    "text": "\n About Facebook \n \n \n \n \n \n \n \n \n \n Skip to content Who We Are What We Build Our Actions Our Community Resources Good ideas deserve to be found. Personalized ads help you find them. Watch the Video Personalized ads help small businesses get found. Small businesses rely on personalized ads to reach the people who will love their products and help their business grow. Learn More We build technologies that help people connect with friends and family, find communities, and grow businesses. TOP STORIES Forward With Pride: Celebrating and Elevating LGBTQ+ Voices June 1, 2021 Instagram Giving People More Control on Instagram and Facebook May 26, 2021 Facebook Supporting Vaccination Efforts on Our Apps May 11, 2021 OUR COMMUNITY $5 Billion Raised Together People have now raised over $5 billion for nonprofits and personal causes through fundraisers on Facebook and Instagram. Learn More OUR COMPANY Introducing the new Facebook Reality Labs September 16, 2020 Opening an Office in Lagos, Nigeria September 18, 2020 Muslim Communities Needed Help During COVID. She Had an Answer. May 3, 2021 See More Company Stories FEATURED NEWS Facebook app Introducing Your New Favorite Way to Shop: Live Shopping Fridays May 18, 2021 Facebook Supporting Local Economies Through Investments in Renewable Energy May 20, 2021 Facebook Oversight Board Upholds Facebook’s Decision to Suspend Donald Trump’s Accounts May 5, 2021 Workplace Workplace Reaches 7 Million Paid Subscribers May 4, 2021 See More News Follow us Company Newsroom Company Info Careers For Investors Brand Resources Facebook Policies Community Standards Data Policy Cookie Policy Terms of Service Technologies Facebook app Messenger Instagram WhatsApp Oculus Workplace Portal Novi Help Center Facebook app Help Center Messenger Help Center Instagram Help Center WhatsApp Help Center Oculus Support Workplace Help Center Portal Help Center © 2021 FACEBOOK English (US) English (US) Deutsch Español (España) Español Français (France) 日本語 한국어 Português (Brasil) Bahasa Indonesia Italiano Русский ภาษาไทย Türkçe Tiếng Việt 中文(简体) 中文(香港) 中文(台灣) Čeština Dansk Ελληνικά Suomi Bahasa Melayu Norsk (bokmål) Nederlands Polski Português (Portugal) Svenska Filipino English (UK) Sitemap \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n   \n"
}