{
    "docno": "RJP597",
    "url": "https://www.facebook.com/Iranian.Students.CA/posts",
    "text": "\n Iranian Students of California - Posts | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home Posts Events Reviews Live Videos Photos About Community See more of Iranian Students of California on Facebook Log In or Create New Account See more of Iranian Students of California on Facebook Log In Forgot account? or Create New Account Not Now English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 Iranian Students of California April 2  ·  Come ane see the last day of our festival with our amazing guest performers!! Event is less than an hour away at 6pm pst!! It looks like you may be having problems playing this video. If so, please try restarting your browser. Close ASADI & TEHRAN IN LESS THAN AN HOUR @ 6PM PAT Posted by  Iranian Students of California 36 Views Iranian Students of California April 1  ·  The last day of our virtual Nowruz Event is coming up! We have collaborated with UCLA, UC Berkeley, USC, UCD, UCR, UCSD, UCSB, UofSF, UofWashington, UCI, and Chai Talk in order to bring you an amazing event featuring an awesome Musician and Comedian, Asadi and Tehran!    The event will be live on zoom this Friday (aka tomorrow) at 6pm! Can’t wait to see all of you! It looks like you may be having problems playing this video. If so, please try restarting your browser. Close Posted by  Iranian Students of California 19 Views Iranian Students of California March 30  ·  Iranian Students of California in collaboration with our associated orgs at UCSB will present a Virtual Nowruz Show as part of  ISC Nowruz Festival !   Please join us this Thursday at 8pm on ISC's YouTube Channel to watch the show, featuring special performances by Ava Choir and Roham Band. RSVP to receive YouTube links via email  https://iscnowruzfestival.eventbrite.com/  ................................. ...  Acknowledgements:  Special thanks to UCSB Associated Students Finance and Business Committee for funding this event and to UCSB's Iranian Jewish Student Association and Persian Student Group for co-hosting this event as part of our festival!   See More Iranian Students of California March 17  ·  Only 2 days left to  ISC Nowruz Festival  2021/1400!! This year, 18 organizations at 12 universities across the US (but mostly in California!) came together to celebrate the beginning of spring and a new year! Please join us for this historic two-week festival!  *** Day 1: Friday March 19th at 8pm ***  Festival Kickoff featuring messages from ISC member organizations and well-known Iranian musicians along with short musical performances to get us into the Nowruz spirit. ...  *** Day 2: Saturday March 20th at 7pm ***  Exclusive Performance by Milad Derakhshani, presented by SIGS at UC Irvine  *** Day 3: Thursday April 1st at 8pm ***  Performances by Roham Band & Ava Choir, presented by IGSA, IJSA, & PSG at UC Santa Barbara  *** Day 4: Friday April 2nd at 6pm ***  Live Music Performance by Asadi, featuring the comedian Tehran  Stay tuned! Links will be posted on the event page  ISC Nowruz Festival .   See More It looks like you may be having problems playing this video. If so, please try restarting your browser. Close ISC Nowruz Festival Posted by  Iranian Students of California 255 Views Iranian Students of California  updated their cover photo. March 17  ·  Iranian Students of California March 16  ·  COUNT DOWN TO NOWRUZ -3 🌸 ✨  In light of Nowruz coming up we are going to explore the meaning of each component of the Haft Seen. Today we are introducing Sonbol  ✨   # iscnowruz It looks like you may be having problems playing this video. If so, please try restarting your browser. Close Posted by  Iranian Students of California 27 Views Iranian Students of California March 15  ·  COUNT DOWN TO NOWRUZ -4 🌸 ✨  In light of Nowruz coming up we are going to explore the meaning of each component of the Haft Seen. Today we are introducing Samanu  ✨   # iscnowruz It looks like you may be having problems playing this video. If so, please try restarting your browser. Close Posted by  Iranian Students of California 55 Views Iranian Students of California March 14  ·  COUNT DOWN TO NOWRUZ -5 🌸 ✨  In light of Nowruz coming up we are going to explore the meaning of each component of the Haft Seen. Today we are introducing Seer  ✨ 🧄   # iscnowruz It looks like you may be having problems playing this video. If so, please try restarting your browser. Close Posted by  Iranian Students of California 28 Views Iranian Students of California March 13  ·  COUNT DOWN TO NOWRUZ -6 🌸 ✨  In light of Nowruz coming up we are going to explore the meaning of each component of the Haft Seen. Today we are introducing Seeb  🍎 ✨ 🍏 It looks like you may be having problems playing this video. If so, please try restarting your browser. Close Posted by  Iranian Students of California 20 Views Iranian Students of California March 12  ·  COUNT DOWN TO NOWRUZ -7  🌸 ✨  In light of Nowruz coming up, we are going to explore the meaning being each component of the Haft-Sin. Today we are introducing Sabzeh!  🌱 🌿 It looks like you may be having problems playing this video. If so, please try restarting your browser. Close Posted by  Iranian Students of California 69 Views Iranian Students of California March 9  ·  ISC is excited to invite you to our 2 week Nowruz festival. Join us on March 19th as we kick off the first day of our Nowruz events, featuring special messages from the ISC member organizations and Iranian public figures along with short performances to get us into the Nowruz spirit.   Day two of the Nowruz Festival continues March 20th, featuring an exclusive recorded performance by Milad Derakhshani. April 1st will be the third day of the Festival and includes recorded performances by the Ava Choir and Roham Band.  The fourth and final day of the Festival will have a live performance by our secret special guest on Sizdah Be-dar, April 2nd! It looks like you may be having problems playing this video. If so, please try restarting your browser. Close ISC Nowruz Festival! Posted by  Iranian Students of California 57 Views Iranian Students of California  added an  event . March 9  ·  FRI, MAR 19 ISC Nowruz Festival Online Event Party  · 319 people Iranian Students of California February 21  ·  Fatemeh Keshavarz, born and raised in the city of Shiraz, completed her studies in Shiraz University, and University of London. She taught at Washington University in St. Louis for over twenty years where she chaired the Dept. of Asian and Near Eastern Languages and Literatures from 2004 to 2011. In 2012, Keshavarz joined the University of Maryland as the Roshan Institute Chair in Persian Language and Literature, and Director of the Roshan Institute Center for Persian Studies ... . Keshavarz is author of award winning books including Reading Mystical Lyric: the Case of Jalal al-Din Rumi (USC Press,1998), Recite in the Name of the Red Rose (USC Press, 2006) and a book of literary analysis and social commentary titled Jasmine and Stars: Reading more than Lolita in Tehran (UNC Press, 2007). She has also published other books and numerous journal articles. Keshavarz is a published poet in Persian and English and an activist for peace and justice. She was invited to speak at the UN General Assembly on the significance of cultural education. Her NPR show “The ecstatic faith of Rumi” brought her the Peabody Award in 2008. In the same year, she received the “Herschel Walker Peace and Justice Award.”  ISC invites you to join us to watch the live stream of performances and special guests from our Doornavazi Music Festival. The Festival will be livestreamed on YouTube on Feb 27th and 28th form 4-6PM PST. Please RSVP using the Eventbrite in our bio (or down below). We hope to see you there!   https://iscmusicfestival.eventbrite.com   # Doornavazi   # musicfesitival   # livestream   # fatemehkeshavarz   # music   # IranianStudentsofCalifornia   # IranianStudentsofCA   # IranianStudentsCA   # ISC   # Iran   # CommunityBuilding   # Community   # Iranian   # IranianAmercian   # IranianDiaspora   # IranianHeritage   See More Iranian Students of California February 20  ·  Doornavazi Student Preformers:  Faraz Ashtiani has been playing Piano for almost 15 years. He was instructed by maestro Anoushiravan Rohani during a series of master classes. He has had multiple stage performances both in Iran and the US. Faraz is currently a PhD candidate of mechanical engineering at Clemson University and has a B.Sc. degree from University of Tehran. You can find Faraz's music on his SoundCloud   https://soundcloud.com/faraz-ashtiani ...  Farshid Ashtiani has been playing violin for almost 20 years and has had multiple stage performances both as soloist and as part of a few orchestras in Iran. He learned violin from two late maestros Homayoun Khorram and Mohammadreza Atabaki. He has a PhD in electrical engineering from the University of Pennsylvania, and M.Sc and B.Sc. degrees from Sharif University of Technology.  You can find Farshid's music on his SoundCloud   https://soundcloud.com/farshidashtiani  Morteza Taghavi was born and raised in Tehran, Iran. He is a graduate of the Tehran Music School primarily focusing on composing and performing Iranian folklore music. Since 2014 Morteza has performed at multiple national and international music festivals. This includes numerous concerts across many different cities in Iran. Currently Morteza is a graduate student at Tehran University.  ISC invites you to join us to watch the live stream of performances and special guests from our Doornavazi Music Festival. The Festival will be livestreamed on YouTube on Feb 27th and 28th form 4-6PM PST. Please RSVP using the Eventbrite in our bio (or down below). We hope to see you there!   https://iscmusicfestival.eventbrite.com   # Doornavazi   # musicfesitival   # livestream   # farazashtiani   # farshidashtiani   # mortezataghavi   # music   # IranianStudentsofCalifornia   # IranianStudentsofCA   # IranianStudentsCA   # ISC   # Iran   # CommunityBuilding   # Community   # Iranian   # IranianAmercian   # IranianDiaspora   # IranianHeritage   See More Iranian Students of California February 20  ·  Nahid Siamdoust is a Postdoctoral Associate in the Yale Program in Iranian Studies at the Council on Middle East Studies in the MacMillan Center for International and Area Studies. She is the inaugural Ehsan Yarshater Fellow in Iranian Studies. She is also Lecturer in the Department of Near Eastern Languages and Civilizations. Dr. Siamdoust received her doctorate from the University of Oxford, where she graduated in Modern Middle Eastern Studies at St. Antony’s College. Her b ... ook, “Soundtrack of the Revolution: The Politics of Music in Iran” was published in 2017 by Stanford University Press. It is an alternative history of post-revolutionary Iran viewed through the field of music.  ISC invites you to join us to watch the live stream of performances and special guests from our Doornavazi Music Festival. The Festival will be livestreamed on YouTube on Feb 27th and 28th form 4-6PM PST. Please RSVP using the Eventbrite in our bio (or down below). We hope to see you there!   https://iscmusicfestival.eventbrite.com   # Doornavazi   # musicfesitival   # livestream   # nahidsiamdoust   # music   # IranianStudentsofCalifornia   # IranianStudentsofCA   # IranianStudentsCA   # ISC   # Iran   # CommunityBuilding   # Community   # Iranian   # IranianAmercian   # IranianDiaspora   # IranianHeritage   See More Iranian Students of California February 19  ·  ISC proudly invites you to watch the live stream of performances from our first Doornavazi Music Festival. The festival features home-recorded musical performances by students and graduates from all across the U.S plus talks and speeches by renowned cultural and scholar figures such as Dr. Hossin Omoumi, Dr. Abbas Milani, Kambiz Roshanravan and Mahsa Vahdat with addition to special performances by Shahrokh Yadegari, Faraz Minooei, Safa Shahidi, Hafez Modirzadeh Hooman Pourmeh ... di and Kouroush Taghavi.  The festival will be live-streamed on YouTube on Feb 27th and 28th from 4-6PM PST time. Please RSVP using the Eventbrite down below. We hope to see you there!   https://iscmusicfestival.eventbrite.com  Check out YouTube channel for the stream links:   https://www.youtube.com/channel/UCP48hfBfB9mC63UI35rE6mw  The Doornavazi festival is made possible through generous donations from the Hamid and Christina Moghdam Program in Iranian Studies and the Persian Student Association (PSA) at Stanford university, the Rahimian Family Foundation in Sacramento, and the Jordan Center for Persian Studies in University of California, Irvine.   See More It looks like you may be having problems playing this video. If so, please try restarting your browser. Close Posted by  Iranian Students of California 7,785 Views Watch Again Resume Video Send Message Iranian Students of California February 19  ·  Nasrin Rahimieh is a professor of Comparative Literature at the University of California, Irvine. Dr. Rahimieh’s research has focused on intercultural encounters between Iran and the West, modern Persian literature, literature of exile and displacement, women’s writing, and post-revolutionary Iranian cinema. Her publications include Oriental Responses to the West: Comparative Essays on Muslim Writers from the Middle East (Brill, 1990) and Missing Persians: Discovering Voices  ... in Iranian Cultural Heritage (Syracuse University Press, 2001). Her reviews and articles have appeared in Iranian Studies, Comparative Literature Studies, Iran Nameh, The Middle East Journal, The Comparatist, Thamyris, Edebiyat, International Journal of Middle East Studies, Canadian Literature, and New Comparison.  ISC invites you to join us to watch the live stream of performances and special guests from our Doornavazi Music Festival. The Festival will be livestreamed on YouTube on Feb 27th and 28th form 4-6PM PST. Please RSVP using the Eventbrite in our bio (or down below). We hope to see you there!   https://iscmusicfestival.eventbrite.com   # Doornavazi   # musicfesitival   # livestream   # nasrinrahimieh   # music   # IranianStudentsofCalifornia   # IranianStudentsofCA   # IranianStudentsCA   # ISC   # Iran   # CommunityBuilding   # Community   # Iranian   # IranianAmercian   # IranianDiaspora   # IranianHeritage   See More Iranian Students of California February 18  ·  Doornavazi Student Preformer: Sibarg Ensemble  Vocalist Hesam Abedini established the Sibarg Ensemble in 2008 at the Tehran Music Conservatory. When the ensemble moved to the United States in 2010, they reformed and published their first album Cipher in 2018 sponsored by the Jordan Center for Persian Studies and the Farhang Foundation. The Sibarg Ensemble has performed at numerous music festivals, universities, and cultural institutions, including Springfest SD, Mount Saint Ma ... ry’s Women in Music Festival, Carlsbad Music Festival, Intercultural Music Conference (IcM), Central Stage Berkeley, UCLA Royce Hall, USC Bovard Auditorium, UCI Smith Hall, and UCSD Conrad Prebys Music Center. They have also held educational workshops at UCLA, UCSD, the Iranian-American Cultural Center San Diego, and with the Santa Monica Youth Orchestra. Their music has been featured on WNYC’s New Sounds, KEXP’s Wo’ Pop, WFMU, KZSU, and KFJC.   Musicians:   Sara Saberi, Oud  Josh Charney, Keyboard  Kyle Motl, Bass  Corey Fogel, Drums  Hesam Abedini, Vocals  ISC invites you to join us to watch the live stream of performances and special guests from our Doornavazi Music Festival. The Festival will be livestreamed on YouTube on Feb 27th and 28th form 4-6PM PST. Please RSVP using the Eventbrite in our bio (or down below). We hope to see you there!   # Doornavazi   # musicfesitival   # livestream   # sibargensemble   # music   # IranianStudentsofCalifornia   # IranianStudentsofCA   # IranianStudentsCA   # ISC   # Iran   # CommunityBuilding   # Community   # Iranian   # IranianAmercian   # IranianDiaspora   # IranianHeritage   See More Iranian Students of California February 18  ·  Mark LeVine is an American professor of history at the University of California, Irvine, United States. He is also a musician. He received his B.A. in comparative religion and biblical studies from Hunter College and his M.A. and Ph.D. from New York University's Department of Middle Eastern Studies. He is the author of the book Heavy Metal Islam: Rock, Resistance and the Soul of Islam.  ISC invites you to join us to watch the live stream of performances and special guests from ...  our Doornavazi Music Festival. The Festival will be livestreamed on YouTube on Feb 27th and 28th form 4-6PM PST. Please RSVP using the Eventbrite in our bio (or down below). We hope to see you there!   # Doornavazi   # musicfesitival   # livestream   # marklevine   # music   # IranianStudentsofCalifornia   # IranianStudentsofCA   # IranianStudentsCA   # ISC   # Iran   # CommunityBuilding   # Community   # Iranian   # IranianAmercian   # IranianDiaspora   # IranianHeritage   See More See More \n \n \n"
}