{
    "docno": "RJP583",
    "url": "https://www.facebook.com/UAW2865UCR/?ref=py_c",
    "text": "\n UC Riverside Student Workers Union UAW Local 2865 - Home | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home About Photos Reviews Videos Events Posts Community See more of UC Riverside Student Workers Union UAW Local 2865 on Facebook Log In or Create New Account See more of UC Riverside Student Workers Union UAW Local 2865 on Facebook Log In Forgot account? or Create New Account Not Now Community See All 348 people like this 372 people follow this 183 check-ins About See All www.uaw2865.org Political Organization  ·  School  ·  Labor Union Price Range Not Applicable Page Transparency See More Facebook is showing information to help you better understand the purpose of a Page. See actions taken by the people who manage and post content. Page created - February 8, 2013 People 348  likes 183   visits Related Pages Undocumented Student Programs at UCR Education UC Riverside International Affairs College & University UCR Resistance to Mass Incarceration Community Organization UCR School Psychology Program Campus Building UC Irvine Student Workers Union - UAW 2865 Labor Union 28ers at UCR Community Organization CYD South State Political Organization UC Irvine LMSA & SNMA Annual Pre-Health Conference College & University CTA Sierra Service Center Labor Union Hilltop Nursery School Day Care CSUSM College Democrats Political Organization Richard Mathews for Assembly District 45 Dem Party Delegate Political Organization Building Service Staff Union Labor Union Dance at Oberlin Performing Arts School March For Our Lives Las Vegas Cause Gender and Sexuality Studies Department, UC Riverside College & University UC Riverside Ethnic Studies Education UCR Women's Resource Center College & University Friends of the Oakland Public School Libraries Community Organization UCSD Student Workers Union Political Organization See More triangle-down Pages Liked by This Page UAW Local 2865, UC Student-Workers Union - UCLA UC Riverside Basic Needs UAW Local 2865 - UC Merced UCR GSA UC Student Workers Union - Davis UC Berkeley Student Workers Union - UAW 2865 Industrial Workers of the World - CT UAW Local 5810 UAW Local 4123 UAW Local 2865, UC Student-Workers Union UC Irvine Student Workers Union - UAW 2865 Coalition for Survivors Rights UCSD Student Workers Union See More triangle-down Places Riverside, California UC Riverside Student Workers Union UAW Local 2865 English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 Photos See All Videos COLA Letter Delivered! 6 See All See More \n \n \n"
}