{
    "docno": "RJP589",
    "url": "https://www.facebook.com/ucrprishi/?ref=py_c",
    "text": "\n Project RISHI at UCR - Home | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home About Events Photos Videos Posts Community See more of Project RISHI at UCR on Facebook Log In or Create New Account See more of Project RISHI at UCR on Facebook Log In Forgot account? or Create New Account Not Now Community See All 328 people like this 332 people follow this About See All www.uscprojectrishi.org Nonprofit Organization Page Transparency See More Facebook is showing information to help you better understand the purpose of a Page. See actions taken by the people who manage and post content. Page created - October 3, 2016 People 328  likes Related Pages The Women's Network: UC Riverside Community Organization Humans of UC Riverside Arts & Humanities Website Project RISHI at UC Irvine Charity Organization Leave It To Us - Orange County - Fee Free Senior Citizen Shopping Nonprofit Organization The Literacy Initiative UCR - TLI Education UCR Aag Nonprofit Organization We Won't Sugar Coat It Health & Wellness Website Project RISHI - University of Michigan Nonprofit Organization Cutie Hack Interest India Association Of Inland Empire Charity Organization Humans of Monta Vista High Community Organization UC Riverside International Affairs College & University The Gleason Project Community Service Easy Loop Product/Service Bollywood Step Dance Artist Phi Lambda Sigma- St. John's University College & University DJ Lil'Singh DJ Rose Hack Event Tamasha SD Nonprofit Organization Cal Poly Pomona Indian Student Association Community Organization See More triangle-down Pages Businesses Nonprofit Organization Project RISHI at UCR English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 Photos See All Videos UCR Project RISHI 2018-19 Recap 2 Introducing one our initiatives this year: providing pads for the women of our sponsorship village, Ghangar. Our fundraising profits go out to the village and allow us to deliver pads to help the women of the village. A warm welcome back to all Highlanders! UCR Project RISHI is blessed and proud to announce that we have two very amazing causes to support this year - 𝗳𝗮𝗰𝗶𝗹𝗶𝘁𝗮𝘁𝗶𝗼𝗻 𝗼𝗳 𝗽𝗿𝗼𝗽𝗲𝗿 𝗳𝗲𝗺𝗮𝗹𝗲 𝗺𝗲𝗻𝘀𝘁𝗿𝘂𝗮𝗹 𝗵𝘆𝗴𝗲𝗶𝗻𝗲 and 𝗘𝗻𝗴𝗹𝗶𝘀𝗵 𝗲𝗱𝘂𝗰𝗮𝘁𝗶𝗼𝗻 𝗳𝗼𝗿 𝘀𝗰𝗵𝗼𝗼𝗹𝗰𝗵𝗶𝗹𝗱𝗿𝗲𝗻. We are working very closely with our sponsor village, Ghangar, which is high up in the mountain ranges of Uttarakhand, India, to make this vision a reality. The village is supported by strong, hard-working women, who face the issue of not being able to access menstrual products that are environmentally friendly. To promote their well-being and health, as well as the fertility of their farming lands, our chapter has adopted the mission of giving them accessibility to BIODEGRADABLE pads to replace plastic ones. We would also like to include BASIC English language skills in students’ academic curriculums by sending over tape recordings for practice. This specific cause is still in the works - we look forward to sharing the knowledge we have with the children in order to open them up to new work and life possibilities. Every penny that we collect from the events and fundraisers our chapter hosts this year will go towards aiding our village, as well as gaining additional resources to make our volunteer trip next summer. We are so excited to share these causes with you all, and hope you take away as much as we do from lending a hand to the community. We’d like to thank you for your timeless support, and here’s to a great 2020-21 year for UCR PRISHI! See All Posts Project RISHI at UCR March 2  ·  Board applications are open now! The available positions are listed on the flyer. They are due MARCH 28 by 11:59 PM! Application link in our bio  ☺️ Project RISHI at UCR February 22  ·  Join us for our 2nd general meeting of the quarter! We will be playing a virtual scavenger hunt game and more!!  🧩 👾 Can’t wait to see you all there! See All See More \n \n \n"
}