{
    "docno": "RJP549",
    "url": "https://www.oculus.com/",
    "text": "\n Oculus | VR Headsets, Games & Equipment \n \n \n \n \n PRODUCTS APPS & GAMES SUPPORT LIVE THE UNBELIEVABLE OCULUS QUEST 2 GIVES YOU THE FREEDOM TO DO IT ALL. GAMES, ENTERTAINMENT, LIVE EVENTS, FITNESS AND MORE.\n             BUY NOW\n                   LEARN MORE\n                   ANYTHING IS POSSIBLE. No matter who you are, with a growing library of games and experiences there is no limit to where you can go and what you can do in virtual reality. WATCH VIDEO NEW RELEASES POPULATION: ONE Climb anything. Fight anywhere. Experience battle royale only possible in VR. BEAT SABER Slash the beats to precisely handcrafted music. JURASSIC WORLD AFTERMATH Jurassic World Aftermath is a suspenseful, survival VR adventure MEDAL OF HONOR: ABOVE AND BEYOND Infiltrate, outgun and outsmart the Nazi war machine in this AAA experience only available in VR. STAR WARS: TALES FROM THE GALAXY'S EDGE Live your Star Wars adventure and explore the wilds of Batuu in this new original story. THE CLIMB 2 Enjoy the view from the top as you climb to new heights. ECHO VR Experience the freedom of zero-g movement and high energy competition. ASGARD'S WRATH Battle as mortals. Rise as a god. THE WALKING DEAD: SAINTS & SINNERS Explore New Orleans in a free roam survival horror adventure. CONTRACTORS VR Experience next-level virtual warfare with hardcore controls and customizable load-outs. Discover new adventures, master epic challenges or revisit classic moments in your favorite games and experiences. Discover new adventures, master epic challenges or revisit classic moments in your favorite games and experiences. EXPLORE ALL TITLES LATEST NEWS RESIDENT EVIL 4 The survival horror classic is coming to Quest 2. April 15, 2021 FITNESS IS FUN ON QUEST 2 Work out without working out with the power of VR. May 2, 2021 INTRODUCING QUEST 2 DEMOS Experience every detail, book a demo with an Oculus expert. April 13, 2021 COLETTE WINS OSCAR® Explore the heroic story of a WW2 French Resistance member. April 25, 2021 CHOOSE YOUR SETUP \n            COMPARE\n           OCULUS QUEST 2 All-In-One VR Gaming \n          Starting at  $299 USD Starting at  $299 USD BUY NOW OCULUS RIFT S PC-Powered VR Gaming NOT AVAILABLE \n            COMPARE\n           PERSONALIZE EVERY EXPERIENCE Quest 2 Elite Strap With Battery and Carrying Case Protect your system at home or on the go. This case fits the headset, either Elite Strap, controllers, cables and power adapter. $129 USD \n              BUY NOW\n             Quest 2 Fit Pack This kit includes a pair of light blockers and two interchangeable facial interfaces for wider or narrower face shapes. $39 USD \n              BUY NOW\n             SHOP ALL ACCESSORIES PERSONALIZE EVERY EXPERIENCE Quest 2 Elite Strap With Battery and Carrying Case Protect your system at home or on the go. This case fits the headset, either Elite Strap, controllers, cables and power adapter. $129 USD \n              BUY NOW\n             Quest 2 Fit Pack This kit includes a pair of light blockers and two interchangeable facial interfaces for wider or narrower face shapes. $39 USD \n              BUY NOW\n             SHOP ALL ACCESSORIES PERSONALIZE EVERY EXPERIENCE Quest 2 Elite Strap With Battery and Carrying Case Protect your system at home or on the go. This case fits the headset, either Elite Strap, controllers, cables and power adapter. $129 USD \n              BUY NOW\n             Quest 2 Fit Pack This kit includes a pair of light blockers and two interchangeable facial interfaces for wider or narrower face shapes. $39 USD \n              BUY NOW\n             SHOP ALL ACCESSORIES QUEST 2 RIFT S ACCESSORIES APPS & GAMES SUPPORT DEVELOPERS OCULUS FOR BUSINESS ALL PRODUCTS Quest 2 Rift S Accessories Quest Go Rift MORE OCULUS Forums Blog VR for Good Creators Download SDKs ABOUT Careers Facebook Connect Research ALL PRODUCTS Quest 2 Rift S Accessories Quest Go Rift MORE OCULUS Forums Blog VR for Good Creators Download SDKs ABOUT Careers Facebook Connect Research Privacy Legal ©   Facebook Technologies, LLC. \n \n \n \n \n \n \n \n \n \n \n \n \n \n"
}