{
    "docno": "RJP542",
    "url": "https://www.facebook.com/watch/",
    "text": "\n Facebook Watch \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Sign Up Popular Videos NOW PLAYING 2:05 WELCOME HOME: When an Ohio high school tried—and failed—playing a video message for a graduate whose father was deployed overseas, they did the next best thing: they brought U.S. Air Force Master Sgt. Drew Macke on stage to hug his daughter in person. News 5 Cleveland 6.7M views  ·  May 31 3:25 Step by step guide of making a 3-level koi pond MetDaan DIY 16M views  ·  May 31 1:04 Sydney's family bet her 20 bucks that she wouldn't try to check her pool noodle on Southwest. Not only did her pool noodle fly free, but we gave her an extra special celebration on her flight back. \n\nEnjoy those 20 bucks, Sydney. (Vid creds: @sydneyfowls05 on TikTok) Southwest Airlines 20M views  ·  June 2 9:01 What do you do when your dog takes away your husband and your bed? Ellen DeGeneres 8M views  ·  June 3 11:11 FAMILY IN TROUBLE AT HAULOVER INLET! Wavy Boats 8.2M views  ·  May 15 3:26 THE BREAKDOWN: MURTHEL GROENHART'S KO VS. HARUT GRIGORIAN GLORY Kickboxing 35M views  ·  June 2 Top Live Videos LIVE #NBAPlayoffs LIVE ESPN Scoreboard NBA about an hour ago LIVE [18+] GTA V Mods - Mai in the streets! Mithumad143 3 hours ago LIVE 🔞18+ GTA 5 Mods Versatile 3 hours ago LIVE ANOTHER LOKERAA😉😉😉🤍\n\n🎀DEAL DISCOUNT Code: MUSTBECINDY50 💖🎀 :  https://janneysdejavuboutique.com/products/box-with-8-random-colors-of-contacts?_pos=5&_sid=0a1732321&_ss=r \n\n💖PicaPica: \n https://picapicatx.com/ \n••Discount code: MUSTBECINDY \n\n💖Hair tools: \n https://www.foxybae.com/pages/sale-page/?pr=mustbecindy&p=Sk29G1pxI \n\n7 BRUSHES THIS MONTH😜🌸\n🌸LIVEGL... Mustbecindy 41 minutes ago LIVE The Hang with Brian Culbertson - Friday, June 11, 2021 Brian Culbertson Official about an hour ago LIVE 18+ GTA Mods | Street Rottweiler UsouJamir Gaming 2 hours ago Facebook Originals Top Gaming Videos LIVE 🔞18+ GTA 5 Mods Versatile 3 hours ago LIVE Insane Vault Heist \"Mr. K\" - Nopixel GTA 5 Roleplay! Mr.K gets revenge on the police! -------Follow--------  https://www.instagram.com/lordkebun   https://twitter.com/LordKebun   youtube.com/LordKebun LordKebun 2 hours ago LIVE 18+ GTA Mods | Street Rottweiler UsouJamir Gaming 2 hours ago LIVE [18+] GTA V Mods - Mai in the streets! Mithumad143 3 hours ago LIVE Blood Raven X-Suit King MichaelFeeds 23 minutes ago LIVE $5000 Battle of the Trenches 2v2 w/ Nickool! | HIGH KILL-HIGH INTERACTION WARZONE! | - 1299+ wins -- 85700+ kills -- 4.7+ K/D! PicNickbasket Gaming 5 hours ago \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n"
}