{
    "docno": "RJP552",
    "url": "https://www.facebook.com/fundraisers",
    "text": "\n Fundraisers \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Sign Up Fundraisers About Explore Raise Money Raise Money Fundraiser Categories Animals Arts and Culture Business Community and Social Action Crisis Relief Education Environment Faith Funeral and Loss Health and Medical International Personal Emergency Sports Fundraisers This WWII Veteran Needs Our Help Fundraiser by  Soldiers' Angels $9,925 raised of $20,000 24 days left Kelly’s Angel’s Fighting CF Fundraiser for  Cystic Fibrosis Foundation  by  Tracey Harrell Stallard $10,230 raised of $6,500 203 days left Remembering Romayne Fundraiser for  Living Beyond Breast Cancer  by Jean Sachs $10,681 raised of $10,000 274 days left Walk MS: Together We Are Stronger Fundraiser for  National Multiple Sclerosis Society  by  Scott Gold $11,766 raised of $10,000 113 days left Sumner's Fundraiser for Bike MS: Great Maine Getaway 2021 Fundraiser for  National Multiple Sclerosis Society  by Sumner Weeks $9,425 raised of $10,000 114 days left Support Me in the Fight Against Pancreatic Cancer Fundraiser for  Pancreatic Cancer Action Network  by Nikki Viglione Williams $16,582 raised of $15,000 35 days left See More Create a Fundraiser Facebook fundraisers make it easy to support friends, family and the causes that are important to you such as: No fees for donations to most nonprofit fundraisers and low fees for personal fundraisers Over 1 million nonprofits on Facebook to support or raise money for a personal cause such as medical or education Quickly spread your story to build momentum and raise more money Raise Money We're here to help Check out these frequently asked questions. triangle-right Who can create fundraiser? Only people from certain countries can create fundraisers on Facebook at this time. For a complete list, click to see the full article. See Full Article triangle-right How do nonprofits receive donations? If you create a fundraiser for a nonprofit, the nonprofit will receive donations  directly from Facebook , or from  Network for Good , or from  PayPal Giving Fund. See Full Article triangle-right How are donations to a personal fundraiser received? If you create a fundraiser for yourself or someone else on Facebook, all donations are sent to the fundraiser creator's personal checking account through Stripe, Facebook's fundraising payment processor. See Full Article triangle-right How do taxes work? Donations to US 501(c)(3) nonprofits are typically tax-deductible. Donations to charities outside the U.S. may be eligible for tax credits or deductions. Donations to personal fundraisers are not typically tax deductible. If you have questions about the deductibility of any donations, please reach out to a tax professional. See Full Article triangle-right How do fees work? Facebook charges no fees for donations made to nonprofits. For donations made to personal fundraisers, fees vary depending on where the money is being raised. To find out more, please review the full article. See Full Article Learn more in the  Help Center \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n"
}