{
    "docno": "RJP557",
    "url": "https://www.facebook.com/careers/?ref=p",
    "text": "\n Facebook Careers | Do the Most Meaningful Work of Your Career | Facebook Careers \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n COVID-19 update:  Protecting the health and safety of our communities—including our teams and of those considering a career at Facebook—is our highest priority. We continue to closely monitor the evolving situation and we appreciate your understanding and flexibility with any related changes to our interviewing process.  Learn how our teams are helping to keep people safe, informed, and connected. Skip to main content Jobs Areas of Work Locations  Students & Grads   Facebook Life  Blog Jobs Back Areas of Work By App or Service Instagram Oculus By App or Service Portal WhatsApp By Field Advertising Technology AR/VR Business Development & Partnerships Communications & Public Policy Creative Data & Analytics Design & User Experience Enterprise Engineering Global Operations By Field Infrastructure Legal, Finance, Facilities & Admin People & Recruiting Product Management Research Sales & Marketing Security Software Engineering Technical Program Management Locations Back Students & Grads Students & Grads Facebook University Back Facebook Life Culture Diversity Veterans Leadership Innovation Benefits Frequently Asked Questions Remote Work Blog Students & Grads Facebook University Culture Diversity Veterans Leadership Innovation Benefits Frequently Asked Questions Remote Work Advertising Technology AR/VR Business Development & Partnerships Communications & Public Policy Creative Data & Analytics Design & User Experience Enterprise Engineering Global Operations Infrastructure Legal, Finance, Facilities & Admin People & Recruiting Product Management Research Sales & Marketing Security Software Engineering Technical Program Management Instagram Oculus Portal WhatsApp Functional Operations Scaled Operations Trust & Safety Operations Production Engineering Privacy  #FacebookLife  Discover who we are, what we do, and why we do it When we build for the world, we bring our talents, experiences, and passions with us. Through our unique stories, we help bring the world closer together.  See All Job Results View All Jobs previous slide arrow next slide arrow Show Slide 1 Show Slide 2 Show Slide 3 Show Slide 4 Show Slide 5 The work we do impacts the world, and the future  We work on things we’re incredibly passionate about, that align with our values and purpose, and that have a positive impact on the world. It's who we are. It's why we build. Learn More Video Why We Build With Nadah Bring your values to do work that matters—not just to you, but to the world.  Innovation  We believe that innovation leads to a more connected world. Our company mission guides our innovative decision making, from the way our teams think, plan, and build, to hardware initiatives, AI, commerce, Facebook Reality Labs, and beyond. Learn More Connectivity With Facebook Connectivity, we bring internet access to everyone on the planet. This gives people more ways to communicate, strengthens community bonds, and gives people the power to create more economic opportunities.  Learn More Artificial Intelligence We use AI to help people get information that’s important to them in a more seamless way. For example, automatically captioning photos helps people with visual impairments experience the world and connect with those they care about. Learn More Augmented and Virtual Reality We use AR and VR to build powerful new ways for people to express themselves and connect with others. By leading the development of this kind of technology, we ensure people can continue to enjoy state-of-the-art AR effects and VR experiences. Learn More Inside Facebook Life How options to work flexibly or remotely will change working at Facebook. How options to work flexibly or remotely will change working at Facebook. Working remotely in Canada for Facebook: a designer shares his experience. Working remotely in Canada for Facebook: a designer shares his experience. View Careers Blog  Facebook is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, reproductive health decisions, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, political views or activity, or other applicable legally protected characteristics. You may view our Equal Employment Opportunity notice   here.   We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. You may view   Facebook's Pay Transparency Policy,   Equal Employment Opportunity is the Law   notice, and   Notice to Applicants for Employment and Employees   by clicking on their corresponding links. Additionally, Facebook participates in the   E-Verify program   in certain locations, as required by law.   Facebook is committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation due to a disability, you may contact us at  accommodations-ext@fb.com Upload your resume or share your LinkedIn profile with our recruiting team. Get Started Get Started  Facebook © 2021 English (US)  About Us   Company Info   Newsroom   Careers FAQs   Looking for contractor roles?   On Social   Facebook   Instagram   LinkedIn   Our Policies   Candidate Privacy Statement   Data Policy   Cookies   More Resources   Family Safety Center   Facebook for Business   Facebook for Developers  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n   \n"
}