{
    "docno": "RJP582",
    "url": "https://www.facebook.com/CampusApartmentsFamilyHousing/?ref=py_c",
    "text": "\n UCR Campus Apartments & Family Housing - Home | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home About Photos Reviews Events Videos Posts Community See more of UCR Campus Apartments & Family Housing on Facebook Log In or Create New Account See more of UCR Campus Apartments & Family Housing on Facebook Log In Forgot account? or Create New Account Not Now UCR Campus Apartments & Family Housing Apartment & Condo Building in Riverside, California 5 5 out of 5 stars. Community See All 737 people like this 758 people follow this 363 check-ins About See All 3615 Canyon Crest Dr (73.71 mi)  Riverside, CA, CA 92507 Get Directions (951) 827-5723 housing.ucr.edu Apartment & Condo Building  ·  Education  ·  Dorm Price Range $ Page Transparency See More Facebook is showing information to help you better understand the purpose of a Page. See actions taken by the people who manage and post content. Page created - October 23, 2012 People 737  likes 363   visits Related Pages Humans of UC Riverside Arts & Humanities Website UCR Dining Local Business Her Campus at UC Riverside College & University UC Riverside International Affairs College & University Gamma Phi Beta @ UCR Nonprofit Organization UCR School Psychology Program Campus Building UCR CARA College & University UCSB Residential Housing Association School Mechanical Engineering, UC Riverside College & University Student Design Center Graphic Designer ALPFA UCLA College & University UC Santa Barbara AMSA Community Organization Philosophy at California State University, Fullerton College & University UCR Women's Resource Center College & University Middle Eastern Student Assembly Organization UCR Tomás Rivera Library College & University UCR Transportation Services Parking Garage / Lot UCR HUB Interest UCR ARC Tutor/Teacher Plaza Verde Apartment & Condo Building See More triangle-down Pages Liked by This Page NASP UC Riverside UC Riverside Athletics R'Kids Ucr Barn UC Riverside University of California Police Department, Riverside UCR LGBT Resource Center The WELL at UCR UCR GradSuccess UCR HUB UCR Women's Resource Center See More triangle-down Places Riverside, California Residence Dorm UCR Campus Apartments & Family Housing English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 Photos See All Videos Come out to AI from 8-12a to play some casino games, fiest on a candy buffest, and play Super Smash Bros in our Campus Apartments Lounge 2 RTA Trip 5 TONIGHT!\n\nGet your FREE ticket to join us at County Fair and enjoy a petting zoo, love country band, and festive food (chicken and waffles, chocolate covered bacon, funnel cakes, Mac and cheese and so much more!) See All See More \n \n \n"
}