{
    "docno": "RJP679",
    "url": "https://www.facebook.com/business/a/facebook-pixel",
    "text": "\n Facebook Pixel: Measure, Optimize and Retarget with Facebook Ad | Facebook for Business \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Solutions By Goal Build Brand Awareness Promote Your Local Business Increase Online Sales Promote Your App Generate Leads Monetize Your Content Retarget Existing Customers View All Goals By Business Type Small Business Large Business Agency Media and Publisher Creator Developer Startup Marketing Partner Platforms and Products Platforms Facebook Instagram Messenger WhatsApp Audience Network Oculus Workplace Products Free Tools Stories Shops Facebook Business Suite Ads Video Ads Ads Manager Measurement Inspiration Insights and Inspiration Facebook IQ Marketing Insights Business News Case Studies Video Events and Collaboration Events Creative Hub Education and Resources Skills and Training Online Learning Courses Certification Programs Webinars Guides and Resources Ads Guide COVID-19 Resources Safety and Integrity Business Equality Social Good Find a Marketing Partner Support Create an Ad chevron-down chevron-down Create a Page Create a Page Solutions By Goal Build Brand Awareness Promote Your Local Business Increase Online Sales Promote Your App Generate Leads Monetize Your Content Retarget Existing Customers View All Goals By Business Type Small Business Large Business Agency Media and Publisher Creator Developer Startup Marketing Partner Platforms and Products Platforms Facebook Instagram Messenger WhatsApp Audience Network Oculus Workplace Products Free Tools Stories Shops Facebook Business Suite Ads Video Ads Ads Manager Measurement Inspiration Insights and Inspiration Facebook IQ Marketing Insights Business News Case Studies Video Events and Collaboration Events Creative Hub Education and Resources Skills and Training Online Learning Courses Certification Programs Webinars Guides and Resources Ads Guide COVID-19 Resources Safety and Integrity Business Equality Social Good Find a Marketing Partner Search Solutions Platforms and Products Inspiration Education and Resources Support Create an Ad  Create a Page  The Facebook pixel A piece of code for your website that lets you measure, optimize and build audiences for your ad campaigns. Go to Ads Manager Measure cross-device conversions Understand how your cross-device ads help influence conversions. Optimize delivery to people likely to take action Ensure your ads are shown to the people most likely to take action. Create custom audiences from website visitors Dynamic ads  help you automatically show website visitors the products they viewed on your website—or related ones. Learn about your website traffic Get rich insights about how people use your website from your Facebook pixel dashboard. How the Facebook pixel works When someone visits your website and takes an action (for example, buying something), the Facebook pixel is triggered and reports this action. This way, you'll know when a customer took an action after seeing your Facebook ad. You'll also be able to reach this customer again by using a custom audience. When more and more conversions happen on your website, Facebook gets better at delivering your ads to people who are more likely to take certain actions. This is called conversion optimization. Once we had Facebook conversion tracking in place and started using Custom Audiences, we saw a huge uplift in sales. Facebook ads became ROI-positive for us, from day one! Amy Norman Co-founder,  Little Passports Setting up the Facebook pixel If you have access to your website's code, you can add the Facebook pixel yourself. Simply place the Facebook pixel base code (what you see when you create your pixel) on all pages of your website. Then add standard events to the pixel code on the special pages of your website, such as your add-to-cart page or your purchase page. For full step-by-step instructions on adding the Facebook pixel to your site, visit the  Help Center .  Many people need the help of a developer to complete this step. If that's the case, simply email your Facebook pixel code to them, and they can easily add it to your site. Create your Facebook pixel to send to your developer, or install it yourself. Go to Ads Manager Additional resources Facebook Blueprint Learn more about using the Facebook pixel in our course Advertiser Help Center Get step-by-step help on creating and using the Facebook pixel Marketing Partners Get help expert from a  Facebook Marketing Partner  or an  Instagram Marketing Partner . More Retargeting Tools Find more tools for reaching people who have shown interest in your business Was this page helpful? Yes No Platforms Facebook Instagram Messenger WhatsApp Audience Network Oculus Workplace Products Free Tools Facebook Pages Instagram Profiles Stories Shops Facebook Business Suite Facebook Ads Messenger Ads Instagram Ads Video Ads Ads Manager Goals Set Up a Facebook Page Getting Started with Messenger Build Brand Awareness Promote Your Local Business Grow Online Sales Promote Your App Generate Leads Measure and Optimize Ads Retarget Existing Customers View All Goals Business Types Small Business Large Business Agency Media and  Publisher Creator Developer Startup Marketing Partner Industries Automotive B2B Consumer Packaged Goods Ecommerce Entertainment and Media Financial Services Gaming Real Estate Restaurants Retail Technology and Telecom Travel Inspiration Marketing Insights from Facebook IQ Business News Case Studies Video Events Creative Hub Skills and Training Online Learning Certification Programs Webinars Guides and Resources Ads Guide COVID-19 Resources Safety and Integrity Business Equality Find a Marketing Partner Business Help Center Create and Manage Accounts Publish and Distribute Content Advertise Sell on Facebook and Instagram Monetize Your Content or App View All Articles  Facebook © 2021 About Developers Careers Privacy Cookies Terms Help Center English (US) English (UK) Español Português (Brasil) Français (France) Español (España) More languages العربية Tiếng Việt Italiano Deutsch ภาษาไทย 中文(台灣) Čeština Dansk Ελληνικά Suomi Français (Canada) עברית हिन्दी Magyar Bahasa Indonesia 日本語 한국어 Bahasa Melayu Norsk (bokmål) Nederlands Polski Português (Portugal) Română Русский Svenska Türkçe 中文(简体) 中文(香港) \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n   \n"
}