{
    "docno": "RJP678",
    "url": "https://developers.facebook.com/docs/apis-and-sdks",
    "text": "\n APIs and SDKs - Graph API - Documentation - Facebook for Developers \n \n \n \n \n Graph API Overview Using the Graph API FAQ Reference Features Reference Permissions Reference Webhooks Upload Files to Facebook with Resumable Upload API Advanced Changelog Server-Sent Events \nAPIs and SDKs\n \nFind out how our APIs work and integrate our products quickly using SDKs for common languages and platforms.\n Our APIs \n Graph API \n The primary way for apps to read and write to the Facebook social graph. Access Pages, Users, Posts, Groups, Events and more. \n Marketing APIs \n The Marketing APIs offer programmatic access to manage your Facebook ad campaigns, Custom Audiences, and reports. \n Our Official SDKs \n Facebook SDK for Android \n Track installs and app opens, give people the ability to share content, or support the ability to Login with Facebook. \n Facebook SDK for iOS \n The easiest way to track the success of your App Ads, implement powerful sharing or let people log into your app with Facebook. \n Facebook SDK for JavaScript \n A rich set of client-side functionality for adding Social Plugins, making API calls and implementing Facebook Login. \n Facebook SDK for PC Games \n Helps you connect your players with the best gaming communities through friend finding, live video and more. \n Facebook SDK for PHP \n A modern, native library for accessing the Graph API and taking advantage of Facebook Login. \n Facebook Business SDK \n If you're using the Ads API, this Facebook SDK for PHP makes it easy to manage your Facebook ad campaigns, Custom Audiences, and reports. \n Facebook SDK for React \n Helps you build engaging social apps using JavaScript that run natively on mobile platforms. \n Facebook SDK for Swift \n With the Facebook SDK for Swift, you gain a swift-taylored experience for all of the core Facebook SDK for iOS's APIs. \n Facebook SDK for tvOS \n With the Facebook SDK for tvOS you can build great social experiences on Apple TV. \n Facebook SDK for Unity \n Integrate social features in your cross-platform Unity games quickly and easily. \n Third-party SDKs \n Whilst Facebook provides official SDKs for iOS, Android, Unity, JavaScript and PHP, there are a wide range of unofficial, third-party SDKs for a range of other languages and frameworks built by amazing communities of active developers. \n Inclusion in this list is not an endorsement or recommendation by Facebook. In addition, such inclusion is not intended to imply, directly or indirectly, that these organizations endorse or have any affiliation with Facebook. Feedback and bugs should be directed to their representative authors. \n Cocos2d-x \n Cocos2d-x with Facebook Django \n Django-Facebook Flash \n Flash (ActionScript)  (supported by Adobe) HTML5 \n Kinvey PhoneGap  by Adobe Sencha Touch  by Sencha Trigger.io SDK  by Trigger.io Java \n Java (Spring)  by Spring Social Java (Blackberry)  by RIM Kinvey RestFB  by Mark Allen JavaScript \n Kinvey PhoneGap  by Adobe Sencha Touch  by Sencha  Lua \n Corona SDK  by Corona Labs Windows SDK \n Windows SDK for Facebook  by Microsoft Node.js \n Node.js amachang's Node SDK FBgraph tenorviol node.js SDK Objective-C \n Kinvey Qt \n Qt framework for iOS and Android app developers Ruby \n Facebooker2 FBGraph Koala MiniFB Mogli OmniAuth Rest-Graph V-Play \n V-Play Game Engine Facebook Plugin WinJS \n WinJS  by Thuzi \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n   \n"
}