{
    "docno": "RJP612",
    "url": "https://www.facebook.com/cutiehack/posts",
    "text": "\n Cutie Hack - Posts | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home About Photos Videos Events Posts Community See more of Cutie Hack on Facebook Log In or Create New Account See more of Cutie Hack on Facebook Log In Forgot account? or Create New Account Not Now Visitor Posts Logan Pribyl May 22, 2017 at 11:11 AM Photo Creds to  Cutie Hack  2017 Jonathan La Hernandez May 20, 2017 at 12:00 AM Will you be providing parking permits tomorrow? Logan Pribyl May 18, 2016 at 5:27 PM Stage 4 of  Cutie Hack : Memories made English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 Cutie Hack November 7, 2020  ·  HAPPENING TODAY!!   Make sure you’re on our Discord to stay updated!  :) SAT, NOV 7, 2020 Cutie Hack 2020: Stay At Home Online Event 25 people interested Cutie Hack  updated their profile picture. October 6, 2020  ·  Cutie Hack  updated their cover photo. October 6, 2020  ·  Cutie Hack  added an  event . October 6, 2020  ·  SAT, NOV 7, 2020 Cutie Hack 2020: Stay At Home Online Event 25 people interested Cutie Hack August 15, 2020  ·   Messenger  Cutie Hack updated their business hours. Send Message Cutie Hack January 13, 2020  ·  We'd like to take some time to thank our AMAZING sponsors from Cutie Hack, we couldn't have done it without them!   Be sure to look out for information regarding  Citrus Hack  soon!   # hackathon   # sponsors   # cutiehack Cutie Hack November 11, 2019  ·  Hey everyone, thanks for coming to this year's Cutie Hack!!  Want to see some cool photos from Saturday? Check out this album and let us know if you see yourself in there!  📸   https://photos.google.com/…/AF1QipOU5F5hAnHrHwwJiS0jWokMxXN… 157 new photos added to shared album photos.google.com Cutie Hack 2019 157 new photos added to shared album 157 new photos added to shared album Cutie Hack November 4, 2019  ·  Hey y'all!  Do you have a really good idea that you think could win up to $20k?  The UC systemwide Big Ideas Contest is an early-stage, student-led, innovation competition that connects students with mentorship, training, and resources needed to successfully conceptualize, deploy, and scale their social ventures. Open to all students at UC Riverside, and the Contest awards up to $300,000 in prizes annually, with awards typically ranging from $5,000 to $20,000.  💵 ...  There is an information session being held at 2:00PM on Thursday, November 7th, 2019 in HUB 367 (pizza will be provided and an is RSVP required).  🍕  The deadline to submit the idea proposal is November 20, 2019, at noon (12:00 PM). You can RSVP via  bit.ly/bigideasUCR  and find more details at  bigideascontest.org   See More Cutie Hack October 25, 2019  ·  Hey everyone!    BMES @ UCR  and  IEEE-UCR  will be hosting an Arduino workshop this coming week!   They will be teaching you how to use an Arduino to work on hands-on projects throughout the workshop. Knowing how to use an Arduino is a handy skill for making hackathon projects, senior design, personal projects, costumes, and much more!  ...  RSVP at  ucrlibrary.eventbrite.com !  We can't wait to see you guys there!  😄   See More Cutie Hack October 25, 2019  ·  🚨   🚨   🚨  WEE WOO WEE WOO  🚨   🚨   🚨  If you're on the edge on whether or not to go to Cutie Hack, then think fast! Applications are closing TODAY, OCTOBER 25TH at 11:59PM for everyone. When in doubt, just apply! You never know what you'll be thinking a day later when applications are closed.  If you applied last Friday, we recently released acceptances so check your emails! Have a wonderful Friday  :) Cutie Hack October 18, 2019  ·  Want to experience Cutie Hack but don’t have time to hack all day?   Volunteer! You can sign up as a volunteer or mentor at cutiehack.io, help us run this great hackathon! Cutie Hack October 17, 2019  ·  Hey everyone, quick reminder that early bird applications close TOMORROW! Go apply at cutiehack.io!  🌊 🐬 Cutie Hack October 7, 2019  ·  We're excited to announce that Cutie Hack 2019 is now underway!  🌊 🌊  Our beginner friendly, 12-hour hackathon will take place on November 9th from 7 AM - 11 PM at Winston Chung Hall. People of all skill levels are encouraged to come (however this hacakthon is exclusive to only UCR and RCC students).   Don't miss this awesome opportunity to create an awesome project, attend workshops from UCR's best, and of course enjoy some free food!  😄 ...  To apply please fill out the application at:  https://cutiehack.io/  The deadline to apply is October 18th at 11:59 PM, so don’t wait to apply! We hope to see you all soon!   See More Cutie Hack  added an  event . October 7, 2019  ·  SAT, NOV 9, 2019 Cutie Hack 2019 Winston Chung Hall (EBU II)  ·  Riverside Other  · 199 people Cutie Hack  updated their profile picture. October 7, 2019  ·  Cutie Hack  updated their cover photo. October 7, 2019  ·  Cutie Hack May 30, 2019  ·  Hey all!  If you haven’t heard already, we at Citrus Hack are currently looking for leads for 2019-2020!  🤩   If you are interested in spearheading next year’s Cutie Hack and Citrus Hack, check out the link below. The available positions are operations  📝 , marketing  📣 , sponsorship  💰 , and web development  💻 . This is a really great opportunity to grow your technical and leadership skills. For any questions, comments, or concerns, please email citrushack@gmail.com  🍊   http://bit.ly/citrusleads2020 Hello applicant! Thank you for your interest in becoming a Citrus Hack lead!! Below are the description of every position that is available. As a lead, you and your ideas will directly shape the Citrus Hack experience for hundreds of participants. It is an amazing opportunity and we hope that Citrus... docs.google.com Citrus Hack 2019 - 2020 Leads Application Hello applicant! Thank you for your interest in becoming a Citrus Hack lead!! Below are the description of every position that is available. As a lead, you and your ideas will directly shape the Citrus Hack experience for hundreds of participants. It is an amazing opportunity and we hope that Citrus... Hello applicant! Thank you for your interest in becoming a Citrus Hack lead!! Below are the description of every position that is available. As a lead, you and your ideas will directly shape the Citrus Hack experience for hundreds of participants. It is an amazing opportunity and we hope that Citrus... Cutie Hack March 4, 2019  ·  Come out to Citrus Hack in the spring! It looks like you may be having problems playing this video. If so, please try restarting your browser. Close 💻 We’re in… Citrus Hack 2019 💻 Posted by  Citrus Hack 476 Views 476 Views Citrus Hack March 4, 2019 💻  We’re in… Citrus Hack 2019 is coming your way and ready to hack the future!  Applications for Citrus Hack 2019, which takes place April 26-28, 2019 at UCR, are ...  now live until March 30th (April 6th for UCR students).  Apply Here →  https://www.citrushack.com/   🌃 🍊  FOLLOW US ON SOCIAL MEDIA  🍊 🌃  Facebook →  https://www.facebook.com/CitrusHack/  Instagram →  https://www.instagram.com/citrushack_ucr/  Twitter →  https://twitter.com/CitrusHack  Linkedin →  https://www.linkedin.com/in/citrushack/   See More Cutie Hack February 23, 2019  ·  🤔 It looks like you may be having problems playing this video. If so, please try restarting your browser. Close Something is coming... Posted by  Citrus Hack 612 Views 612 Views Citrus Hack February 23, 2019 👀 👀 👀 See More \n \n \n"
}