{
    "docno": "RJP625",
    "url": "https://www.facebook.com/gngmarketingagency/posts",
    "text": "\n Gamea & Gamea - Branding and Digital Marketing Agency - Posts | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home About Photos Services Reviews Community Posts See more of Gamea & Gamea - Branding and Digital Marketing Agency on Facebook Log In or Create New Account See more of Gamea & Gamea - Branding and Digital Marketing Agency on Facebook Log In Forgot account? or Create New Account Not Now Visitor Posts Nada Gamea October 15, 2020 at 4:03 PM A few days late but started a business with my bro! We appreciate ev ... eryone's love and support! Like and follow  Gamea & Gamea Marketing and Branding  and comment on what kind of content you'd like to see!   See More Academy for Career and Education Development October 15, 2020 at 11:37 AM I will be reviving the company with a new domain name, and a profess ... ional website under the services of  Gamea & Gamea Marketing and Branding  from the beginning of the new year. Please go to  www.ACEDGuidance.com  to request any career and educational services needed.   See More English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 Gamea & Gamea - Branding and Digital Marketing Agency  updated their cover photo. March 6  ·  Gamea & Gamea - Branding and Digital Marketing Agency  updated their profile picture. December 4, 2020  ·  Gamea & Gamea - Branding and Digital Marketing Agency  updated their cover photo. November 8, 2020  ·  Gamea & Gamea - Branding and Digital Marketing Agency October 20, 2020  ·  Tuesday Tip:   Don’t be so dang self centered, it’s not all about you!   Go right now and replace any instance of “I/My/Our” in your copywriting with “You.” Talk about what value your business provides for others, not what others can do for your business. You’ll sound less like a beggar, and more like a problem solver. Gamea & Gamea - Branding and Digital Marketing Agency October 19, 2020  ·  Is your business/organization struggling to scrape by?! This is probably one of the biggest reasons why! Read on...   Even before Covid-19 reminded us how broken the healthcare system is, many non-profits and businesses were struggling to make ends meet. The reality is many businesses and non-profits have defaulted to being copy paste brands of other larger businesses and organizations within their niche. They lack identity, enthusiasm, and recognition. Why purchase RC Cola wh ... en you can get a can of Pepsi down the aisle for the same price?   We help you identify your unique qualities, properly message the value that you bring, and help you market to the people most likely to buy and donate. There’s no need to sack your ideas when you’ve been playing from behind from minute one.   Share with a friend or non-profit that could use the help!   If you're interested in our branding and marketing services visit:  www.gngmarketing.org/contact  OR   Email: info@gngmarketing.org    Stay tuned for more daily marketing and branding tips that help bring power to your message so you can bring power to the people!   See More Gamea & Gamea Marketing & Branding (G&G) is a full-service marketing and branding agency tailored to growing your business while boosting its social impact. Whether you're a start-up, a start-up, or an established business, we're here to lend a hand. We Give Power To Your Message, So gngmarketing.org Home | Gamea & Gamea Marketing and Branding Gamea & Gamea Marketing & Branding (G&G) is a full-service marketing and branding agency tailored to growing your business while boosting its social impact. Whether you're a start-up, a start-up, or an established business, we're here to lend a hand. We Give Power To Your Message, So Learn More Gamea & Gamea Marketing & Branding (G&G) is a full-service marketing and branding agency tailored to growing your business while boosting its social impact. Whether you're a start-up, a start-up, or an established business, we're here to lend a hand. We Give Power To Your Message, So Gamea & Gamea - Branding and Digital Marketing Agency October 14, 2020  ·  The meaning of our logo:   Our logo is central to our identity as an agency. Everything in the logo was deliberately selected to represent the image we wanted to convey. The name Gamea means to unite in Arabic, and so we wanted to create a logo that seamlessly connected/united multiple concepts together. The logomark is made up of 2 letter G's, one uppercase and one lower case g (bonus points if you can point them out  😉 ). They combine together with a power sign that represents ...  our tagline, \"We Give Power to Your Message, So You Can Give Power To The People.\"   The blue color represents our reliability to provide impactful work and stability, while the fuchsia represents our rebellious nature and exciting youthful energy that challenges the norms of how businesses do marketing. The circular nature of the logo exemplifies our desire to focus our work on strengthening communities and promoting social good. If you look close enough you can also catch a smile  🙂 .   When we make logos for our clients they are just as detailed and meticulous as when we make our own. Everything we do is with purpose. If you'd like a logo made with the care and thoughtfulness that it deserves, then you'd be doing yourself a great favor by reaching out to us! It'll be the best decision you made since shutting off the TV 5 minutes into the last presidential debate. That's a promise.  Let us know what you think of our logo!   Get your logo designed along with a whole brand identity package now:  https://gngmarketing.org/contact  See what other services we offer:  gngmarketing.org/services  Email us: info@gngmarketing.org  Or   Call us: 917-607-8712   See More Gamea & Gamea - Branding and Digital Marketing Agency October 13, 2020  ·  Gamea & Gamea - Branding and Digital Marketing Agency updated their phone number. Call Now Gamea & Gamea - Branding and Digital Marketing Agency October 13, 2020  ·  We're grateful and happy to announce the launch of Gamea & Gamea Marketing and Branding!   Gamea & Gamea Marketing (G&G) is a full-service marketing and branding partnership between, Hossam Gamea (brother) and Nada Gamea (sister). Hailing from New York City, we’ve spent over 10 years on the ground working as activists, uplifting our communities, and building grassroots movements. In that time, we’ve designed, branded, and marketed for several local non-profits, businesses, and ...  entrepreneurs. From international online campaigns, to extensive branding and re-branding projects, to having our work hoisted up on a billboard in Times Square; if you’ve thunk it, we’ve probably done it.  Inspired by our surname, which means to unite; we unite the vision with awesome visuals, the profit motive with a purpose, the creativity with a cause, and the marketing with a movement. To give businesses, non-profits, and start-ups that care about more than the bottom line, the spotlight they deserve. The spotlight YOU deserve. To boost your message with that extra umph it needs. So we can give the people what they want. What they deserve. Together.  Check out our website:  www.gngmarketing.org    Shoot us an email: info@gngmarketing.org  Like and follow our page to stay up to date on the latest trends, deals, and projects!   Share with friends, family, and coworkers!   # Marketing   # Branding   # Business   # Nonprofit   # Design   See More Gamea & Gamea Marketing & Branding (G&G) is a full-service marketing and branding agency tailored to growing your business while boosting its social impact. Whether you're a start-up, a start-up, or an established business, we're here to lend a hand. We Give Power To Your Message, So gngmarketing.org Home | Gamea & Gamea Marketing and Branding Gamea & Gamea Marketing & Branding (G&G) is a full-service marketing and branding agency tailored to growing your business while boosting its social impact. Whether you're a start-up, a start-up, or an established business, we're here to lend a hand. We Give Power To Your Message, So Learn More Gamea & Gamea Marketing & Branding (G&G) is a full-service marketing and branding agency tailored to growing your business while boosting its social impact. Whether you're a start-up, a start-up, or an established business, we're here to lend a hand. We Give Power To Your Message, So Gamea & Gamea - Branding and Digital Marketing Agency October 9, 2020  ·  Gamea & Gamea - Branding and Digital Marketing Agency updated their phone number. Call Now Gamea & Gamea - Branding and Digital Marketing Agency October 9, 2020  ·  Gamea & Gamea - Branding and Digital Marketing Agency updated their business hours. Contact Us Gamea & Gamea - Branding and Digital Marketing Agency October 9, 2020  ·  Gamea & Gamea - Branding and Digital Marketing Agency updated their website address. Learn More \n \n \n"
}