{
    "docno": "RJP657",
    "url": "https://www.facebook.com/rosehackucr/posts",
    "text": "\n Rose Hack - Posts | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home Posts Reviews Videos Photos Events About Community See more of Rose Hack on Facebook Log In or Create New Account See more of Rose Hack on Facebook Log In Forgot account? or Create New Account Not Now Visitor Posts Ang Li-Lian January 19 at 4:13 PM *Winner of Rose Hack 2021!*\nI am proud to share that my team was cho ... sen as the winner for  Rose Hack  for our mobile app GUARDIAN. I am grateful to the Rose Hack team and  Major League Hacking  for giving us the opportunity and resources to crunch through 24 hours.\n\n\"GUARDIAN is always by your side. The app is designed to empower women through accessible SOS features, alerts to contacts and quick directions to safe places. With GUARDIAN, you'll never walk alone.\"\n\nI was in charge of designing the prototype of the app on Figma and built a REST API with Flask and Google Maps API that directs users to a safe place. I had no clue how an API was before this and even if we didn't win a Nintendo Switch, I would have walked away with fantastic friends and improved coding skills!\n\nAli Akber, Tejaswini Edidi and I hope to build a fully functioning version of the app in the coming months, so that it will become available on the app store. In the meantime, you can check out: \n- Our app prototype  https://www.figma.com/…/dUWea…/Guardian… \n- Our devpost  https://devpost.com/sof…/guardian-gp83ix   See More Thang Bom January 17, 2020 at 7:24 PM would you please let me know the event starting at 11:am or 9:am.  E ... tc, what would I do when I get there by 9 AM.  Thanks.   I have 2-2:30h drive   See More Major League Hacking January 9, 2020 at 2:16 PM UC Riverside 's female-founded, women-centric hackathon  Rose Hack  ret ... urns next week!\nCome for a lively weekend of innovation, face masks, discovering and creating new technology, networking, mentorship, and much more!\nJanuary 18th-19th\n https://rosehack.com/   See More English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 Rose Hack April 6  ·  Interested in planning a hackathon or helping underrepresented groups in tech build a strong network? Apply to be a Rose Hack 2022 Lead ASAP through the link in our flyer or through our website  rosehack.com.  Applications are due (end of Week 3) April 17th at 11:59 PM.  🌹 Rose Hack February 16  ·  Rose Hack 2021 would not have been possible without the help from our wonderful sponsors!   We would like to say a HUGE thank you to everyone who sponsored Rose Hack 2021 this year! We appreciate your constant support and for helping us promote our mission through our hackathon!  🥰 🎉 ❤️ Rose Hack February 16  ·  It has officially been a month since Rose Hack 2021 ended and we couldn’t be more grateful with how everything turned out!  🥰  .  First, we would like to thank our participants for joining us the whole weekend! Thank you for being patient with us as we learned to navigate this new virtual hackathon experience! We hope that you had fun and learned a lot through the projects you built and the workshops you attended!  😁 💕  .  We would like to also thank our judges, mentors, workshop le ... ads, and organizers who helped make this event possible! We are beyond grateful for each and every one of you! This event would not be possible without your time and contribution!  ❤️  .  We hope that you all had as much fun as we did and we hope to see you all again next year!  😉 ✨   See More Rose Hack January 14  ·  Quick reminder that Rose Hack 2021 RSVPs are DUE TODAY!! You can find the RSVP link in your acceptance email! See you all this weekend!  ☺️ ✨ Rose Hack January 13  ·  ‧͙⁺˚*･༓ 𝐌𝐄𝐄𝐓 𝐓𝐇𝐄 𝐋𝐄𝐀𝐃𝐒 ༓･*˚⁺‧͙  .  .  Hi! My name is Ruth and I am a 3rd year Computer Science w/ Business applications major. I’m a Rose Hack Director along w/ Crystal!  👯‍♀️ We make sure that everything is running smoothly and ready to launch by its deadline, whether it’s a flyer, website, shipping out Rose Hack themed swag, or reaching our sponsorship goal. I love this event and I want you all to love it too!  🥰  . ...  .  ｡･::･ﾟ☆ What is a dream that you have? ｡･::･ﾟ☆  I really want to spend a year in Korea! I miss my family there a lot, and I would love to spend more time with my grandma and learn to cook from her. Living on my own made me realize how great food tastes when it’s cooked with love.  🥰   See More Rose Hack  added an  event . January 11  ·  THU, JAN 14 IDE Workshop (Hosted by ACM) Online Event Rose Hack  added an  event . January 11  ·  WED, JAN 13 Pitching Projects (Hosted by WinC) Online Event Rose Hack January 11  ·  Rose Hack 2021 is 5 DAYS away!  🌹  In preparation for the hackathon, we have prepared workshops this entire week to help you and your team prepare for this weekend!  😎 ✨  Check out the zoom links in our events section! See you all there!  💕 Rose Hack  added an  event . January 10  ·  FRI, JAN 15 Mixer Online Event Rose Hack  added an  event . January 10  ·  TUE, JAN 12 Intro to Github (Hosted by SWE) Online Event Rose Hack January 9  ·  🚨  APPLICATIONS ARE DUE TONIGHT AT 11:59 PM!!  This is the LAST CHANCE to apply to Rose Hack 2021 and you can APPLY NOW at  rosehack.com ! We’re excited to bring you a new hackathon experience virtually! It’s an event you don’t want to miss!  😎 🌹 ✨ Rose Hack January 8  ·  🚨  1 DAY UNTIL APPLICATIONS ARE DUE!!  This is the LAST CHANCE to apply to Rose Hack 2021! We won’t be accepting applications after January 9th! APPLY NOW at  rosehack.com ! It will be a fun weekend of workshops, activities, networking, and learning! We have so much for you in store and can’t wait to see you all virtually!  😎 🌹 ✨ Rose Hack January 7  ·  🚨  2 DAYS UNTIL APPLICATIONS ARE DUE!!  We won’t be accepting applications after January 9th so make sure to APPLY NOW at  rosehack.com  & share with anyone who might be interested!  🌹 ✨ Rose Hack January 6  ·  🚨  3 DAYS UNTIL APPLICATIONS ARE DUE!!  You can APPLY NOW at  rosehack.com ! 🌹 ✨ Rose Hack January 5  ·  Ready for the SWExRose Hack collab of the year? Our first pre-event workshop, Build and Deploy Your First Website, is TONIGHT @ 7-8 PM!!!    https://ucr.zoom.us/j/91247070191 ucr.zoom.us Join our Cloud HD Video Meeting Zoom is the leader in modern enterprise video communications, with an easy, reliable cloud platform for video and audio conferencing, chat, and webinars across mobile, desktop, and room systems. Zoom Rooms is the original software-based conference room solution used around the world in board, confer... Zoom is the leader in modern enterprise video communications, with an easy, reliable cloud platform for video and audio conferencing, chat, and webinars across mobile, desktop, and room systems. Zoom Rooms is the original software-based conference room solution used around the world in board, confer... Rose Hack January 5  ·  MON, JAN 11 How to Virtual Hackathon Workshop Online Event 2 people went Rose Hack  added an  event . January 5  ·  MON, JAN 11 How to Virtual Hackathon Workshop Online Event 2 people went Rose Hack January 5  ·  Now it's easier to sign up for Rose Hack's updates. Sign Up Rose Hack January 5  ·  🚨  4 DAYS UNTIL APPLICATIONS ARE DUE!!  APPLY NOW at  rosehack.com !  🌹 ✨  You don’t wanna miss out on this amazing opportunity!  ☺️  .  .   📸 : Countdown post created by our amazing committee member Crystal Feng! See More \n \n \n"
}