{
    "docno": "RJP607",
    "url": "https://www.facebook.com/sigcse2021/posts",
    "text": "\n Sigcse Technical Symposium 2021 - Posts | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home Reviews About Photos Posts Community See more of Sigcse Technical Symposium 2021 on Facebook Log In or Create New Account See more of Sigcse Technical Symposium 2021 on Facebook Log In Forgot account? or Create New Account Not Now Visitor Posts Becky Bates March 20 at 6:49 PM Here are the books and stories for  # SIGCSEReads  this coming year:\n\nW ... e have two excellent short stories that bring new voices into our mix: “Welcome to Your Authentic Indian Experience(TM)” by Rebecca Roanhorse and “Poems and Distant Lands” by Gu Shi (translated by Ken Liu). \n\nBy popular vote, we have Parable of the Sower by Octavia E. Butler.\n\nFor our non-fiction option, we are looking back at some of the history of computing with a memoir: Think Black by Clyde W. Ford. \n\nWe hope you enjoy these at some point in the coming year.  If you want other suggestions, you can find what we read in past years here:   https://sigcse.org/…/resourc…/reads.html .   See More Bettina Bair March 15 at 6:52 AM The SIGCSE Technical Symposium has started. Did you find and downloa ... d your Free Drink ticket yet?  Sigcse Technical Symposium 2021   See More UNH Manchester February 2 at 7:42 AM Computer science faculty Mihaela Sabin and Karen Jin have had their  ... research accepted at the  Sigcse Technical Symposium 2021 , the largest computing education conference worldwide. Congratulations, professors!   See More English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 Sigcse Technical Symposium 2021 March 14  ·  🎉 🎉 🎉  And..WE ARE LIVE  # SIGCSE2021  Opening Celebration is starting now!    https://pathable.sigcse2021.org/meetings/…/ZBmtLFtteBkpwzRjo  Join us to hear from your conference team, members of the SIGCSE Board and of course a panel Artificial Intelligence and Real Justice, Moderated by Kamau Bobb from @Google!! pathable.sigcse2021.org pathable.sigcse2021.org Sigcse Technical Symposium 2021 March 4  ·  Grab your morning  ☕️  and join our chairs for the first episode of  # SIGCSE2021  Morning Coffee!   https://www.youtube.com/watch?v=k5t14FNc5b0  We'll be sharing short episodes through March 20th! We'll give you session highlights, conference updates, and speak to members of the community. Welcome to SIGCSE Morning Coffee - a show all about what's going on at the 2021 SIGCSE Technical Symposium! youtube.com SIGCSE Morning Coffee - Welcome to SIGCSE TS 2021! Welcome to SIGCSE Morning Coffee - a show all about what's going on at the 2021 SIGCSE Technical Symposium! Welcome to SIGCSE Morning Coffee - a show all about what's going on at the 2021 SIGCSE Technical Symposium! Sigcse Technical Symposium 2021 March 3  ·  Heads up,  # SIGCSE2021  attendees! The Android app for the symposium is now live in the Google Play store:    https://play.google.com/store/apps/details…  An iOS app is coming soon, and we'll let you know when it's out. SIGCSE 2021 Sigcse Technical Symposium 2021 March 1  ·  The Pathable site for  # SIGCSE2021  is live! Check your email for login information and start planning your schedule! Sigcse Technical Symposium 2021 February 22  ·  Have you checked out the great workshops at  # SIGCSE2021 ? There are three sessions of workshops on Saturday and Sunday. Which workshop are you most looking forward to attending?  http://sigcse2021.sigcse.org/schedule/workshops/ Back to Top Workshops will take place duing these time blocks: Workshop Block 1 - Saturday, March 13 @ 9:00 AM-12:00 PM (ET) Workshop Block 2 - Saturday, March 13 @ 1:00 PM-4:00 PM (ET) Workshop Block 3 - Sunday, March 14 @ 1:00 PM-4:00 PM (ET) How to register for workshops : Workshops are a part of... sigcse2021.sigcse.org Workshop Schedule Back to Top Workshops will take place duing these time blocks: Workshop Block 1 - Saturday, March 13 @ 9:00 AM-12:00 PM (ET) Workshop Block 2 - Saturday, March 13 @ 1:00 PM-4:00 PM (ET) Workshop Block 3 - Sunday, March 14 @ 1:00 PM-4:00 PM (ET) How to register for workshops : Workshops are a part of... Back to Top Workshops will take place duing these time blocks: Workshop Block 1 - Saturday, March 13 @ 9:00 AM-12:00 PM (ET) Workshop Block 2 - Saturday, March 13 @ 1:00 PM-4:00 PM (ET) Workshop Block 3 - Sunday, March 14 @ 1:00 PM-4:00 PM (ET) How to register for workshops : Workshops are a part of... Sigcse Technical Symposium 2021 February 19  ·  Platinum Supporter Google has tools that can be used both in the classroom and to support CS Ed research. You can learn more about how Google is supporting CS teachers at four different sessions:  http://sigcse2021.sigcse.org/schedule/supportersessions/   https://edu.google.com/code-with-google/ Back to Top Platinum Supporter GitHub Education Using GitHub for Multi-College Collaborative Undergraduate Research Tuesday, March 16 / 3:00 PM (ET) - 4:15 PM (ET) Presenters : Amos Johnson (Morehouse College) Virginia Tech and Morehouse College are currently in the second semester of a Vertically I... sigcse2021.sigcse.org Supporter Sessions Schedule Back to Top Platinum Supporter GitHub Education Using GitHub for Multi-College Collaborative Undergraduate Research Tuesday, March 16 / 3:00 PM (ET) - 4:15 PM (ET) Presenters : Amos Johnson (Morehouse College) Virginia Tech and Morehouse College are currently in the second semester of a Vertically I... Back to Top Platinum Supporter GitHub Education Using GitHub for Multi-College Collaborative Undergraduate Research Tuesday, March 16 / 3:00 PM (ET) - 4:15 PM (ET) Presenters : Amos Johnson (Morehouse College) Virginia Tech and Morehouse College are currently in the second semester of a Vertically I... Sigcse Technical Symposium 2021 February 18  ·  Only 10 days left for regular registration for the SIGCSE 2021 Technical Symposium! Register now at:  https://web.cvent.com/…/052cb55d-b461-4cae-9f84-c72…/summary web.cvent.com SIGCSE 2021 Technical Symposium SIGCSE 2021 Technical Symposium. Online registration by Cvent SIGCSE 2021 Technical Symposium. Online registration by Cvent Sigcse Technical Symposium 2021 February 17  ·  Learn about Micro:bit, MakeCode, Quantum Computing and more at Supporter Sessions hosted by Platinum Supporter Microsoft  https://microsoft.com/en-us/  Thank you to all our supporters who help make  # SIGCSE2021  possible! microsoft.com Microsoft - Official Home Page At Microsoft our mission and values are to help people and businesses throughout the world realize their full potential. At Microsoft our mission and values are to help people and businesses throughout the world realize their full potential. Sigcse Technical Symposium 2021 February 15  ·  Thank you to Platinum Sponsor GitHub Education!  http://education.github.com  Make a plan to check out their sessions Tuesday, March 16 and Thursday March 18 both at 3:00 PM (ET). Learn how to use GitHub in the classroom and for undergraduate research!  Learn more about these and other supporter sessions at the SIGCSE TS Schedule  https://sigcse2021.sigcse.org/schedule/supportersessions/ Teach and learn better, together. Learn to ship software like a pro. education.github.com Discounted and free plans are available for educational use Teach and learn better, together. Learn to ship software like a pro. Teach and learn better, together. Learn to ship software like a pro. Sigcse Technical Symposium 2021 January 15  ·  Registration is now open for the  # SIGCSE2021  Technical Symposium. See you there!   http://sigcse2021.org/register web.cvent.com SIGCSE 2021 Technical Symposium SIGCSE 2021 Technical Symposium. Online registration by Cvent SIGCSE 2021 Technical Symposium. Online registration by Cvent Sigcse Technical Symposium 2021 October 12, 2020  ·  Save the date!   # SIGCSE2021  is now March 13-20, 2021! We can't wait too see the  # CSEd  community online!  Checkout the full schedule below, along with some thoughts about how it came to be:   http://sigcse2021.sigcse.org/schedule/ The SIGCSE Technical Symposium is a forum for educators and researchers to share new results and insights around developing, implementing, or evaluating computing programs, curricula, and courses. sigcse2021.sigcse.org Official Schedule for SIGCSE TS 2021 The SIGCSE Technical Symposium is a forum for educators and researchers to share new results and insights around developing, implementing, or evaluating computing programs, curricula, and courses. The SIGCSE Technical Symposium is a forum for educators and researchers to share new results and insights around developing, implementing, or evaluating computing programs, curricula, and courses. Sigcse Technical Symposium 2021  updated their profile picture. October 12, 2020  ·  Sigcse Technical Symposium 2021  updated their cover photo. September 30, 2020  ·  Sigcse Technical Symposium 2021 August 28, 2020  ·  Heads up  # SIGCSE2021  Authors! All \"Round 1\" submissions, Papers, Panels, Special Sessions, Workshops, are due TONIGHT, 23:59 AoE in EasyChair.   Get the details on the SIGCSE website:  http://sigcse2021.sigcse.org/authors/ The SIGCSE Technical Symposium is a forum for educators and researchers to share new results and insights around developing, implementing, or evaluating computing programs, curricula, and courses. sigcse2021.sigcse.org Information for Authors for SIGCSE TS 2021 The SIGCSE Technical Symposium is a forum for educators and researchers to share new results and insights around developing, implementing, or evaluating computing programs, curricula, and courses. The SIGCSE Technical Symposium is a forum for educators and researchers to share new results and insights around developing, implementing, or evaluating computing programs, curricula, and courses. Sigcse Technical Symposium 2021 August 21, 2020  ·  🚨 🚨 Final Reminder!   # SIGCSE2021  Paper Abstracts are due in EasyChair in just under 24 hours!    https://sigcse2021.sigcse.org/authors/papers/ ...  Other Round 1 Submissions (Panels, Workshops and Special Sessions) are due in 1 week, August 28th at 23:59 AoE.   See More Sigcse Technical Symposium 2021 August 17, 2020  ·  Don't forget! There's just a few days left to prepare your paper abstracts for  # SIGCSE2021 ! Abstracts are due at 23:59 this Friday 8/21.  All paper info can be found on our website:   http://sigcse2021.sigcse.org/authors/papers/ Now accepting submissions! Abstract Due Date Friday, August 21, 2020 Abstract Due Time 23:59 AoE (Anywhere on Earth, UTC-12h) Date Due Friday, August 28, 2020 Time Due 23:59 AoE (Anywhere on Earth, UTC-12h) Submission Limits 6 pages + 1 page for references Submission Link SIGCSE TS 2021 Submission v... sigcse2021.sigcse.org Paper Submission Information for Authors for SIGCSE TS 2021 Now accepting submissions! Abstract Due Date Friday, August 21, 2020 Abstract Due Time 23:59 AoE (Anywhere on Earth, UTC-12h) Date Due Friday, August 28, 2020 Time Due 23:59 AoE (Anywhere on Earth, UTC-12h) Submission Limits 6 pages + 1 page for references Submission Link SIGCSE TS 2021 Submission v... Now accepting submissions! Abstract Due Date Friday, August 21, 2020 Abstract Due Time 23:59 AoE (Anywhere on Earth, UTC-12h) Date Due Friday, August 28, 2020 Time Due 23:59 AoE (Anywhere on Earth, UTC-12h) Submission Limits 6 pages + 1 page for references Submission Link SIGCSE TS 2021 Submission v... Sigcse Technical Symposium 2021 August 13, 2020  ·  We have a big announcement! A quick announcement and message from the SIGCSE TS 2021 leadership team! Remember: Paper abstracts are due Friday, August 21 with all Round 1 submissions du... youtube.com SIGCSE TS 2021 - Announcement! A quick announcement and message from the SIGCSE TS 2021 leadership team! Remember: Paper abstracts are due Friday, August 21 with all Round 1 submissions du... A quick announcement and message from the SIGCSE TS 2021 leadership team! Remember: Paper abstracts are due Friday, August 21 with all Round 1 submissions du... Sigcse Technical Symposium 2021  updated their status. July 10, 2020  ·  Sigcse Technical Symposium 2021 January 15, 2020  ·  Reminder! There's just two weeks for early registration for  # SIGCSE2020 !  http://sigcse2020.org/register    Join us in Portland from March 11-14 for an exciting week of  # CSEducation !   Check out the full program at  http://sigcse2020.org/schedule cvent.com HttpsGuard See More \n \n \n"
}