{
    "docno": "RJP696",
    "url": "https://fr-fr.facebook.com/privacy/explanation",
    "text": "\n Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n Aller vers Sections de cette Page Aide accessibilité Facebook Adresse e-mail ou mobile Mot de passe Informations de compte oubliées ? S’inscrire Politique complète d’utilisation des données  Le California Consumer Privacy Act est en vigueur depuis le 1er janvier 2020. Les résidents de Californie peuvent en apprendre davantage sur le respect de la vie privée  ici .  Contrôles publicitaires Facebook   Privacy Basics   Politique d’utilisation des cookies   Conditions générales  Ressources supplémentaires  Voir une version imprimable de la Politique d’utilisation des données   Outils interactifs   Personnes mineures et sécurité   Page relative à la confidentialité sur Facebook   Page relative à la sécurité de Facebook   Page relative à la gouvernance du site Facebook   Avis sur le bouclier de protection des données UE-États-Unis et sur le bouclier de protection des données Suisse-États-Unis  Politique d’utilisation des données La présente politique décrit les informations que nous traitons pour le fonctionnement de Facebook, Instagram, Messenger et d’autres fonctionnalités et produits proposés par Facebook (les  Produits Facebook  ou les Produits). Vous trouverez des outils et des informations supplémentaires dans les  Paramètres Facebook  et les  Paramètres Instagram . Revenir en haut  Quels types d’informations recueillons-nous ?   Pour fournir les Produits Facebook, nous devons traiter des informations vous concernant. Les types d’informations que nous recueillons dépendent de la manière dont vous utilisez nos Produits. Apprenez comment accéder aux informations que nous recueillons et comment les supprimer en consultant les  Paramètres Facebook  et les  Paramètres Instagram .  Ce que vous et d’autres personnes faites et fournissez. Informations et contenus que vous fournissez.  Nous recueillons le contenu, les communications ainsi que d’autres informations que vous fournissez lorsque vous utilisez nos Produits, notamment lorsque vous créez un compte, lorsque vous créez ou partagez du contenu, ou lorsque vous communiquez avec d’autres personnes ou leur envoyez des messages. Cela peut comprendre des informations présentes dans le contenu que vous fournissez (par exemple, des métadonnées) ou concernant un tel contenu, telles que le lieu d’une photo ou la date à laquelle un fichier a été créé. Cela peut également comprendre ce que vous voyez au moyen des fonctionnalités que nous fournissons, telles que notre  appareil photo , de sorte que nous puissions proposer des masques et des filtres que vous pourriez aimer ou vous donner des conseils sur l’utilisation des formats de l’appareil photo. Nos systèmes traitent automatiquement le contenu et les communications que vous et d’autres fournissez afin d’analyser le contexte et ce qu’ils contiennent aux fins décrites  ci-dessous . Apprenez-en davantage sur la manière de gérer les personnes qui peuvent accéder aux éléments que vous  partagez .  Données bénéficiant de protections spéciales : vous pouvez choisir de fournir des informations dans les  champs de votre profil  Facebook ou dans des évènements marquants à propos de vos croyances religieuses, de vos opinions politiques, des personnes par lesquelles vous êtes « intéressé(e) » ou de votre santé. Ces informations et d’autres (telle que l’origine ethnique, les croyances philosophiques ou l’affiliation à un syndicat professionnel) pourraient être soumises à des protections spéciales conformément à la législation de votre pays. Réseaux et connexions.  Nous recueillons des informations sur les personnes, les  Pages , les comptes, les  hashtags  et les groupes avec lesquels vous êtes en contact, ainsi que la manière dont vous interagissez avec eux sur nos Produits, par exemple, les personnes avec lesquelles vous communiquez le plus ou les groupes dont vous faites partie. Nous collectons également des coordonnées si vous  choisissez de les télécharger, de les synchroniser ou de les importer à partir d’un appareil  (par exemple, un carnet d’adresses, un journal d’appels ou un historique des SMS), que nous utilisons, par exemple, pour vous aider, vous et d’autres, à trouver des personnes que vous pourriez connaître et à d’autres fins indiquées  ci-dessous . Votre utilisation.  Nous recueillons des informations concernant la manière dont vous utilisez nos Produits, telles que les types de contenu que vous consultez ou avec lesquels vous interagissez, les fonctionnalités que vous utilisez, les actions que vous réalisez, les personnes ou les comptes avec lesquels vous interagissez, et l’heure, la fréquence et la durée de vos activités. Par exemple, nous enregistrons quand vous utilisez et quand vous avez utilisé pour la dernière fois nos Produits, ainsi que les publications, les vidéos ou tout autre contenu que vous visualisez sur nos Produits. Nous recueillons également des informations sur la manière dont vous utilisez des fonctionnalités telles que notre appareil photo. Informations à propos des transactions réalisées sur nos Produits.  Si vous utilisez nos Produits pour effectuer des  achats  ou toute autre transaction financière (par exemple, lorsque vous effectuez un achat dans un jeu ou lorsque vous faites un  don ), nous recueillons des données concernant cet achat ou cette transaction. Ceci comprend vos informations de paiement, telles que le numéro de votre carte de crédit ou de débit et d’autres informations concernant votre carte, d’autres informations de compte et d’authentification, ainsi que des données de facturation et de livraison, et vos coordonnées. Les activités d’autres personnes et les informations qu’elles fournissent vous concernant.  Nous recevons et analysons également le contenu, les communications et les informations que d’autres personnes fournissent lorsqu’elles utilisent nos Produits. Il peut s’agir d’informations vous concernant, par exemple lorsque d’autres personnes partagent ou commentent une photo de vous, vous envoient un message, ou téléchargent, synchronisent ou importent vos coordonnées. Informations sur les appareils  Comme décrit ci-dessous, nous recueillons des informations concernant les ordinateurs, téléphones, téléviseurs connectés et autres appareils connectés au web que vous utilisez et qui s’intègrent à nos Produits et depuis lesdits appareils, et nous combinons ces informations sur les différents appareils que vous utilisez. Par exemple, nous utilisons les informations recueillies concernant votre utilisation de nos Produits sur votre téléphone afin de mieux personnaliser le contenu (notamment les  publicités ) ou les fonctionnalités qui s’affichent lorsque vous utilisez nos Produits sur un autre appareil, notamment votre ordinateur portable ou votre tablette, ou afin d’évaluer si vous avez effectué sur un appareil une action en réaction à une publicité que nous vous avions montrée sur un autre appareil.   Les informations que nous obtenons depuis ces appareils comprennent :  Attributs des appareils :  des informations telles que le système d’exploitation, les versions matérielles et logicielles, le niveau de batterie, l’intensité du signal, l’espace de stockage disponible, le type de navigateur, le nom et le type des applications et des fichiers, ainsi que les plugins. Activités sur l’appareil :  les informations concernant les opérations et les comportements sur l’appareil, par exemple, lorsqu’une fenêtre est mise au premier plan ou en arrière plan, ainsi que les mouvements de la souris (permettant de différencier les humains des bots). Identifiants :  les identifiants uniques, identifiants d’appareils et autres identifiants, notamment ceux provenant de jeux, d’applications ou de comptes que vous utilisez, et les identifiants d’appareils familiaux (ou autres identifiants propres aux  Produits des entités Facebook  associés à un même appareil ou compte). Signaux des appareils :  signaux Bluetooth et informations concernant les points d’accès Wi-Fi, les balises et les tours de télécommunication à proximité. Données issues des paramètres de l’appareil :  les informations que vous nous autorisez à recevoir par le biais des paramètres de l’appareil que vous activez, notamment l’accès à votre localisation GPS, à votre appareil photo ou à vos photos. Réseau et connexion :  des informations telles que le nom de votre opérateur mobile ou de votre fournisseur d’accès à Internet, votre langue, votre fuseau horaire, votre numéro de téléphone mobile, votre adresse IP, votre vitesse de connexion et, dans certains cas, des informations concernant d’autres appareils situés à proximité ou sur votre réseau afin que nous puissions, notamment, vous aider à  diffuser une vidéo à partir de votre téléphone sur votre téléviseur . Données issues des cookies :  données provenant des cookies enregistrés sur votre appareil, notamment les identifiants et paramètres des cookies. Pour en savoir plus sur notre utilisation des cookies, consultez la  Politique d’utilisation des cookies Facebook  et la  Politique d’utilisation des cookies Instagram . Informations fournies par les partenaires.  Les annonceurs, les développeurs d’ applications  et les éditeurs peuvent nous envoyer des informations au moyen des  Outils Facebook Business  qu’ils utilisent, notamment nos plugins sociaux (comme le bouton J’aime), Facebook Login, nos  API et SDK  ou le  pixel  Facebook. Ces partenaires communiquent des informations concernant vos activités en dehors de Facebook (notamment des informations concernant votre appareil, les sites web que vous consultez, les achats que vous effectuez, les publicités que vous voyez et votre utilisation de leurs services), que vous possédiez ou non un compte Facebook ou que vous soyez connecté(e) ou non à Facebook. Par exemple, un développeur de jeux pourrait utiliser notre API pour nous communiquer les jeux auxquels vous jouez, ou une entreprise pourrait nous informer d’un achat que vous avez effectué dans sa boutique. Nous recevons également des informations concernant vos actions et vos achats en ligne et hors ligne de la part de fournisseurs de données tiers autorisés à nous donner ces informations.   Les partenaires reçoivent vos données soit lorsque vous consultez ou utilisez leurs services, soit par l’intermédiaire de tiers avec lesquels ils travaillent. Nous exigeons que chaque partenaire soit légalement autorisé à recueillir, à utiliser et à partager vos données avant de nous les fournir.  Apprenez-en davantage  sur les types de partenaires qui nous fournissent des données.   Pour en savoir plus sur notre utilisation des cookies en lien avec les outils professionnels Facebook, consultez la  Politique d’utilisation des cookies Facebook  et la  Politique d’utilisation des cookies Instagram .  Revenir en haut  Comment utilisons-nous ces informations ?   Nous utilisons les informations à notre disposition (en fonction des choix que vous effectuez) de la façon décrite ci-dessous, afin de fournir et d’assurer le fonctionnement des Produits Facebook et les services associés décrits dans les  Conditions d’utilisation de Facebook  et les  Conditions d’utilisation d’Instagram . Voici de quelle façon :  Proposer, personnaliser et améliorer nos Produits.  Nous utilisons les informations à notre disposition pour fournir nos Produits, notamment pour en personnaliser les fonctionnalités et le contenu (notamment votre  Fil d’actualité , votre  Fil d’actualité Instagram , les Instagram Stories et les publicités) et pour vous faire des suggestions (comme des groupes ou des  évènements  susceptibles de vous intéresser ou des sujets que vous pourriez avoir envie de suivre) sur nos Produits et en dehors. Pour créer des Produits personnalisés à la fois uniques et pertinents, nous utilisons vos connexions, vos préférences, vos centres d’intérêt et vos activités à partir des données que nous recueillons, des informations que vous ou des tiers nous fournissez et d’autres renseignements (notamment les  données bénéficiant de protections spéciales  que vous choisissez de nous communiquer). Nous nous servons également des données concernant votre utilisation de nos Produits et vos interactions avec ceux-ci, ainsi que des données concernant les personnes, les lieux ou les éléments avec lesquels vous êtes connecté(e) ou qui vous intéressent sur nos Produits et en dehors. Apprenez-en davantage sur notre utilisation des informations vous concernant afin de personnaliser vos expériences Facebook et Instagram, notamment les fonctionnalités, le contenu et les recommandations figurant dans les Produits Facebook. Vous pouvez également en savoir plus sur notre manière de choisir les  publicités  que vous voyez.  Informations sur l’ensemble des Produits Facebook et des appareils :  nous relions les informations concernant vos activités sur les différents Produits Facebook et appareils afin de vous fournir une expérience plus personnalisée et plus cohérente sur l’ensemble des Produits Facebook que vous utilisez, quel que soit le support sur lequel vous les utilisez. Par exemple, nous pouvons vous suggérer de rejoindre un groupe Facebook qui rassemble des personnes que vous suivez sur Instagram ou avec qui vous communiquez à l’aide de Messenger. Nous pouvons également faire en sorte que votre expérience soit plus fluide, par exemple en remplissant automatiquement vos informations d’inscription (notamment votre numéro téléphone) à partir d’un Produit Facebook lorsque vous créez un compte sur un autre Produit. Informations géographiques :  nous utilisons des  informations géographiques  (comme votre position actuelle, le lieu où vous résidez, les endroits où vous aimez aller et les entreprises et personnes à proximité) afin de proposer, de personnaliser et d’améliorer nos Produits,  notamment les publicités , pour vous et les autres. Ces informations géographiques peuvent provenir notamment de l’emplacement précis des appareils (si vous nous avez autorisés à les recueillir), des adresses IP et des informations concernant votre utilisation (et celle des autres) des Produits Facebook (notamment vos visites ou les évènements auxquels vous participez). Recherche et développement des Produits :  Nous utilisons les informations à notre disposition pour développer, tester et améliorer nos Produits, notamment en réalisant des sondages et des recherches, et en testant et en dépannant les nouveaux produits et les nouvelles fonctionnalités. Reconnaissance faciale :  si vous avez activé cette fonctionnalité, nous utilisons la technologie de reconnaissance faciale pour vous identifier dans des photos, des vidéos et des expériences visuelles. Les modèles de reconnaissance faciale que nous créons peuvent constituer des  données bénéficiant de protections spéciales  en vertu de la législation de votre pays. Pour en savoir plus sur  notre utilisation de la technologie de reconnaissance faciale  ou sur le contrôle de notre utilisation de cette technologie, consultez les  Paramètres Facebook . Si nous intégrons la technologie de reconnaissance faciale à votre expérience Instagram, nous vous en informerons au préalable et vous pourrez décider si nous pouvons utiliser cette technologie à votre égard. Publicités et autres contenus sponsorisés :  nous utilisons les informations vous concernant à notre disposition (notamment les informations concernant vos centres d’intérêt, vos actions et vos connexions) pour sélectionner et pour personnaliser les publicités, les offres et les autres contenus sponsorisés que nous vous montrons. Pour en savoir plus sur la manière dont nous  sélectionnons et personnalisons les publicités , et sur les choix qui s’offrent à vous concernant les données que nous utilisons pour sélectionner les publicités et les autres contenus sponsorisés pour vous, consultez les  Paramètres Facebook  et les  Paramètres Instagram . Fournir des mesures, des analyses et d’autres services professionnels.  Nous utilisons les informations à notre disposition (notamment concernant votre activité ne concernant pas nos Produits, par exemple les sites web que vous consultez et les publicités que vous visualisez) pour aider les annonceurs et d’autres partenaires à mesurer l’efficacité et la diffusion de leurs publicités et de leurs services, et à comprendre les types de personnes qui utilisent leurs services et la façon dont ces personnes interagissent avec leurs sites web, leurs applications et leurs services.  Découvrez comment nous partageons les informations  avec ces partenaires.  Favoriser la sûreté, l’intégrité et la sécurité.  Nous utilisons les informations à notre disposition pour vérifier les comptes et les activités, pour lutter contre les comportements dangereux, pour détecter et prévenir le contenu indésirable et toutes autres expériences négatives, pour préserver l’intégrité de nos Produits et pour favoriser la sûreté et la sécurité sur les Produits Facebook et en dehors de ceux-ci. Par exemple, nous utilisons les données à notre disposition pour examiner toute activité suspecte ou toute violation de nos conditions ou de nos règlements, ou pour  détecter si une personne a besoin d’aide . Pour en savoir plus, consultez les  pages d’aide concernant la sécurité de Facebook  et les  conseils de sécurité relatifs à Instagram .  Communiquer avec vous.  Nous utilisons les informations à notre disposition pour vous envoyer des communications commerciales, vous parler de nos Produits et vous faire part de nos conditions et de nos règlements. Nous nous servons également de vos informations pour vous répondre lorsque vous nous contactez.  Faire de la recherche et innover pour le bien-être social.  Nous utilisons les informations à notre disposition (notamment celles de partenaires de recherches avec lesquels nous collaborons) pour orienter et appuyer la  recherche  et l’innovation sur des sujets de bien-être social général, d’avancement technologique, d’intérêt public, de santé et de bien-être. Par exemple,  nous analysons les informations à notre disposition concernant les schémas de migration pendant les crises  afin de faciliter les opérations de secours.  Apprenez-en davantage  sur nos programmes de recherche.  Revenir en haut  Comment ces informations sont-elles partagées ?   Vos informations sont partagées avec d’autres personnes des manières suivantes :  Partage sur les Produits Facebook Personnes et comptes avec lesquels vous communiquez et partagez du contenu  Lorsque vous partagez et communiquez à l’aide de nos Produits,  vous avez la possibilité de choisir l’audience autorisée à voir ce que vous partagez . Par exemple, lorsque vous publiez sur Facebook, vous sélectionnez l’audience de votre publication en choisissant un groupe, tous vos amis, tout le monde ou une liste de personnes personnalisée. De la même manière, lorsque vous utilisez Messenger ou Instagram pour communiquer avec des personnes ou des entreprises, ces dernières peuvent voir le contenu que vous envoyez. Votre réseau peut également voir les actions que vous avez effectuées sur nos Produits, notamment vos interactions avec des publicités et du contenu sponsorisé. Nous permettons également aux autres comptes de voir les personnes qui ont consulté leurs actualités Facebook ou leurs Instagram Stories.  Les informations publiques  peuvent être vues par tout le monde, sur nos Produits ou en dehors, même par les personnes qui n’ont pas de compte. Cela inclut votre nom d’utilisateur Instagram, toute information publique que vous partagez avec tout le monde, les informations figurant dans votre  profil public sur Facebook , ainsi que le contenu que vous partagez sur une Page Facebook, sur un  compte Instagram public  ou sur un autre forum public, comme  Facebook Marketplace . Vous, d’autres personnes utilisant Facebook et Instagram, et nous pouvons accorder un accès à des informations publiques ou envoyer de telles informations à n’importe qui sur nos produits ou en dehors, y compris sur les autres Produits des entités Facebook, dans les résultats de recherche ou par le biais des outils et des API. Il est également possible de consulter, de repartager ou de télécharger les informations publiques au moyen de services tiers, notamment les moteurs de recherche, les API et les médias hors ligne comme la télévision, et au moyen d’applications, de sites web et d’autres services intégrés dans nos produits.   Découvrez quelles informations sont publiques et comment contrôler votre visibilité sur  Facebook  et sur  Instagram .  Contenu vous concernant partagé ou repartagé par d’autres personnes  Vous devez réfléchir aux personnes avec lesquelles vous choisissez de partager du contenu, car ces personnes qui peuvent voir votre activité sur nos Produits peuvent ensuite la partager avec d’autres gens sur nos Produits et en dehors, y compris avec des individus et des entreprises n’appartenant pas à l’audience avec laquelle vous partagez votre contenu. Par exemple, lorsque vous partagez une publication avec des amis ou des comptes particuliers ou leur envoyez un message, ils peuvent télécharger ce contenu, en faire une capture d’écran ou repartager ce contenu avec d’autres personnes sur nos Produits ou en dehors, en personne ou dans le cadre d’expériences de réalité virtuelle telles que  Facebook Spaces . En outre, lorsque vous commentez la publication d’une autre personne ou réagissez à son contenu, votre commentaire ou votre réaction est visible par tous les individus qui peuvent voir le contenu de cette autre personne ; et l’autre personne peut modifier l’audience ultérieurement.   Les gens peuvent également utiliser nos Produits pour créer et partager du contenu vous concernant avec l’audience de leur choix. Par exemple, ces personnes peuvent partager une photo de vous dans une actualité, vous mentionner ou vous identifier dans un lieu dans une publication, ou partager des informations vous concernant dans leurs publications ou leurs messages. Si ce que d’autres personnes ont partagé à votre sujet sur nos Produits vous dérange, découvrez comment  signaler du contenu .  Informations relatives à votre statut actif ou à votre présence sur nos Produits.  Les membres de votre réseau peuvent voir des signaux leur indiquant si vous êtes actif ou non sur nos Produits, y compris si vous êtes actuellement actif sur  Instagram ,  Messenger  ou Facebook, ou à quel moment vous avez utilisé nos Produits pour la dernière fois.  Applications, sites web et services tiers intégrés à nos Produits ou utilisant nos Produits.  Lorsque vous choisissez de recourir à des applications, des sites web ou d’autres services tiers qui utilisent nos Produits ou qui y sont intégrés, ces derniers peuvent recevoir des informations sur ce que vous publiez ou partagez. Par exemple, lorsque vous jouez à un jeu avec vos amis Facebook ou utilisez le bouton Commenter ou Partager de Facebook sur un site web, le développeur du jeu ou le site web peut recevoir des informations sur vos activités dans le jeu ou recevoir un commentaire ou un lien que vous partagez depuis son site web sur Facebook. En outre, lorsque vous téléchargez ou utilisez ces services tiers, ces derniers peuvent accéder à votre  profil public  sur Facebook et à toute information que vous partagez avec eux. Les applications et les sites web que vous utilisez peuvent recevoir votre liste d’amis Facebook si vous choisissez de la partager avec eux. Cependant, les applications et les sites web que vous utilisez ne pourront pas recevoir d’autres informations de votre part concernant vos amis Facebook ou vos abonnés Instagram (sauf, bien sûr, si vos amis et vos abonnés choisissent de partager ces informations). Les informations recueillies par ces services tiers sont régies par leurs conditions générales et leurs règlements respectifs, pas par la présente politique.   Les appareils et les systèmes d’exploitation offrant des versions natives de Facebook et d’Instagram auront accès à toutes les informations que vous choisissez de partager avec eux, y compris celles que vos amis partagent avec vous afin qu’ils puissent vous offrir notre fonctionnalité principale.  Remarque : actuellement, nous restreignons davantage l’accès aux données des développeurs afin de mieux prévenir les abus. Par exemple, nous supprimerons l’accès des développeurs à vos données Facebook et Instagram si vous n’avez pas utilisé leur application depuis 3 mois et nous modifions la connexion dans la prochaine version pour réduire les données demandées par une application sans examen de l’application afin d’inclure uniquement le nom, le nom d’utilisateur Instagram, la bio, la photo de profil et l’adresse e-mail. Si l’application souhaite accéder à d’autres données, notre accord sera nécessaire. Nouveau propriétaire.  Si les droits de propriété ou le contrôle d’une partie ou de l’intégralité de nos Produits ou de leurs éléments changent, nous avons la possibilité de communiquer vos informations au nouveau propriétaire.  Partage avec des partenaires tiers  Nous collaborons avec des partenaires tiers qui nous aident à fournir et à améliorer nos Produits ou qui utilisent les outils professionnels Facebook pour développer leur activité, ce qui nous permet d’exploiter nos sociétés et de proposer des services gratuits dans le monde entier. Nous ne vendons aucune de vos informations à quiconque et nous ne le ferons jamais. Nous imposons également des restrictions strictes quant à la façon dont les partenaires peuvent utiliser et révéler les données que nous leur communiquons. Voici les types de tiers avec lesquels nous partageons des informations :  Partenaires qui utilisent le service d’analyse.  Nous fournissons des statistiques et des informations (insights) agrégées qui permettent aux individus et aux entreprises de comprendre la façon dont les gens interagissent avec leurs publications, leurs annonces, leurs Pages, leurs vidéos et tout autre contenu sur les Produits Facebook et en dehors. Par exemple, les administrateurs de Pages et les profils professionnels Instagram reçoivent des informations à propos du nombre de personnes ou de comptes qui ont consulté ou commenté leurs publications ou réagi à celles-ci, ainsi que des informations démographiques agrégées et d’autres renseignements qui les aident à comprendre les interactions avec leur Page ou leur compte.  Annonceurs.  Nous fournissons aux annonceurs des rapports sur les types de personnes qui voient leurs publicités et sur les performances de leurs publicités, mais nous ne partageons pas d’informations permettant de vous identifier personnellement (des informations telles que votre nom ou votre adresse e-mail qui peuvent être en elles-mêmes utilisées pour vous contacter ou vous identifier), sauf si vous nous en donnez l’autorisation. Par exemple, nous communiquerons aux annonceurs des informations générales concernant la démographie et les centres d’intérêt (par exemple, une publicité a été vue par une femme entre 25 et 34 ans qui vit à Madrid et qui aime l’ingénierie informatique) pour les aider à mieux comprendre leur audience. Nous vérifions également les publicités Facebook qui vous ont incité(e) à effectuer un achat ou à entreprendre une action auprès d’un annonceur.  Partenaires de mesure.  Nous partageons des informations vous concernant avec des entreprises qui les regroupent pour fournir des analyses et des rapports de mesure à nos partenaires.  Partenaires proposant des biens et des services sur nos Produits.  Lorsque vous vous abonnez pour recevoir du contenu payant, ou lorsque vous effectuez un achat auprès d’un vendeur sur nos Produits, le créateur du contenu ou le vendeur peuvent recevoir vos informations publiques et d’autres informations que vous leur communiquez, ainsi que les renseignements nécessaires pour finaliser la transaction, notamment vos renseignements d’expédition et vos coordonnées.  Fournisseurs et prestataires de services.  Nous donnons des informations et du contenu aux fournisseurs et prestataires de services qui soutiennent nos activités, notamment en proposant des services d’infrastructure technique, en analysant l’utilisation de nos Produits, en fournissant un service à la clientèle, en facilitant les processus de paiement ou en réalisant des sondages.  Chercheurs et universitaires.  Nous communiquons également des informations et du contenu à des partenaires de recherche et à des  universitaires  pour réaliser des études faisant progresser l’érudition et l’innovation qui soutiennent notre activité ou notre mission et améliorant la découverte et l’innovation dans les domaines du bien-être social général, de l’avancement technologique, de l’intérêt public, de la santé et du bien-être.  Forces de l’ordre ou demandes légales.  Nous partageons des informations avec les forces de l’ordre ou en réponse à des demandes légales dans les circonstances décrites  ci-dessous .   Pour en savoir plus sur la façon de contrôler les informations vous concernant que vous ou d’autres personnes partagez avec des partenaires tiers, consultez les  Paramètres Facebook  et les  Paramètres Instagram .  Revenir en haut  Comment les Entités Facebook collaborent-elles ?   Facebook et Instagram partagent leur infrastructure, leurs systèmes et leur technologie avec d’autres  Entités Facebook  (notamment WhatsApp et Oculus) afin de vous proposer une expérience innovante, pertinente, cohérente et sans danger sur l’ensemble des  Produits des entités Facebook  que vous utilisez. Nous traitons également les informations vous concernant sur l’ensemble des entités Facebook à ces fins, dans les limites prévues par la loi en vigueur et conformément à leurs conditions et politiques. Par exemple, nous traitons les informations provenant de WhatsApp concernant les comptes qui envoient du contenu indésirable sur son service afin de pouvoir prendre des mesures adéquates à l’encontre de ces comptes sur Facebook, Instagram ou Messenger. Nous cherchons également à comprendre la façon dont les gens utilisent les Produits des entités Facebook et interagissent avec ceux-ci, notamment pour déterminer le nombre d’utilisateurs uniques inscrits sur les différents Produits des entités Facebook.  Revenir en haut  Comment puis-je gérer ou supprimer les informations me concernant ?   Nous vous offrons la possibilité de consulter, de rectifier, de transférer et d’effacer vos données. Pour en savoir plus, consultez les  Paramètres Facebook  et les  Paramètres Instagram .   Nous stockons les données jusqu’à ce qu’il ne soit plus nécessaire de fournir nos services et nos Produits Facebook, ou jusqu’à ce que votre compte soit supprimé, selon la première de ces éventualités. Il s’agit d’une décision au cas par cas qui dépend d’aspects tels que la nature des données, la raison de leur collecte et de leur traitement et les besoins de conservations légaux ou opérationnels concernés. Par exemple, lorsque vous faites une recherche sur Facebook, vous pouvez consulter et supprimer cette recherche de votre historique de recherche à tout moment, mais l’enregistrement de cette recherche n’est supprimé qu’au bout de 6 mois. Si vous envoyez une copie de votre pièce d’identité officielle à des fins de vérification de votre compte, nous supprimons cette copie 30 jours après l’examen, sauf disposition contraire. Apprenez-en plus sur la suppression du  contenu que vous avez partagé  et sur les  données issues des cookies obtenues par le biais des plugins sociaux .   Lorsque vous supprimez votre compte, nous  supprimons le contenu  que vous avez publié, comme vos photos et vos statuts ; et vous ne pourrez plus récupérer ces informations par la suite. Les informations vous concernant que d’autres personnes ont partagées ne font pas partie de votre compte et ne seront pas supprimées. Si vous ne souhaitez pas supprimer votre compte, mais plutôt ne plus utiliser les Produits temporairement, vous pouvez désactiver votre compte. Pour supprimer votre compte à tout moment, n’hésitez pas à consulter les  Paramètres Facebook  et les  Paramètres Instagram .  Revenir en haut  Comment procédons-nous pour répondre aux demandes légales et pour éviter tout risque de dommage ?   Nous accédons à vos informations, les conservons et les partageons avec les organismes de réglementation, les autorités judiciaires ou d’autres :  pour répondre à une demande légale (telle qu’un mandat de perquisition, une décision de justice ou une assignation à témoin) si nous jugeons en toute bonne foi que la loi nous demande de le faire : cela peut inclure la réponse à des demandes légales provenant de juridictions en dehors des États-Unis, lorsque nous avons toutes les raisons de penser que la réponse est requise par la loi de cette juridiction, qu’elle s’applique aux personnes qui utilisent le service et qui dépendent de cette juridiction et qu’elle est conforme aux normes internationalement reconnues ; Lorsque nous avons des raisons de penser en toute bonne foi que cela est nécessaire pour détecter, empêcher et maîtriser la fraude, l’utilisation non autorisée des Produits, des violations de nos conditions ou règlements, ou toutes autres activités dangereuses ou illégales ; pour nous protéger nous-mêmes (notamment nos droits, notre propriété ou nos Produits), vous ou d’autres, notamment dans le cadre d’enquêtes ou de demandes réglementaires ; ou pour éviter tout décès ou toute blessure corporelle imminente. Par exemple, le cas échéant, nous fournissons des informations à des partenaires tiers et nous recevons des informations desdits partenaires à propos de la fiabilité de votre compte pour éviter une fraude, un abus ou toute autre activité dommageable dans nos Produits comme en dehors de ceux-ci.  Les informations vous concernant que nous recevons (notamment les données de transactions financières liées aux achats effectués avec Facebook) peuvent être consultées et conservées pendant une période prolongée lorsqu’elles font l’objet d’une demande ou d’une obligation légale, d’une enquête gouvernementale ou d’enquêtes sur d’éventuelles violations de nos conditions d’utilisation ou de nos règlements, ou pour éviter tout autre dommage. Nous conservons également pendant une durée minimale d’un an les informations des comptes désactivés suite à une violation des conditions d’utilisation, et ce, afin d’éviter les abus répétés ou d’autres violations des conditions d’utilisation.  Revenir en haut  Comment gérons-nous et transférons-nous les données dans le cadre de nos services internationaux ?   Nous partageons des informations à l’international, à la fois en interne avec les Entités Facebook et en externe avec nos partenaires et avec ceux avec qui vous communiquez et partagez des contenus dans le monde entier, conformément à ce règlement. Vos informations peuvent, par exemple, être transférées ou transmises aux États-Unis ou dans d’autres pays en dehors de celui où vous vivez, ou stockées et traitées dans l’un de ces pays aux fins décrites dans le présent règlement. Ces transferts de données sont nécessaires pour fournir les services énoncés dans les  Conditions d’utilisation de Facebook  et les  Conditions d’utilisation d’Instagram , et afin d’exploiter et de vous fournir nos Produits dans le monde entier. Nous utilisons  des clauses contractuelles standard , nous nous fions aux  décisions d’adéquation  de la Commission européenne concernant certains pays, le cas échéant, et nous obtenons votre consentement pour ces transferts de données vers les États-Unis et d’autres pays.  Revenir en haut  Comment procéderons-nous pour vous aviser des modifications apportées à la présente politique ?   Nous vous aviserons de toute modification importante apportée à la présente politique et vous donnerons la possibilité de consulter la version révisée avant de continuer à utiliser nos Produits.  Revenir en haut  Avis de confidentialité pour les résidents de Californie   Si vous résidez en Californie, vous trouverez plus d’informations sur vos droits à la vie privée des consommateurs dans  l’Avis de confidentialité spécifique à la Californie .  Revenir en haut Comment adresser vos questions à Facebook  Vous pouvez en savoir plus sur la confidentialité  sur Facebook  et  sur Instagram . Pour toutes questions concernant de la présente politique, vous pouvez nous contacter par les moyens décrits ci-dessous.   Nous contacter   Vous pouvez nous contacter  en ligne  ou par courrier à l’adresse :   Facebook, Inc.  ATTN : Privacy Operations  1601 Willow Road  Menlo Park, CA 94025, États-Unis   Date de la dernière révision : 11 janvier 2021  Français (France) English (US) Español 中文(简体) العربية Português (Brasil) 한국어 Italiano Deutsch हिन्दी 日本語 S’inscrire Connexion Messenger Facebook Lite  Watch  Personnes Pages Catégories de Page Lieux Jeux Lieux Marketplace Facebook Pay Groupes Offres d’emploi Oculus Portal Instagram Local Collectes de fonds Services Centre d’information sur les élections À propos Créer une publicité Créer une Page Développeurs Emplois Confidentialité Cookies Choisir sa pub Conditions générales Aide Paramètres Historique personnel  Facebook © 2021 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n"
}