{
    "docno": "RJP604",
    "url": "https://www.facebook.com/URBerkeley/posts",
    "text": "\n Underwater Robotics at Berkeley - Posts | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home About Photos Events Posts Community See more of Underwater Robotics at Berkeley on Facebook Log In or Create New Account See more of Underwater Robotics at Berkeley on Facebook Log In Forgot account? or Create New Account Not Now Visitor Posts Adarsh AK March 13, 2019 at 8:14 PM Autonomous Underwater Vehicles Team at Berkeley \nDONATE DONATE DONATE! William Loo January 22, 2019 at 9:21 PM Underwater Robotics at Berkeley | Recruitment \nWith roles like machin ... e learning software to structural analysis, the   Autonomous Underwater Vehicles Team at Berkeley  is the underwater robotics competition you've been looking for all this time! Full speed ahead to RoboSub 2019!   See More Blum Ctr October 29, 2018 at 3:27 PM Hello underwater innovators! \n\nEVENT REMINDER TOMORROW: Writing Work ... shop - Oct 30, 6pm (Blum Hall)\n\nBig Ideas is hosting a Writing Workshop to provide guidance and feedback on how to effectively craft your pre-proposal for any type of social impact idea you are trying to scale.\n\nThis workshop will also include a presentation on project and pitch storytelling techniques led by Scott Shigeoka, Community & Design Lead at OpenIDEO.\n\nWith the pre-proposal deadline (Nov. 14) just a few weeks away, don't miss this opportunity to ask questions and learn what makes a successful proposal.  https://www.facebook.com/events/679921079059408/?active_tab=about   See More English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 Underwater Robotics at Berkeley  added an  event . September 6, 2020  ·  SUN, SEP 6, 2020 Info session Online Event Underwater Robotics at Berkeley September 6, 2020  ·  Reminder that we're having our infosession now (1-2pm) and also later tonight (8-9pm) if you can't make the first one! Underwater Robotics at Berkeley  updated their cover photo. August 31, 2020  ·  Zoom Link:  https://zoom.us/j/8793598054 Underwater Robotics at Berkeley  added an  event . August 31, 2020  ·  FRI, SEP 4, 2020 Calapalooza Tabling 2 Online Event 2 people went Underwater Robotics at Berkeley August 31, 2020  ·  Underwater Robotics at Berkeley updated their website address. Learn More Underwater Robotics at Berkeley August 30, 2020  ·  If you're interested in joining, come to our tabling sessions this monday, or also friday September 4th from 4-6pm! MON, AUG 31, 2020 Calapalooza Tabling Online Event Underwater Robotics at Berkeley  added an  event . August 30, 2020  ·  MON, AUG 31, 2020 Calapalooza Tabling Online Event Underwater Robotics at Berkeley  updated their cover photo. January 16, 2020  ·  Underwater Robotics at Berkeley January 16, 2020  ·  # tbt  to our first 'underwater' vehicle:  Over 3 years ago, Boaty McBoat Face was a concept vehicle when AUVs at Berkeley was in its infancy. The team needed a way to unify our vision for a robot submarine with very little resources and technical expertise. Constructing this cardboard model raised questions on vehicle dynamics, propulsion systems, form factor, and other areas that would later be investigated through developing Smol Bot and Project Blue.  Check out our underwater vehicles at  https://www.ocf.berkeley.edu/~auvs/vehicles Underwater Robotics at Berkeley June 24, 2019  ·  We have a new website! Check it out here:  https://www.ocf.berkeley.edu/~auvs/ Autonomous Underwater Vehicles @Berkeley – Not your typical robot. Autonomous Underwater Vehicles @Berkeley – Not your typical robot. See more at  OCF.BERKELEY.EDU Underwater Robotics at Berkeley  updated their cover photo. June 21, 2019  ·  We're building something cool! Pictured is the \"head\" of our new robot! Underwater Robotics at Berkeley March 14, 2019  ·  Have you heard??? BIG GIVE IS ON!!!! Donations will help fund our student learning projects and competition participation!   # CalBigGive   # giveAUVs   https://give.berkeley.edu/egiving/index.cfm… Underwater Robotics at Berkeley March 12, 2019  ·  Robots are great but underwater robots are better! Two days until  # CalBigGive   # giveAUVs  Want to learn more about the Big Give? Click here!  https://biggive.berkeley.edu/ Underwater Robotics at Berkeley March 11, 2019  ·  We're hosting a GPU Analytics Workshop for UC Berkeley students and the community with our sponsor,  OmniSci  on 3/13/2019 at 210 Jacobs Hall, 6:30pm! Join us for fun, hacking, and food!  https://www.youtube.com/watch?v=dJGVV0VzK1U OmniSci is the GPU-accelerated platform used in business and government to find insights in big data beyond the limits of mainstream analytics tools. Origina... youtube.com OmniSci: GPU-accelerated Analytics OmniSci is the GPU-accelerated platform used in business and government to find insights in big data beyond the limits of mainstream analytics tools. Origina... OmniSci is the GPU-accelerated platform used in business and government to find insights in big data beyond the limits of mainstream analytics tools. Origina... Underwater Robotics at Berkeley March 11, 2019  ·  Three days until  # CalBigGive !  # GiveAUVs   https://give.berkeley.edu/egiving/index.cfm… Underwater Robotics at Berkeley  updated their cover photo. March 9, 2019  ·  We're participating in UC Berkeley's Big Give on Thursday, March 14th! Help support  Autonomous Underwater Vehicles Team at Berkeley   for our first RoboSub Competition! Minimum donations are $10.  https://give.berkeley.edu/egiving/index.cfm?fund=FU1346000   # giveAUVs   # CalBigGive Underwater Robotics at Berkeley  added an  event . March 4, 2019  ·  WED, MAR 13, 2019 AUVs X OmniSci GPU Analytics Workshop Jacobs Hall  ·  Berkeley 23 people interested Underwater Robotics at Berkeley  updated their cover photo. February 1, 2019  ·  Underwater Robotics at Berkeley  updated their profile picture. January 31, 2019  ·  new year, renewed motivation to succeed. See More \n \n \n"
}