{
    "docno": "RJP659",
    "url": "https://www.facebook.com/legal/policy/ccpa",
    "text": "\n Facebook \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Join or Log Into Facebook    Email or Phone Password Forgot account? Log In Do you want to join Facebook? Sign Up Sign Up  This privacy notice for California residents is effective as of January 1, 2020.  California Privacy Notice  This California Privacy Notice (“Notice”) is for California residents and supplements our  Data Policy . It explains how we collect, use, and share your Personal Information and how to exercise your rights under the California Consumer Privacy Act (“CCPA”).  When we say “Personal Information” in this Notice, we mean information that identifies, relates to, describes, is reasonably capable of being associated with, or could reasonably be linked, directly or indirectly, with you. Personal Information does not include information that is aggregated or information that cannot be reasonably linked to you.  Return to top How we collect, use, and share Personal Information  To provide the products or features offered by Facebook (“ Products \"), we must process information about you, including Personal Information, whether or not you are registered or logged in. Subject to the limitations we describe in our  Data Policy , we may share your Personal Information for business purposes with strict restrictions on how our partners can use and disclose the data we provide, at your direction, or in ways otherwise in accordance with the CCPA. We don’t sell any of your Personal Information, and we never will.   The best way to learn about the kinds of information we collect and how we use it is to review our  Data Policy . Here is a summary of the CCPA-related categories of Personal Information we may have collected about you over the past 12 months, depending on how you use our Products, as well as how we use it and with whom we may have shared it.  Categories of Personal Information we collect may include: Examples of how Personal Information is used  include: Parties with whom each category of Personal Information may be shared include: Identifiers; Data with special protections, if you choose to provide it; Commercial information, if you choose to provide it; Photos and face imagery that can be used to create face-recognition templates if you or others choose to provide it and you have the  setting  turned on.  Internet or other electronic network activity information, including content you view or engage with; Location-related information, including precise device location if you choose to allow us to collect it; Audio or visual Information, including photos and videos, if you or others choose to provide it; Professional or employment information, if you choose to provide it; Education information, if you choose to provide it; Financial information, if you choose to provide it; and Information derived from other Personal Information about you, which could include your preferences, interests, and other information used to personalize your experience. Providing, personalizing, and improving our Products; Facilitating transactions, providing measurement, analytics, advertising, and other business services; Promoting safety, integrity, and security; Communicating with you; and  Researching and innovating for social good. People and accounts you share and communicate with; People and accounts with which others share or reshare content about you; Apps, websites, and third-party integrations on or using our Products; New owners in the event of a change of ownership or control of all or part of our Products or their assets changes; Partners, including partners who use our analytics services, advertisers, measurement partners, partners offering goods and services in our Products, vendors and service providers, and researchers and academics; Law enforcement or other third parties in connection with legal requests; and Facebook Companies  To learn more about how we process information, including other types of Personal Information we collect, return to our  Data Policy .  Return to top Sources of Personal Information  We receive Personal Information from the information that you and others provide, from your device(s), and from our partners. The categories of sources from which we’ve collected or received Personal Information include:  You:  We collect the content, communications, and other information you provide when you use our Products, including when you sign up for an account, create or share content, and message or communicate with others. We collect information about the people, pages, accounts, hashtags, and groups you are connected to, and how you interact with them across our Products, such as the people you communicate with the most or the groups you are part of. We also collect information about how you use our Products, including ads we serve on and off Facebook, such as the types of content you view or engage with, the features you use, the actions you take, the people or accounts you interact with, and the time, frequency, and duration of your activities. Other people:  We may also receive and analyze content, communications, and information about you that other people provide when they use our Products, such as when others share or comment on a photo of you, send a message to you, or upload, sync, or import your contact information. Your device(s):  We collect information from and about the computers, phones, connected TVs, and other web-connected devices you use that integrate with our Products, and we combine this information across different devices you use. Facebook Companies:  We may receive information from other  Facebook Companies  (which include WhatsApp and Oculus) for business purposes that help us provide you with an innovative, relevant, consistent, and safe experience across all  Facebook Company Products  you use. We also process information about you across the Facebook Companies for these purposes, as permitted by applicable law, and in accordance with their terms and policies. Partners:  Advertisers, app developers, and publishers and other partners can send us information for business purposes through the Facebook Business Tools they use, including our social plug-ins (such as the Like button), Facebook Login, our APIs and SDKs, or the Facebook pixel. These partners provide information about your activities off Facebook—including information about your device, websites you visit, things you do on their services, and purchases you make. We also receive information about your online and offline actions, and purchases from third-party data providers who have the rights to provide us with your information. Partners receive your data when you visit or use their services or through third parties they work with. We require each of these partners to have rights to collect, use, and share your data before providing any data to us. Return to top How can you exercise your rights provided under the CCPA?  Under the CCPA, you have the following rights:  Right to Know:  You have the right to request that we disclose to you the Personal Information we collect, use, or disclose, and information about our data practices; Right to Request Deletion:  You have the right to request that we delete your Personal Information that we have collected from you; Right to Non-Discrimination:  We will not discriminate against you for exercising any of these rights.  To exercise your “right to know” or your “right to request deletion,”  click here .   Please note that to protect your information and the integrity of our Products, we may need to verify your identity before processing your request. In some cases we may need to collect additional information to verify your identity, such as a government issued ID.  Under the CCPA, you may exercise these rights yourself or you may designate an authorized agent to make these requests on your behalf. In most cases, we will facilitate your request through automated tools available through your password-protected account.  Return to top Contact for more information  If you have additional questions about this Notice or how to exercise your rights under the CCPA, please  contact us .   Date of Last Revision: July 1, 2020  English (US) Español Français (France) 中文(简体) العربية Português (Brasil) 한국어 Italiano Deutsch हिन्दी 日本語 Sign Up Log In Messenger Facebook Lite  Watch  People Pages Page Categories Places Games Locations Marketplace Facebook Pay Groups Jobs Oculus Portal Instagram Local Fundraisers Services Voting Information Center About Create Ad Create Page Developers Careers Privacy Cookies Ad Choices Terms Help Settings Activity Log  Facebook © 2021 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n"
}