{
    "docno": "RJP651",
    "url": "https://www.facebook.com/CLTCBerkeley/posts",
    "text": "\n Center for Long-Term Cybersecurity - Posts | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home About Events Photos Community Reviews Posts Join the CLTC Email List See more of Center for Long-Term Cybersecurity on Facebook Log In or Create New Account See more of Center for Long-Term Cybersecurity on Facebook Log In Forgot account? or Create New Account Not Now Visitor Posts Alex Cohen June 7 at 7:45 PM I'm pleased to announce that  Driven Arts Collective 's upcoming proje ... ct, CELSO (Community Emotional Light Sound Organism) has been selected to be among the winners of the CLTC Cybersecurity Arts Contest. Much gratitude to the  Center for Long-Term Cybersecurity  for selecting CELSO. So proud of our team at  Driven Arts Collective . Looking forward to the journey ahead.   See More UC Berkeley School of Information April 14 at 12:02 PM What skills and experience will the cybersecurity professionals of 2 ... 025 need to be successful? How do we prepare our master's in cybersecurity students today for long-term success? The I School and the  Center for Long-Term Cybersecurity  recently invited eight data and cybersecurity executives from diverse industries to share their unique perspectives on these questions in a round-table discussion. \n\n5 key insights that emerged from the conversation —   See More UC Berkeley School of Information April 5 at 9:21 AM WATCH: The  Center for Long-Term Cybersecurity  has produced an animat ... ed “explainer” video about deepfakes and misinformation, featuring perspectives from Dr. Hany Farid, Head of School and Associate Dean of the UC Berkeley School of Information and a Senior Faculty Advisor for CLTC.\n\nProduced as part of the “What? Now What? So What?” explainer video series, this short video provides an overview of what deepfakes are, why they matter, and what can be done to mitigate potential risks associated with “fake” content.\n\nRead more:  https://bit.ly/2Pvqs8n   See More English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 Center for Long-Term Cybersecurity June 9 at 11:29 AM  ·  Alex Cohen June 7 at 7:45 PM I'm pleased to announce that  Driven Arts Collective 's upcoming project, CELSO (Community Emotional Light Sound Organism) has been selected to be among the winne ... rs of the CLTC Cybersecurity Arts Contest. Much gratitude to the  Center for Long-Term Cybersecurity  for selecting CELSO. So proud of our team at  Driven Arts Collective . Looking forward to the journey ahead.   See More The Center for Long-Term Cybersecurity (CLTC) is proud to announce the winners of our 2021 Cybersecurity Arts Contest. The five winning projects span a range of creative concepts, from a dance performance that integrates emotion-sensing masks, to a web-based game that illuminates online discriminati... cltc.berkeley.edu CLTC Announces Winners of 2021 Cybersecurity Arts Contest - CLTC UC Berkeley Center for Long-Term Cybersecurity The Center for Long-Term Cybersecurity (CLTC) is proud to announce the winners of our 2021 Cybersecurity Arts Contest. The five winning projects span a range of creative concepts, from a dance performance that integrates emotion-sensing masks, to a web-based game that illuminates online discriminati... The Center for Long-Term Cybersecurity (CLTC) is proud to announce the winners of our 2021 Cybersecurity Arts Contest. The five winning projects span a range of creative concepts, from a dance performance that integrates emotion-sensing masks, to a web-based game that illuminates online discriminati... Center for Long-Term Cybersecurity May 12 at 10:59 AM  ·  In the latest episode of the Business of Government Hour podcast,  UC Berkeley  researchers Alison Post and Alexandra Pan discuss  # SmartCity   # cybersecurity  risks and resources for local public agencies to make informed choices about adopting these technologies. Listen here or wherever you listen to podcasts! What is “smart cities” technology? Do all smart city technologies pose equivalent cybersecurity risks? What are some of the most prevalent cyber threats posed by these technologies? federalnewsnetwork.com A conversation on the cybersecurity risks of smart city technologies | Federal News Network What is “smart cities” technology? Do all smart city technologies pose equivalent cybersecurity risks? What are some of the most prevalent cyber threats posed by these technologies? What is “smart cities” technology? Do all smart city technologies pose equivalent cybersecurity risks? What are some of the most prevalent cyber threats posed by these technologies? Center for Long-Term Cybersecurity May 5  ·  Join CLTC for a conversation with Mary Fan, Henry M. Jackson Professor of Law at the University of Washington, and Karen Levy, Assistant Professor in the Department of Information Science at Cornell University.   They will share new work that examines the tensions and trade-offs at the intersection of AI, competition and antitrust policy, and security and privacy – and discuss what this means for policy debates as the Biden administration takes up the most significant re-think since the mid 1990s of how the digital economy should be regulated. THU, MAY 27 The New Horizon for Data Rights: New perspectives on privacy, security and the public good Online Event Center for Long-Term Cybersecurity  added an  event . May 5  ·  THU, MAY 27 The New Horizon for Data Rights: New perspectives on privacy, security and the public good Online Event Center for Long-Term Cybersecurity April 20  ·  We're launching a new speaker series on \"Privacy and the Future of the Ad-Supported Internet”!   Our first event takes place on Wednesday, April 28 from 12-1pm (PT), featuring a discussion w/ Stephen Satterfield, Director of Privacy and Public Policy at Facebook. Register today!  📅   https://cltc.berkeley.edu/…/privacy-and-the-future-of-the-…/   # privacy   # adsupported   # internet   # competition WED, APR 28 2021 Speaker Series: Privacy and the Future of the Ad-Supported Internet w/ Steven Satterfield Online Event 1 person went Center for Long-Term Cybersecurity  added an  event . April 20  ·  WED, APR 28 2021 Speaker Series: Privacy and the Future of the Ad-Supported Internet w/ Steven Satterfield Online Event 1 person went Center for Long-Term Cybersecurity April 14  ·  UC Berkeley School of Information April 14 What skills and experience will the cybersecurity professionals of 2025 need to be successful? How do we prepare our master's in cybersecurity students today fo ... r long-term success? The I School and the  Center for Long-Term Cybersecurity  recently invited eight data and cybersecurity executives from diverse industries to share their unique perspectives on these questions in a round-table discussion.   5 key insights that emerged from the conversation —   See More We asked 8 data & cybersecurity executives to share their perspectives on what the next generation of cybersecurity leaders need to… medium.com The Future of Graduate Cybersecurity Education We asked 8 data & cybersecurity executives to share their perspectives on what the next generation of cybersecurity leaders need to… We asked 8 data & cybersecurity executives to share their perspectives on what the next generation of cybersecurity leaders need to… Center for Long-Term Cybersecurity  added an  event . April 13  ·  WED, APR 28 Women in Law, Policy, and Government Online Event 2 people went Center for Long-Term Cybersecurity April 13  ·  What skills and experience will  # cybersecurity  executives of 2025 need to be successful? How do we prepare today’s masters-level cybersecurity students for long-term success? CLTC and the  UC Berkeley School of Information  recently invited eight data and cybersecurity executives from diverse industries to share their unique perspectives on these questions in a round-table discussion. Here are 5 key insights that emerged from the conversation:  https://medium.com/…/the-future-of-graduate-cybersecurity-e…     # cyberworkforce   # cybereducation   # leadership   # ciso We asked 8 data & cybersecurity executives to share their perspectives on what the next generation of cybersecurity leaders need to… medium.com The Future of Graduate Cybersecurity Education We asked 8 data & cybersecurity executives to share their perspectives on what the next generation of cybersecurity leaders need to… We asked 8 data & cybersecurity executives to share their perspectives on what the next generation of cybersecurity leaders need to… Center for Long-Term Cybersecurity April 5  ·  It looks like you may be having problems playing this video. If so, please try restarting your browser. Close Head of School Hany Farid explains Deepfakes Posted by  UC Berkeley School of Information 112 Views 112 Views UC Berkeley School of Information April 5 WATCH: The  Center for Long-Term Cybersecurity  has produced an animated “explainer” video about deepfakes and misinformation, featuring perspectives from Dr. Han ... y Farid, Head of School and Associate Dean of the UC Berkeley School of Information and a Senior Faculty Advisor for CLTC.  Produced as part of the “What? Now What? So What?” explainer video series, this short video provides an overview of what deepfakes are, why they matter, and what can be done to mitigate potential risks associated with “fake” content.  Read more:  https://bit.ly/2Pvqs8n   See More Center for Long-Term Cybersecurity March 24  ·  Cities Today March 24 Emergency alerts, video surveillance tools and smart traffic lights are among the most vulnerable smart city systems, says new study.   👉   https://hubs.li/H0JPjKY0   Center for Long-Term Cybersecurity   # smartcity   # innovation   # cybercrime   # cybersecurity Emergency alerts, video surveillance tools and smart traffic lights are among the most vulnerable smart city systems, according to a report by an interdisciplinary team of academics from the Center for Long-Term Cybersecurity at the University of California, Berkeley. cities-today.com Cyber experts rank riskiest smart city systems - Cities Today - Connecting the world's urban leaders Emergency alerts, video surveillance tools and smart traffic lights are among the most vulnerable smart city systems, according to a report by an interdisciplinary team of academics from the Center for Long-Term Cybersecurity at the University of California, Berkeley. Emergency alerts, video surveillance tools and smart traffic lights are among the most vulnerable smart city systems, according to a report by an interdisciplinary team of academics from the Center for Long-Term Cybersecurity at the University of California, Berkeley. Center for Long-Term Cybersecurity March 16  ·  A new CLTC report aims to help local-level policymakers better understand how  # cybersecurity  risks vary among different “smart city” technologies. \"The Cybersecurity Risks of Smart City Technologies: What Do The Experts Think?\" presents results from a 2020 survey in which 76 cybersecurity experts ranked different technologies according to underlying technical vulnerabilities, their attractiveness to potential attackers, and the potential impact of a successful serious cyberat ... tack.  “Local officials receive a barrage of information about ‘smart city’ solutions to problems such as traffic congestion, crime, and inefficient use of power and water,” says Alison E. Post, Associate Professor of Political Science and Global Metropolitan Studies  UC Berkeley , one of the report’s co-authors. “This report will help local-level policymakers better understand how cyber-risks vary among different smart city technologies.”  https://cltc.berkeley.edu/smart-cities-report/   See More A new report by an interdisciplinary team of scholars from the University of California, Berkeley aims to help local-level policymakers better understand how cybersecurity risks vary among different “smart city” technologies. The Cybersecurity Risks of Smart City Technologies: What Do The Expert... cltc.berkeley.edu The Cybersecurity Risks of Smart City Technologies: What Do The Experts Think? - CLTC UC Berkeley Center for Long-Term Cybersecurity A new report by an interdisciplinary team of scholars from the University of California, Berkeley aims to help local-level policymakers better understand how cybersecurity risks vary among different “smart city” technologies. The Cybersecurity Risks of Smart City Technologies: What Do The Expert... A new report by an interdisciplinary team of scholars from the University of California, Berkeley aims to help local-level policymakers better understand how cybersecurity risks vary among different “smart city” technologies. The Cybersecurity Risks of Smart City Technologies: What Do The Expert... Center for Long-Term Cybersecurity March 9  ·  Almost a year since we first hunkered down, the Center for Long-Term Cybersecurity at the  UC Berkeley  is proud to share our 2020 Annual Report – full of stories and insights we hope inspire further engagement across our community.   As we enter 2021, it’s more important than ever to continue this work: helping decision makers act on foresight through original and future-focused  # cybersecurity  research; and, expanding who gets to participate in — and has access to — cybersecurity.  Check out this link for more on our 2020 achievements, including research on internet fragmentation, board governance of cyber risk, securing newsrooms of the future, and much more.  https://cltc.berkeley.edu/2020-annual-report/ cltc.berkeley.edu - CLTC UC Berkeley Center for Long-Term Cybersecurity Center for Long-Term Cybersecurity March 2  ·  For the second-consecutive year,  Craig Newmark  Philanthropies has funded Citizen Clinic to help this first-of-its-kind program continue to grow. “2020 and the first part of 2021 have made it clear how important it is for our  # democracy  to have strong defenses against  # cyberattacks  and  # disinformation ,” Newmark said. ”Newmark Philanthropies’ grantees work separately and together to promote values like fairness and equality, and I’m glad  UC Berkeley ’s Citizen Clinic is part of the community shaping solutions for a more secure and just future.”  https://cltc.berkeley.edu/…/craigslist-renews-citizen-clini… For the second-consecutive year, Craig Newmark Philanthropies has funded Citizen Clinic to help this first-of-its-kind program continue to grow. cltc.berkeley.edu Founder of craigslist Renews Support: Second Year of Funding Expands Cybersecurity Defense for Non Profits by UC Berkeley Students - CLTC UC Berkeley Center for Long-Term Cybersecurity For the second-consecutive year, Craig Newmark Philanthropies has funded Citizen Clinic to help this first-of-its-kind program continue to grow. For the second-consecutive year, Craig Newmark Philanthropies has funded Citizen Clinic to help this first-of-its-kind program continue to grow. Center for Long-Term Cybersecurity February 17  ·  CLTC and the Daylight Security Research Lab are thrilled to announce our second annual Cybersecurity Arts Contest! We seek artistic proposals that engage substantively with cybersecurity in themes, topics, audience, and/or materials. The primary goal of this prize is to expand public dialogue and refine representations and portrayals of  # cybersecurity , broadly defined. Proposals are due on March 31, 2021.  Help us spread the word!  🎨     https://cltc.berkeley.edu/2021artscontest/ The Daylight Security Research Lab, a program within the University of California, Berkeley’s Center for Long-Term Cybersecurity (CLTC), is accepting applications for our second annual Cybersecurity Arts Contest. We seek artistic proposals that engage substantively with cybersecurity in themes, to... cltc.berkeley.edu CLTC Cybersecurity Arts Contest - CLTC UC Berkeley Center for Long-Term Cybersecurity The Daylight Security Research Lab, a program within the University of California, Berkeley’s Center for Long-Term Cybersecurity (CLTC), is accepting applications for our second annual Cybersecurity Arts Contest. We seek artistic proposals that engage substantively with cybersecurity in themes, to... The Daylight Security Research Lab, a program within the University of California, Berkeley’s Center for Long-Term Cybersecurity (CLTC), is accepting applications for our second annual Cybersecurity Arts Contest. We seek artistic proposals that engage substantively with cybersecurity in themes, to... Center for Long-Term Cybersecurity February 1  ·  UC Berkeley Library February 1 Data is for EVERYONE!  💖 😍 📈  NEXT WEEK, celebrate Love Data Week with workshops on:   💘  Cybersecurity ...   💘  Data ethics   💘  Password managers   💘  Savio (high-powered computing cluster)   🔗   ucberk.li/love-data-2021   # LoveData21   🗓  Feb. 8-12  (s/o  UC Berkeley ,  Research-IT at Berkeley ,  UC Berkeley School of Information ,  Center for Long-Term Cybersecurity )   See More Center for Long-Term Cybersecurity January 25  ·  Attacks on journalists and  # freedomofthepress  have increased markedly over the past several years. A new report by Kristin Berdan, a fellow at CLTC's Citizen Clinic and research fellow at the University of Toronto's Citizen Lab, posits that a key reason why  # journalists  do not take sufficient action to protect themselves online is that there is an overwhelming amount of security advice on the internet, most of which is difficult for journalist-readers to understand or transla ... te into practice, and difficult for the guides’ authors to keep up to date.  “Most guides do not account for journalists’ busy schedules and time-pressured work cycles,” Berdan writes. “Journalists also operate in an increasingly hostile environment, even in countries with democratic governments and some historical guarantees of freedom of the press and rule of law.”  Read on to hear Berdan's recommendations on making guides and security education of journalists overall more effective:  https://cltc.berkeley.edu/journosec-guides/   See More Attacks on journalists and freedom of the press have increased markedly over the past several years. A new report by Kristin Berdan, a fellow at the Citizen Clinic and research fellow at the University of Toronto’s Citizen Lab, posits that a key reason why journalists do not take sufficient action... cltc.berkeley.edu An Evaluation of Online Security Guides for Journalists - CLTC UC Berkeley Center for Long-Term Cybersecurity Attacks on journalists and freedom of the press have increased markedly over the past several years. A new report by Kristin Berdan, a fellow at the Citizen Clinic and research fellow at the University of Toronto’s Citizen Lab, posits that a key reason why journalists do not take sufficient action... Attacks on journalists and freedom of the press have increased markedly over the past several years. A new report by Kristin Berdan, a fellow at the Citizen Clinic and research fellow at the University of Toronto’s Citizen Lab, posits that a key reason why journalists do not take sufficient action... Center for Long-Term Cybersecurity  added an  event . October 20, 2020  ·  MON, OCT 26, 2020 Berkeley Conversations: Election integrity and security Online Event Center for Long-Term Cybersecurity October 15, 2020  ·  Don't miss the upcoming conversation with Peter Schwartz and CLTC Faculty Director Steve Weber! Peter will reflect on what he’s learned over the years about how humans and digital technologies push each other to imagine and create different realities in business, politics, and social life. WED, NOV 4, 2020 In Conversation with Peter Schwartz, Sr. VP Strategic Planning, Salesforce Online Event 3 people went See More \n \n \n"
}