{
    "docno": "RJP618",
    "url": "https://www.facebook.com/korbelsiecenter/posts",
    "text": "\n Sié Chéou-Kang Center for International Security & Diplomacy - Posts | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home About Events Posts Photos Reviews Community See more of Sié Chéou-Kang Center for International Security & Diplomacy on Facebook Log In or Create New Account See more of Sié Chéou-Kang Center for International Security & Diplomacy on Facebook Log In Forgot account? or Create New Account Not Now Visitor Posts Josef Korbel School of International Studies, University of Denver April 14 at 8:07 AM Don't miss the  Denver Film  Women + Film Fest happening this week! On ... e of the feature films is End of the Line: Women of  # StandingRock . You can learn more and watch the film below. Each ticket includes access to a bonus Q&A session with the Director Shannon Kring and Phyllis Young led by  Sié Chéou-Kang Center for International Security & Diplomacy 's Marie Berry. \n  https://bit.ly/3e1i4pA   See More Josef Korbel School of International Studies, University of Denver March 8 at 1:48 PM Did you catch the profile of Korbel Professor & Director of the  Sié  ... Chéou-Kang Center for International Security & Diplomacy , Deborah Avant? Read more about how she developed her passion for exploring the connections between security, prosperity, and social justice. \n http://bit.ly/3sYweh2   # womensmonth   # IWD2021   See More Francesca Falasca October 21, 2020 at 8:59 AM Streaming live now on \"Lessons from the Global Fight for Democracy\" - Join us!\n https://www.facebook.com/watch/… English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 Sié Chéou-Kang Center for International Security & Diplomacy June 11, 2020  ·  Deborah Avant and Kara Neu in  PVGlance , \"Military Dissent Could Curb Democratic Backsliding in the US\" politicalviolenceataglance.org Military Dissent Could Curb Democratic Backsliding in the US – Political Violence at a Glance Military Dissent Could Curb Democratic Backsliding in the US Former Secretary of Defense General Jim Mattis. Photo courtesy of US Secretary of Defense via Flickr. ByDeborah AvantJune 11, 2020 By Deborah Avant and guest contributor Kara Kingma Neu In the wake of increasing military dissent over its u... Military Dissent Could Curb Democratic Backsliding in the US Former Secretary of Defense General Jim Mattis. Photo courtesy of US Secretary of Defense via Flickr. ByDeborah AvantJune 11, 2020 By Deborah Avant and guest contributor Kara Kingma Neu In the wake of increasing military dissent over its u... Sié Chéou-Kang Center for International Security & Diplomacy April 15, 2020  ·  William Akoto, Joint Postdoctoral Fellow for the Sie Center and  One Earth Future - OEF  wrote a piece in  Medium .  # coupstudies   # militarycoup Political symbols can be powerful and successful coup plotters may take advantage of that. medium.com Seizing Symbolic Targets is Crucial to Coup Success Political symbols can be powerful and successful coup plotters may take advantage of that. Political symbols can be powerful and successful coup plotters may take advantage of that. Sié Chéou-Kang Center for International Security & Diplomacy April 6, 2020  ·  Cullen Hendrix's latest blog post for  Peterson Institute for International Economics . This blog post is part of the PIIE COVID-19 series, which is a part of the G20 agenda. Second in a series of proposals for the G20's* agenda on the COVID-19 pandemic. piie.com Ensuring global food security in the time of COVID-19 Second in a series of proposals for the G20's* agenda on the COVID-19 pandemic. Second in a series of proposals for the G20's* agenda on the COVID-19 pandemic. Sié Chéou-Kang Center for International Security & Diplomacy March 10, 2020  ·  Check out Cullen Hendrix's latest policy brief via.  Peterson Institute for International Economics , \"What US strategy gets wrong about China in Africa\"    Josef Korbel School of International Studies, University of Denver The Trump administration’s Africa strategy is rooted in three misconceptions about China’s African footprint—and a fourth about US-Africa economic relations—that are either factually incorrect or overstated in terms of the broader strategic challenges they pose to US interests: (1) Chinese e... piie.com What US strategy gets wrong about China in Africa The Trump administration’s Africa strategy is rooted in three misconceptions about China’s African footprint—and a fourth about US-Africa economic relations—that are either factually incorrect or overstated in terms of the broader strategic challenges they pose to US interests: (1) Chinese e... The Trump administration’s Africa strategy is rooted in three misconceptions about China’s African footprint—and a fourth about US-Africa economic relations—that are either factually incorrect or overstated in terms of the broader strategic challenges they pose to US interests: (1) Chinese e... Sié Chéou-Kang Center for International Security & Diplomacy March 4, 2020  ·  William Akoto, Joint Sié Center and  One Earth Future - OEF  Postdoctoral Fellow, was interviewed by  Radio New Zealand .   Listen to the full podcast below!   Josef Korbel School of International Studies, University of Denver Satellites have the potential to revolutionise many aspects of life, but they could also be shut down by hackers and used as weapons. Cyber conflict commentator Dr. William Akoto says all it takes is a highly motivated and skilled hacker. rnz.co.nz Hackers could shut down satellites and turn them into weapons Satellites have the potential to revolutionise many aspects of life, but they could also be shut down by hackers and used as weapons. Cyber conflict commentator Dr. William Akoto says all it takes is a highly motivated and skilled hacker. Satellites have the potential to revolutionise many aspects of life, but they could also be shut down by hackers and used as weapons. Cyber conflict commentator Dr. William Akoto says all it takes is a highly motivated and skilled hacker. Sié Chéou-Kang Center for International Security & Diplomacy February 19, 2020  ·  # WYD  March 5? Come out and listen to Peter Andreas' of  Brown University  discuss his latest book, \"Killer High: A History of War in Six Drugs\". RSVP below.    https://bit.ly/2uNrSB3 Sié Chéou-Kang Center for International Security & Diplomacy February 3, 2020  ·  APSIA - Association of Professional Schools of International Affairs  is at  Josef Korbel School of International Studies, University of Denver . February 3, 2020  ·  Denver, CO Do you have questions about  # engagedscholarship  in academic-policy-oriented research? The  Sié Chéou-Kang Center for International Security & Diplomacy  has some  ... answers! Submit a question to the  Carnegie Corporation of New York  funded \"Anonymous Advice on the Ethics of Engagement\" and panel experts will give their advice.   To submit a question, please visit:  https://bit.ly/2GA19tG   See More Sié Chéou-Kang Center for International Security & Diplomacy January 30, 2020  ·  Have you ever had questions regarding ethics in academic-policy research? Submit a question to the Sié Center's platform, generously supported by  Carnegie Corporation of New York . You submit an anonymous question, and our panel of experienced scholars answer these questions to start a frank and honest conversation. Academics engaging with policymakers and policy processes is often viewed as beneficial, producing more informed policy outcomes and broadening the impact of scholarship. Yet engagement can give rise also to ethical questions that scholars are neither trained to address nor navigate—and may be afr... sieethicalengagement.com Home - Sie Center Ethics of Engagement Academics engaging with policymakers and policy processes is often viewed as beneficial, producing more informed policy outcomes and broadening the impact of scholarship. Yet engagement can give rise also to ethical questions that scholars are neither trained to address nor navigate—and may be afr... Academics engaging with policymakers and policy processes is often viewed as beneficial, producing more informed policy outcomes and broadening the impact of scholarship. Yet engagement can give rise also to ethical questions that scholars are neither trained to address nor navigate—and may be afr... Sié Chéou-Kang Center for International Security & Diplomacy January 21, 2020  ·  Sié Chéou-Kang Chair, Deborah Avant was quoted in  The Atlantic  piece, \"The War Machine Is Run on Contracts\" America's wars wouldn’t be possible without contractors, but presidents usually ignore the thousands who have died. theatlantic.com The War Machine Is Run on Contracts America's wars wouldn’t be possible without contractors, but presidents usually ignore the thousands who have died. America's wars wouldn’t be possible without contractors, but presidents usually ignore the thousands who have died. Sié Chéou-Kang Center for International Security & Diplomacy January 3, 2020  ·  TUE, JAN 7, 2020 The Killing of Qassem Suleimani: What's Next? 2306 E Evans Ave, Denver, CO 80210-4710, United States 56 people interested Sié Chéou-Kang Center for International Security & Diplomacy November 19, 2019  ·  Check it out -- The Sié Center has announced two new initiatives on responsible policy engagement: the Anonymous Advice on Responsible Engagement platform, and the Responsible Public Engagement Institute. Selected participants will be notified by February 1, 2020. Please contact sie.center@du.edu with any questions or concerns.  mailchi.mp Announcing Two New Initiatives on Responsible Policy Engagement Selected participants will be notified by February 1, 2020. Please contact sie.center@du.edu with any questions or concerns. Selected participants will be notified by February 1, 2020. Please contact sie.center@du.edu with any questions or concerns.  Sié Chéou-Kang Center for International Security & Diplomacy  added an  event . October 2, 2019  ·  TUE, OCT 15, 2019 Art Moves, Media Amplifies RedLine Denver  ·  Denver, CO 18 people interested Sié Chéou-Kang Center for International Security & Diplomacy September 10, 2019  ·  MON, SEP 23, 2019 The Creative Use of Media in Peace and War Sié Chéou-Kang Center for International Security & Diplomacy  ·  Denver, CO 34 people interested Sié Chéou-Kang Center for International Security & Diplomacy  added an  event . September 10, 2019  ·  MON, SEP 23, 2019 The Creative Use of Media in Peace and War Sié Chéou-Kang Center for International Security & Diplomacy  ·  Denver, CO 34 people interested Sié Chéou-Kang Center for International Security & Diplomacy August 23, 2019  ·  IGLI Director Marie Berry and  # IGLI2019  participant Rajaa Altalli discuss this year's institute and why this initiative matters for social justice, activism, and peace.    Colorado Public Radio The Inclusive Global Leadership Initiative's Summer Institute is a week-long conference at the University of Denver. cpr.org Women Activists From Frontlines Around The World Are Converging In Denver To Spread Their Messages The Inclusive Global Leadership Initiative's Summer Institute is a week-long conference at the University of Denver. The Inclusive Global Leadership Initiative's Summer Institute is a week-long conference at the University of Denver. Sié Chéou-Kang Center for International Security & Diplomacy August 21, 2019  ·  T-minus 96 hours until the 3rd annual IGLI Summer Institute is in full swing. Read more about this year's institute, broader IGLI research, and IGLI academic events happening at  Josef Korbel School of International Studies, University of Denver du.edu News | University of Denver August 15, 2019 (Denver, CO) - From August 24-30, the University of Denver will host its third annual Summer Institute focused on women's leadership as part of the Inclusive Global Leadership Initiative (IGLI), in partnership with the United States Institute of Peace (USIP). August 15, 2019 (Denver, CO) - From August 24-30, the University of Denver will host its third annual Summer Institute focused on women's leadership as part of the Inclusive Global Leadership Initiative (IGLI), in partnership with the United States Institute of Peace (USIP). Sié Chéou-Kang Center for International Security & Diplomacy July 11, 2019  ·  \"The human consequences of climate change include more food insecurity, reduced crop yields, increased migration and dramatic damage to coastal communities [...]. Less clear is how climate change will affect conflict between individuals, armed groups and national armies.\" by  Cullen Hendrix  and John O’Loughlin Academics have disagreed on this question, until recently. Here's what to expect. washingtonpost.com Analysis | How does climate change impact conflict in the world? Academics have disagreed on this question, until recently. Here's what to expect. Academics have disagreed on this question, until recently. Here's what to expect. Sié Chéou-Kang Center for International Security & Diplomacy July 11, 2019  ·  \"The human consequences of climate change include more food insecurity, reduced crop yields, increased migration and dramatic damage to coastal communities [...]. Less clear is how climate change will affect conflict between individuals, armed groups and national armies.\"   https://www.washingtonpost.com/…/how-does-climate-change-…/… Academics have disagreed on this question, until recently. Here's what to expect. washingtonpost.com Analysis | How does climate change impact conflict in the world? Academics have disagreed on this question, until recently. Here's what to expect. Academics have disagreed on this question, until recently. Here's what to expect. Sié Chéou-Kang Center for International Security & Diplomacy June 12, 2019  ·  Being promoted to full Professor and publishing an article in  Nature ?  Cullen Hendrix  is crushing it (more than usual). Check out the article below. Climate has affected organized armed conflict within countries, and intensifying climate change is estimated to increase future risks of conflict, although other drivers are substantially more influential and the mechanisms of climate–conflict linkages remain uncertain. nature.com Climate as a risk factor for armed conflict Climate has affected organized armed conflict within countries, and intensifying climate change is estimated to increase future risks of conflict, although other drivers are substantially more influential and the mechanisms of climate–conflict linkages remain uncertain. Climate has affected organized armed conflict within countries, and intensifying climate change is estimated to increase future risks of conflict, although other drivers are substantially more influential and the mechanisms of climate–conflict linkages remain uncertain. See More \n \n \n"
}