{
    "docno": "RJP648",
    "url": "https://www.facebook.com/analyticalspace/posts",
    "text": "\n Analytical Space - Posts | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home Posts Photos About Community Events See more of Analytical Space on Facebook Log In or Create New Account See more of Analytical Space on Facebook Log In Forgot account? or Create New Account Not Now Places Cambridge, Massachusetts Analytical Space Posts English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 Analytical Space November 21, 2018  ·  Our CEO and Co-Founder Justin Oliveira sat down with John Gilroy of the Constellations Podcast to talk Earth observation, data relay networks, and the new space economy. Hear the full interview below!    http://bit.ly/New-Space Justin Oliveira, CEO of Analytical Space explains how Small Sats, hyperspectral imaging and the use of optical networks are revolutionizing many aspects of the traditional satellite industry. kratoscomms.com Spectral Fingerprints, Laser Communications and the emerging Space Economy | Kratos Communications Justin Oliveira, CEO of Analytical Space explains how Small Sats, hyperspectral imaging and the use of optical networks are revolutionizing many aspects of the traditional satellite industry. Justin Oliveira, CEO of Analytical Space explains how Small Sats, hyperspectral imaging and the use of optical networks are revolutionizing many aspects of the traditional satellite industry. Analytical Space November 8, 2018  ·  Analytical Space will be hosting the first edition of the Downlink speaker series next week at the Engine in Cambridge. Join us for beer, wine and an educational talk on high power-density ultracapacitors for small satellite applications, presented by Wyatt Andree and Susheel Kalabathula from Nanoramic Laboratories. THU, NOV 15, 2018 The Downlink Speaker Series: Space-Grade Ultracapacitors The Engine  ·  Cambridge, MA 6 people went Analytical Space November 1, 2018  ·  \"In space, there's no 4G data connection like there is on the ground. Satellites are stuck in the dial-up era\" While satellites may be some of our most impressive technology, they are bogged down by a single bottleneck — data. Satellites orbiting Earth routinely struggle to relay data back down to Earth in a timely manner, with sizable implications for the real world, on the ground economy. This is why com... digital.hbs.edu Connectivity in Space - Harvard Business School Digital Initiative While satellites may be some of our most impressive technology, they are bogged down by a single bottleneck — data. Satellites orbiting Earth routinely struggle to relay data back down to Earth in a timely manner, with sizable implications for the real world, on the ground economy. This is why com... While satellites may be some of our most impressive technology, they are bogged down by a single bottleneck — data. Satellites orbiting Earth routinely struggle to relay data back down to Earth in a timely manner, with sizable implications for the real world, on the ground economy. This is why com... Analytical Space July 14, 2018  ·  Analytical Space updated their address. Get Directions Analytical Space July 13, 2018  ·  https://shoutout.wix.com/so/9MIB1bpv Cambridge, MA (July 13, 2018) — Radix, the first satellite from Analytical Space, was successfully deployed from the International Space Station early this morning via the NanoRacks CubeSat Deployer. The shoebox-sized satellite had been onboard the space station since May 24th, when the Orbital AT... shoutout.wix.com Analytical Space’s Radix Satellite Deployed From International Space Station Deployment marks the start of beta-testing mission for world’s first hybrid RF-optical data relay Cambridge, MA (July 13, 2018) — Radix, the first satellite from Analytical Space, was successfully deployed from the International Space Station early this morning via the NanoRacks CubeSat Deployer. The shoebox-sized satellite had been onboard the space station since May 24th, when the Orbital AT... Learn More Cambridge, MA (July 13, 2018) — Radix, the first satellite from Analytical Space, was successfully deployed from the International Space Station early this morning via the NanoRacks CubeSat Deployer. The shoebox-sized satellite had been onboard the space station since May 24th, when the Orbital AT... Analytical Space November 21, 2016  ·  http://www.starthub.org/startups/analytical-space Analytical Space November 21, 2016  ·  http://www.starthub.org/startups starthub.org Startups | StartHub Analytical Space Every few hours, one Library of Congress worth of data is created on orbit by commercial satellite operators. The cost to get this data down to the ground for use is excessive and growing more complex. Analytical Space is creating a network of in-space relays that utilize laser comm... Analytical Space Every few hours, one Library of Congress worth of data is created on orbit by commercial satellite operators. The cost to get this data down to the ground for use is excessive and growing more complex. Analytical Space is creating a network of in-space relays that utilize laser comm... Analytical Space  updated their cover photo. October 23, 2016  ·  Analytical Space  updated their profile picture. October 23, 2016  ·  \n \n \n"
}