{
    "docno": "RJP653",
    "url": "https://www.facebook.com/isu.ucr/posts",
    "text": "\n International Student Union at UCR - Posts | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home Events Posts Reviews Videos Photos About Community See more of International Student Union at UCR on Facebook Log In or Create New Account See more of International Student Union at UCR on Facebook Log In Forgot account? or Create New Account Not Now English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 International Student Union at UCR February 8  ·  Is your name WiFi? Because I’m really feeling a connection. Come join us and make this connection stronger in our collaborated event with ASUCR (ISC) this Friday. We’re hosting a valentines special love languages event and you could be the special one to win a GIFT CARD from us!! Link to the event is below!   https://ucr.zoom.us/j/92077579880 International Student Union at UCR November 5, 2020  ·  Hi guys!! Good luck to everyone who have midterms coming up! We’re having a game night this Friday through Discord  😊  Let’s chat and play some Among Us!! Hope to see you all there! International Student Union at UCR October 16, 2020  ·  Happy Friday everyone! Hope everyone had a great week so far. Looking forward to the weekend? Let us make it more exciting by holding our first movie night of the quarter! Join us tonight at 9PM online using the link below! See you all there!  ✨   https://linktr.ee/isuatucr International Student Union at UCR October 15, 2020  ·  Interested in participating in a research study for some research credit or a chance to win a $25 grocery store gift card? A friend of ISU is conducting a research study on acculturation, so be sure to check out the attached flyers for more information!   If you are interested in participating, please fill out an interest form at:  tinyurl.com/y4z3dbl2 International Student Union at UCR October 8, 2020  ·  Hi everyone!!  😊  We’re going to our first general meeting NEXT MONDAY! We're introducing our new members, sharing all about ISU, and the events we are planning for this fall quarter. Come meet with us and hang out!  The link for the zoom call and details are listed below!   https://ucr.zoom.us/j/7319173849… ...  Meeting ID: 731 917 3849  Passcode: 609934   See More International Student Union at UCR September 18, 2020  ·  UCR Athletics is very important to the international community as well! Each year we have many international students who come to UCR to study and participate in the athletic program. Please consider signing the petition and spread the word!   http://petition.keepucrathletics.com/ International Student Union at UCR  is at  UC Riverside . June 5, 2020  ·  Riverside  ·  ✊🏻 ✊🏼 ✊🏽 ✊🏾 ✊🏿   # blacklivesmatter   # georgefloyd   # blm  @ UC Riverside International Student Union at UCR  is at  UC Riverside . May 8, 2020  ·  Riverside  ·  🚨 Announcement!!  The Board Application has been extended to Friday, May 15th!! Thank you to everyone who has submitted their application so far, but we want to give a chance to our other ISU members to apply  😊  check the link in our bio for the application! Please message us if you have any questions.  @ UC Riverside International Student Union at UCR April 26, 2020  ·  Do you want to be a part of the dynamic board that puts together events for our students!? Well, we want YOU to apply!! 😊  There are numerous benefits to being part of a board on campus, and it will be an amazing opportunity for you to gain invaluable skills and experience! The link is in our bio ☝️ Apply NOW!!!!! International Student Union at UCR April 21, 2020  ·  How can we join the ISU virtual Coffee Hour? 🤔  Here, there are only 3 easy steps to join it through Discord! We look forward to seeing you there ☺️ International Student Union at UCR April 21, 2020  ·  Hi guys!! We hope all of you are staying safe and healthy! We’re having a virtual Coffee Hour this Thursday through Discord 😊  Let’s chat and play some games together!  Hope to see you all there! 😁   # isu   # ucrisu   # virtual   # coffeehour International Student Union at UCR March 3, 2020  ·  Happy Birthday ISU!! 😊  ISU was established in Winter 2018 to provide an opportunity to bridge local and international students. Our community has been growing so much in these two years, with all of your support! Thank you so much ☺️  Let’s celebrate our two year birthday!!!  ・・・・・・・・・・・・・・・・・・・・・  Date: Saturday, March 7th  Time: 6-9pm ...  Location: Andrea’s House  SIGN-UP:  https://docs.google.com/…/1bZQbYzSzLYIbdwbAqLbSSHOrDir…/edit   See More International Student Union at UCR February 15, 2020  ·  Hi everyone!! 😊  We’re going on a trip to the Getty Center Museum! Do you want to enjoy great art and take some stylish pictures for Instagram with us?? Seats are limited. Please sign up as soon as possible! ☝️  ・・・・・・・・・・・・・・・・・・・・・・・・  SIGN-UP Link:  https://docs.google.com/…/1THnuR9v983D9c4gRwUAjXP3BJV_…/edit   # isu   # ucr   # ucrisu   # trip   # gettycentermuseum International Student Union at UCR February 11, 2020  ·  Hi Everyone!! 😊  We have Coffee Hour this Thursday to celebrate the Valentine’s Day! We’re collaborating with @ucreducationabroad & @ucrinternationalaffairs and will provide free coffee, snacks, and ice cream 🙌  Please come out and celebrate this event with us. We’re looking forward to seeing you all there!   # isu   # ucr   # isuucr   # coffeehour   # icecream International Student Union at UCR February 11, 2020  ·  🎈 STUDENT SPOTLIGHT!! 🎈  ・  ISU would like to announce our Student Spotlight for Week 3. The student spotlight goes out to “Ryo Yamaguchi”! He is a 3rd year exchange student, and he is majoring Asian Studies. He is from Japan 🇯🇵 , and is actively engaging in ISU events and activities.・  ・  We asked Ryo what made him decide to come to UCR/United States, and he said “UCR is known for its diversity and that attracted me when choosing a school in the U.S. The reasons I came to the U.S. a ... re to practice English so as to be fluent enough to use it for a job in the future and to deepen an understanding of different cultures!” Then, we asked him what he likes about Coffee Hours. He told us “Thank to efforts Coffee Hours coordinator put into it, I fully enjoy chatting with many people over coffee and snacks that are suitable for seasons. I really enjoyed Christmas Coffee Hour! Please talk to me next time you see me in coffee hour, you guys!”  ・・・・・・・・・・・・・・・・・・・・・・・・  Interested in getting featured on our social media? Come out to Coffee Hours every Thursday from 4:30pm-6:00pm and share your story with us! 😄   # ucrisu   # coffeehours   # studentspotlight   # ucr   # isu   See More International Student Union at UCR February 8, 2020  ·  🎈 STUDENT SPOTLIGHT!! 🎈  ・  ISU would like to announce our Student Spotlight for Week 2 in this winter quarter. The student spotlight goes out to “Pamodya Peiris”! She is a 2nd year undergraduate student, and she is studying Computer Engineering. She is from Sri Lanka 🇱🇰 , and was one of the International Student Orientation leader last year.・  ・  We asked Pamodya what made her decide to come to UCR/United States, and she said “I always wanted to come to the United States ever since  ... I had a better understanding about the country. When I grew up, I realized that the US has more resources and more job opportunities in the field I wanted to work for!” Then, we asked her what she likes about ISU. She told us “I feel like ISU is a comfortable platform to make new friends and get to know about different cultures!”  ・・・・・・・・・・・・・・・・・・・・・・・・  Interested in getting featured on our social media? Come out to Coffee Hours every Thursday from 4:30pm-6:00pm and share your story with us! 😄   # ucrisu   # coffeehours   # studentspotlight   # ucr   # isu   See More International Student Union at UCR  is at  UC Riverside . January 31, 2020  ·  Riverside  ·  Thank you for coming to our Coffee Hours for the past couple of weeks during the winter quarter!! 😊   # isu   # ucr   # isuucr   # coffeehour   @ UC Riverside +7 International Student Union at UCR January 28, 2020  ·  We have Coffee Hour in collaboration with Education Abroad Office this Thursday! ☺️  We hope to see you all at the Bear’s Den from 3:30-5pm ✌️ International Student Union at UCR January 28, 2020  ·  Do you like Boba?? Come and grab a boba or enjoy dinner with us! You can support our ISU by buying your favorite stuff!! 😁  ・・・・・・・・・・・・・・  Date: Friday, January 31st  Time: 7-10pm  Location: Cha2o (1400 University Ave Suit#A104) ...  ***Please show this flyer when you purchase something!!   # isu   # ucr   # isuucr   # fundraiser   See More See More \n \n \n"
}