{
    "docno": "RJP629",
    "url": "https://www.facebook.com/ideahacks.la/posts",
    "text": "\n IDEA Hacks - Posts | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home About Photos Events Posts Videos Reviews Groups Community See more of IDEA Hacks on Facebook Log In or Create New Account See more of IDEA Hacks on Facebook Log In Forgot account? or Create New Account Not Now English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 IDEA Hacks November 15, 2020  ·  Due to popular demand, we've decided to extend applications to November 22nd @ 11:59PM! Make sure to get your apps in before then, good luck on midterms everyone!  Apply at:  www.ideahacks.la  Facebook Event:  https://www.facebook.com/events/778405236078217 IDEA Hacks  added an  event . October 28, 2020  ·  FRI, JAN 15 IDEA Hacks 2021 Online Event 74 people interested IDEA Hacks  updated their cover photo. October 25, 2020  ·  IDEA Hacks  updated their profile picture. October 25, 2020  ·  IDEA Hacks  added a new photo to the album:  IDEA Hacks 2020 . January 9, 2020  ·  IDEA Hacks January 8, 2020  ·  IDEA Hacks is in TWO DAYS! Here's the workshops that we are offering on Friday night. See you there! IDEA Hacks January 8, 2020 IDEA Hacks  added a new photo to the album:  IDEA Hacks 2020 . January 8, 2020  ·  IDEA Hacks January 7, 2020  ·  Hi everyone, we just sent out the final details email for IDEA Hacks to everyone who RSVPed. If you did not receive this, but RSVPed - please email team@ideahacks.la! The schedule and map is also attached for reference.   We're looking forward to this upcoming weekend and all the amazing projects that will be made : )) IDEA Hacks December 21, 2019  ·  ❄️ ❄️  Happy Holidays, we wanted to let everyone know about this wonderful opportunity!!  ❄️ ❄️  QWER Hacks is UCLA’s first LGBTQIA hackathon, happening January 25 - 26! For 24 hours, around 200 amazing student hackers will work together to create fantastic and innovative products meant to help underrepresented groups.  Through technical and diversity & inclusion workshops, development of new products, and empowering talks from queer individuals in tech, QWER Hacks aims to celebrat ... e and increase the visibility of the queer community in STEM, as well as engage and bring together queer individuals and allies. Hackers of all levels (and all identities) are welcome - there will be workshops throughout the entire hack meant to help beginners learn about different aspects of developing.  Anyone is welcome to attend, including allies! You can register at  tinyurl.com/qwerhacks . Applications are due December 27th.  Website: qwerhacks.github.io  Instagram: qwerhacks   See More IDEA Hacks December 15, 2019  ·  Looking for more hackathon opportunities???  HackUCI 2020 applications are due TONIGHT! Join UCI as they celebrate their 6th iteration of the largest collegiate hackathon in Orange County from January 31st, 2020 to February 2nd, 2020.  HackUCI FB Group: @hackUCIrvine ...  HackUCI Website:  https://www.hackuci.com/  Applications DUE: December 15, 2019 at 11:59PM   See More Create. Connect. Inspire. Join us as we gather the tech community from all over Orange County in a spectacular display of ideas, ambition, and talent. hackuci.com HackUCI 2020 Create. Connect. Inspire. Join us as we gather the tech community from all over Orange County in a spectacular display of ideas, ambition, and talent. Create. Connect. Inspire. Join us as we gather the tech community from all over Orange County in a spectacular display of ideas, ambition, and talent. IDEA Hacks December 7, 2019  ·  Extended apps for IDEA Hacks are due TONIGHT  Make sure you (and your teammates) get your apps in at  www.ideahacks.la  tonight by 11:59 PM! Good luck on finals  😊  FB Event Page:  https://www.facebook.com/events/489220321681649/ IDEA Hacks December 1, 2019 Due to popular demand, we've decided to extend applications to December 7th @ 11:59PM. Make sure to get your apps in before then, good luck on finals everyone!  Apply at:  www.ideahacks.la  Volunteer signup:  www.tinyurl.com/ihvolunteer IDEA Hacks December 4, 2019  ·  Extended apps for IDEA Hacks are due in 3 DAYS  Don't miss out on this opportunity to create a TANGIBLE product by the end of 36 hours...and we also have free food, swag and an amazing weekend planned out! Make sure you get your apps in at  www.ideahacks.la  by Saturday (12/7) - we can't wait to read your apps  😊  FB Event Page:  https://www.facebook.com/events/489220321681649/ IDEA Hacks December 1, 2019 Due to popular demand, we've decided to extend applications to December 7th @ 11:59PM. Make sure to get your apps in before then, good luck on finals everyone!  Apply at:  www.ideahacks.la  Volunteer signup:  www.tinyurl.com/ihvolunteer IDEA Hacks December 1, 2019  ·  Due to popular demand, we've decided to extend applications to December 7th @ 11:59PM. Make sure to get your apps in before then, good luck on finals everyone!  Apply at:  www.ideahacks.la  Volunteer signup:  www.tinyurl.com/ihvolunteer IDEA Hacks November 28, 2019  ·  APPS ARE DUE IN 4 DAYS!  Don't miss out on experiencing UCLA’s ultimate hardware hackathon, which is back for its sixth year on January 10-12, 2020! IDEA Hacks, Southern California’s first and largest collegiate hardware-focused hackathon, is inviting all hackers to come and create something new that aligns with this year’s theme - College Lifestyle. Any level of experience is welcome, we've got workshops throughout the hackathon to help you out! This event is a great opportun ... ity to gain technical experience by experimenting with different tech and bringing a product idea to life. Don’t worry if you don’t have a team before applying, we will be hosting a team mixer at the beginning of the hackathon! We got some free stuff for you too - every hacker will receive a free hackathon t-shirt, free food throughout the event, and the chance to win prizes in raffles.  FB Event Page:  https://www.facebook.com/events/489220321681649/  DEADLINE: 12/1  Register and Apply:  www.ideahacks.la  Sign up to volunteer:  https://forms.gle/eSyoVPMuiEiFL4GT8   See More FRI, JAN 10, 2020 IDEA Hacks 2020 UCLA Ackerman Grand Ballroom  ·  Los Angeles Networking  · 529 people IDEA Hacks  added an  event . November 3, 2019  ·  FRI, JAN 10, 2020 IDEA Hacks 2020 UCLA Ackerman Grand Ballroom  ·  Los Angeles Networking  · 529 people IDEA Hacks  updated their profile picture. November 3, 2019  ·  IDEA Hacks  updated their profile picture. November 3, 2019  ·  IDEA Hacks February 5, 2019  ·  Hackathon season isn't over yet! Looking to make this Spring Break both productive and incredible? Gather your crew and build something at this year’s LA Hacks!  Hacker Apps for one of the nation’s biggest hackathons closes in ONE WEEK (2/11), so tell us your story and mark your calendars for March 29-31st. We can’t wait to see you at Pauley Pavilion. Visit  https://lahacks.com  to learn more and apply. lahacks.com LA Hacks 2019 IDEA Hacks January 22, 2019  ·  IDEA Hacks might be over but you can come check out IEEE's first ever Virtual RealitIEEE event on February 15. The day will consist of gameplay, panels, and tournaments! Play for a chance to win an HTC Vive VR System or a Turtle Beach Gaming Headset in one of our two tournaments. FRI, FEB 15, 2019 Virtual RealitIEEE Ackerman Grand Ballroom Other  · 188 people See More \n \n \n"
}