{
    "docno": "RJP610",
    "url": "https://www.facebook.com/CaltechSeismo/posts",
    "text": "\n Caltech Seismological Laboratory - Posts | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home Posts About Photos Community See more of Caltech Seismological Laboratory on Facebook Log In or Create New Account See more of Caltech Seismological Laboratory on Facebook Log In Forgot account? or Create New Account Not Now English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 Caltech Seismological Laboratory January 7, 2020  ·  An international team of geoscientists led by Caltech has used fiber optic communications cables stationed at the bottom of the North Sea as a giant seismic network, tracking both earthquakes and ocean waves. A fiber optic network in the North Sea was used to record seismicity. caltech.edu Submarine Cables to Offshore Wind Farms Transformed into a Seismic Network A fiber optic network in the North Sea was used to record seismicity. A fiber optic network in the North Sea was used to record seismicity. Caltech Seismological Laboratory January 6, 2020  ·  Did you know that the Seismo Lab offers tours to middle and high school classes?  Click the link to learn more about this opportunity for your young scientists to visit a working laboratory! Caltech's Seismological Laboratory, an arm of the Division of Geological and Planetary Sciences (GPS), was established in 1921. It has a distinguished history of leadership in science and serving the public interest. Internationally recognized for excellence in geophysical research and academics whi... seismolab.caltech.edu Seismo Lab Tours - Caltech Seismological Laboratory Caltech's Seismological Laboratory, an arm of the Division of Geological and Planetary Sciences (GPS), was established in 1921. It has a distinguished history of leadership in science and serving the public interest. Internationally recognized for excellence in geophysical research and academics whi... Caltech's Seismological Laboratory, an arm of the Division of Geological and Planetary Sciences (GPS), was established in 1921. It has a distinguished history of leadership in science and serving the public interest. Internationally recognized for excellence in geophysical research and academics whi... Caltech Seismological Laboratory January 6, 2020  ·  Caltech Seismological Laboratory updated their address. Get Directions Caltech Seismological Laboratory January 6, 2020  ·  Caltech Seismological Laboratory updated their website address. Learn More Caltech Seismological Laboratory January 6, 2020  ·  Caltech Seismological Laboratory updated their phone number. Call Now Caltech Seismological Laboratory January 6, 2020  ·  Caltech Seismological Laboratory updated their business hours. Get Directions Caltech Seismological Laboratory  updated their profile picture. January 6, 2020  ·  Caltech Seismological Laboratory  updated their cover photo. January 6, 2020  ·  Caltech Seismological Laboratory  updated their cover photo. January 6, 2020  ·  Caltech Seismological Laboratory  updated their profile picture. January 6, 2020  ·  \n \n \n"
}