{
    "docno": "RJP632",
    "url": "https://www.facebook.com/FullCycleCo/posts",
    "text": "\n FullCycle - Posts | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home About Posts Reviews Photos Community See more of FullCycle on Facebook Log In or Create New Account See more of FullCycle on Facebook Log In Forgot account? or Create New Account Not Now Visitor Posts Ibrahim AlHusseini May 28 at 1:51 PM \"At a market-ready stage, US private equity firm  FullCycle  invests i ... n scalable climate-critical technology and infrastructure that has been commercially proven, and can achieve a “gigaton or better CO2e impact per year at full deployment”, incorporating CO2e returns from their capital invested.\"   See More SOCAP - Social Capital Markets April 19 at 11:04 AM In order to combat climate change and avoid the worst impacts of the ...  crisis, we need to completely overhaul our economic and societal systems while simultaneously addressing environmentally harmful human behaviors and activities. In a Lightning Bolt session for SOCAP20 Virtual, Ibrahim AlHusseini, founder and managing partner of  FullCycle , shared his thoughts on what it will take to accelerate the creation and adoption of climate critical technologies, and how his fund is working to facilitate this shift.\n\n[Image description: Ibrahim AlHusseini's lightning bolt session graphic. The title reads \"Capital for Climate Critical Infrastructure and a Resilient Recover.\" Below that is \"Ibrahim AlHusseini, Founder and Managing Partner of FullCycle.\" A picture of Ibrahim is on the left of the graphic.]\n https://bit.ly/2Q8cRVa   See More The Female Quotient March 16 at 12:17 PM Women are redefining the scope of social impact, from economic metri ... cs like GDP, to reshaping narratives of empowerment through media and investment. Join us in the  # EqualityLounge  at  # SXSW  to meet the women creating uncharted paths in the impact.  https://bit.ly/3vtVKwO \n\nClooney Foundation for Justice,  Mama Hope , AG Capital,  FullCycle   See More English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 FullCycle April 28, 2020  ·  FullCycle is an investment firm that delivers outsized financial returns by fulfilling an unmet need in the mobilization against climate change. Find out here: FullCycle is a private equity firm that fulfills an unmet need in the mobilization against climate change while delivering outsized financial returns. FullCycle… vimeo.com Who Is FullCycle? FullCycle is a private equity firm that fulfills an unmet need in the mobilization against climate change while delivering outsized financial returns. FullCycle… FullCycle is a private equity firm that fulfills an unmet need in the mobilization against climate change while delivering outsized financial returns. FullCycle… FullCycle March 30  ·  “Climate change is a race against time—but it’s not a race that anyone can win alone.\" - Managing Partner, Ibrahim AlHusseini. FullCycle is honored to be a signatory to the  # NetZeroAssetManagers  & take part in  # IIGCC 's $32 trillion in assets committed to addressing climate change.  Read the full announcement here:  https://buff.ly/3sGWRaw FullCycle March 1  ·  \"There is a temptation to divorce the issues of social justice and climate change. The reality is that all justice is connected.\" Managing Director Stephan Nicoleau sat down with The Daily Show's Roy Wood, Jr. to discuss the intersection of Climate Justice and Social Justice.   https://buff.ly/3q9Nv4W - Faces of Race fintech.tv Stephan Nicoleau - Managing Director - FullCycle - FINTECH.TV - Faces of Race - Faces of Race FullCycle February 23  ·  We at FullCycle are honored to be awarded by  ImpactAssets  as a top 50 asset manager. We commit to using the visibility and acknowledgment granted to accelerate the scale of commercially ready climate solutions.  https://buff.ly/3qP2oLk FullCycle October 23, 2020  ·  Grounded October 23, 2020 Where we invest our resources is how we invest in our future – so why not invest in the planet?  Our friends at  FullCycle , an investment firm supporting companie ... s harnessing proven technologies that accelerate climate solutions, are dedicated to building a low carbon future through green financing.  Watch  FullCycle 's Stephan Nicoleau breakdown how the company views the financial industry as a crucial part of the solution at Grounded '19.   See More Where we invest our resources matters. In the next 12 years, we have the opportunity to determine our collective future and our resources are critical in tha... youtube.com Grounded Summit 2019: Stephan Nicoleau Where we invest our resources matters. In the next 12 years, we have the opportunity to determine our collective future and our resources are critical in tha... Where we invest our resources matters. In the next 12 years, we have the opportunity to determine our collective future and our resources are critical in tha... FullCycle October 16, 2020  ·  Starts in 1 hour! Tom Steyer on The Future with FullCycle: Transforming the Carbon-Based Economy.  https://buff.ly/3iQMmMh FullCycle October 14, 2020  ·  There are only a few spots left for the next Future with FullCycle with Tom Steyer. Make sure to reserve your seat:  https://buff.ly/30MyhJz FullCycle October 12, 2020  ·  Join this Friday as we discuss  # ClimateAction , the  # BuildBackBetter  plan, and investible solutions with Tom Steyer. Register here:  https://buff.ly/30MyhJz FullCycle October 9, 2020  ·  1 week from today, join the next Future with FullCycle as we speak with Tom Steyer to break down the  # BuildBackBetter  plan and investible solutions to transform the carbon-based economy. Register here:  https://buff.ly/30MyhJz FullCycle October 8, 2020  ·  Please join us Friday 10/16, for the next Future with Fullcycle, featuring Tom Steyer.  We will discuss the opportunity to transform our carbon-based economy for global shock resiliency, investment solutions for the rollout of climate-critical infrastructure, and what policy decisions are necessary to eradicate the entrenchment of the fossil fuel industry.    Register here:  https://buff.ly/30MyhJz FullCycle September 28, 2020  ·  This Thursday || Join  # VCinclude  for Black Voices in Sustainable Investing. @FullCycle Managing Director Stephan Nicoleau discusses leadership, climate solutions, and climate justice. Register here:  https://buff.ly/3hQByx2 FullCycle September 23, 2020  ·  CLIMATE WEEK 2020 || Voices of Women: Truth, Courage, and Solutions to the Climate Crisis. Register for tomorrow's conversation with Project Drawdown's Dr. Katharine Wilkinson and Ocean Collectiv's Dr. Ayana Elizabeth Johnson.  https://buff.ly/3iC4ha1 FullCycle September 22, 2020  ·  Dr. Katharine Wilkinson and Dr. Ayana Elizabeth Johnson launch their new book All We Can Save today!  You won't want to miss Thursday's Future with FullCycle where we will discuss feminine leadership and solutions to the climate crisis. Register here:  https://buff.ly/3iC4ha1#allwecansave FullCycle September 21, 2020  ·  Climate Week 2020 looks a little different this year. Please join Project Drawdown 's Dr. Katharine Wilkinson and Ocean Collectiv's Dr. Ayana Elizabeth Johnson as we discuss these women's powerful leadership at the front line of Climate Change and their new book All We Can Save ||  https://buff.ly/3iC4ha1 FullCycle September 21, 2020  ·  CLIMATE WEEK 2020: Join Managing Director, Stephan Nicoleau at the Nest Summit as he and Jeff Gitterman discuss the Financial Revolution in Global Waste Management. Watch live from center stage at the Javits Center Tues 9 AM PST / 12 PM EST   https://buff.ly/3mH8rQa   # climateweeknyc At FullCycle, Stephan Nicoleau and his team invest in a complete \"rehaul\" of the market to recalibrate with precision, at massive scale, around the world to combat Climate Change. Synova, for example, can take the municipal solid waste and other forms of waste, such as agricultural waste, and can cr... fintech.tv Financial Revolution in Global Waste Management - FINTECH.TV At FullCycle, Stephan Nicoleau and his team invest in a complete \"rehaul\" of the market to recalibrate with precision, at massive scale, around the world to combat Climate Change. Synova, for example, can take the municipal solid waste and other forms of waste, such as agricultural waste, and can cr... At FullCycle, Stephan Nicoleau and his team invest in a complete \"rehaul\" of the market to recalibrate with precision, at massive scale, around the world to combat Climate Change. Synova, for example, can take the municipal solid waste and other forms of waste, such as agricultural waste, and can cr... FullCycle September 18, 2020  ·  Climate Week is quickly approaching. While we cannot be together in New York this year, please join us virtually next Thursday, September 24th for the 6th installment of The Future with FullCycle for a special conversation with FullCycle advisors Dr. Ayana Elizabeth Johnson and Dr. Katharine K. Wilkinson.   Women are on the frontlines leading the climate movement; we are thrilled to feature two of these powerful leaders of climate action: Dr. Ayana Elizabeth Johnson and Dr. Ka ... tharine Wilkinson, who have joined forces to launch a new book that showcases a diversity of voices, All We Can Save: Truth, Courage, and Solutions for the Climate Crisis.  This collection features essays and poetry from more than 40 women pioneers at the intersection of feminism and climate activism. More than a book, Dr. Johnson and Dr. Wilkinson are launching a movement of intersectional climate work.   We hope you can join us next Thursday for a nuanced, solutions-oriented, and more representative conversation on the climate crisis, where we will discuss the intersection of feminism and climate activism, and insights for how we can rapidly, radically reshape society.   https://buff.ly/3iC4ha1   See More FullCycle September 14, 2020  ·  We are honored that Forbes chose to highlight Founding Partner Ibrahim AlHusseini and the work we do through FullCycle in this year's Forbes Impact 50 list. From Forbes 400 members like Bill Gates to celebrities like Will Smith and Jada Pinkett Smith, here are the nation’s most influential impact investors. forbes.com Impact 50: Investors Seeking Profit—And Pushing For Change From Forbes 400 members like Bill Gates to celebrities like Will Smith and Jada Pinkett Smith, here are the nation’s most influential impact investors. From Forbes 400 members like Bill Gates to celebrities like Will Smith and Jada Pinkett Smith, here are the nation’s most influential impact investors. FullCycle July 10, 2020  ·  Starts in one hour: Join @ialhusseini with the Chair of  The Elders  and Former President of Ireland, Mary Robinson.  https://buff.ly/2NP7gOL Welcome! You are invited to join The Future with FullCycle: with former President of Ireland, Mary Robinson. us02web.zoom.us Welcome! You are invited to join The Future with FullCycle: with former President of Ireland, Mary Robinson. Welcome! You are invited to join The Future with FullCycle: with former President of Ireland, Mary Robinson. Welcome! You are invited to join The Future with FullCycle: with former President of Ireland, Mary Robinson. FullCycle July 9, 2020  ·  There is still time to register before tomorrow's discussion with Former President of Ireland, and Chair of The Elders Mary Robinson on Multilateral Climate Leadership.   https://buff.ly/2NP7gOL See More \n \n \n"
}