{
    "docno": "RJP768",
    "url": "https://www.facebook.com/DukeUniv/posts",
    "text": "\n Duke University - Posts | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home About Posts Photos Events YouTube Videos Virtual Experience Community See more of Duke University on Facebook Log In or Create New Account See more of Duke University on Facebook Log In Forgot account? or Create New Account Not Now English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 Duke University 2 hrs  ·  50 shades of sunsets  🌇 Duke University 9 hrs  ·  A Duke-developed artificial intelligence tool for toilets could give gastroenterologists important information to provide appropriate treatment for chronic issues. DURHAM, N.C. -- An artificial intelligence tool being developed by Duke scientists can be added to the standard toilet to help analyze patients’ stool and give gastroenterologists the information they need to provide appropriate treatment for chronic issues such as inflammatory bowel disease (IBD)... today.duke.edu ’Smart Toilet’ Uses Artificial Intelligence to Monitor Bowel Health DURHAM, N.C. -- An artificial intelligence tool being developed by Duke scientists can be added to the standard toilet to help analyze patients’ stool and give gastroenterologists the information they need to provide appropriate treatment for chronic issues such as inflammatory bowel disease (IBD)... DURHAM, N.C. -- An artificial intelligence tool being developed by Duke scientists can be added to the standard toilet to help analyze patients’ stool and give gastroenterologists the information they need to provide appropriate treatment for chronic issues such as inflammatory bowel disease (IBD)... Duke University Yesterday at 1:43 PM  ·  Even when it rains  🤩 Duke University Yesterday at 9:02 AM  ·  Congratulations to the eight incoming first-year students selected as Rubenstein Scholars for their academic achievement, leadership potential, and dedication to service. DURHAM, N.C. -- Eight incoming first-year students have been named David M. Rubenstein Scholars. The scholarship program is a merit award for outstanding Duke undergraduates who are also first-generation college students. The Class of 2025 scholars are: today.duke.edu Duke Awards Eight David M. Rubenstein Scholarships DURHAM, N.C. -- Eight incoming first-year students have been named David M. Rubenstein Scholars. The scholarship program is a merit award for outstanding Duke undergraduates who are also first-generation college students. The Class of 2025 scholars are: DURHAM, N.C. -- Eight incoming first-year students have been named David M. Rubenstein Scholars. The scholarship program is a merit award for outstanding Duke undergraduates who are also first-generation college students. The Class of 2025 scholars are: Duke University June 9 at 9:04 AM  ·  “Because I say so” is a common phrase for many parents   But when it comes to getting kids to behave, recent Duke research suggests that the voice of adult authority isn't the only thing that matters DURHAM, N.C. -- What makes preschoolers eat their veggies? Raise their hand? Wait their turn? “Because I say so” is a common refrain for many parents. But when it comes to getting kids to behave, recent research suggests that the voice of adult authority isn't the only thing that matters. Around... today.duke.edu Sometimes, Even 3-Year-Olds Just Want to Fit in With the Group DURHAM, N.C. -- What makes preschoolers eat their veggies? Raise their hand? Wait their turn? “Because I say so” is a common refrain for many parents. But when it comes to getting kids to behave, recent research suggests that the voice of adult authority isn't the only thing that matters. Around... DURHAM, N.C. -- What makes preschoolers eat their veggies? Raise their hand? Wait their turn? “Because I say so” is a common refrain for many parents. But when it comes to getting kids to behave, recent research suggests that the voice of adult authority isn't the only thing that matters. Around... Duke University June 8 at 1:39 PM  ·  Announced today —   Duke Athletics  venues will be at full capacity during the upcoming academic year  🔵 😈 DURHAM -- Duke Athletics announced Tuesday that venues will return to full capacity during the upcoming academic year. The announcement was made in conjunction with the sale of football season tickets for the 2021 season. goduke.com Athletics Venues Return to Full Capacity in 2021-22 - Duke University DURHAM -- Duke Athletics announced Tuesday that venues will return to full capacity during the upcoming academic year. The announcement was made in conjunction with the sale of football season tickets for the 2021 season. DURHAM -- Duke Athletics announced Tuesday that venues will return to full capacity during the upcoming academic year. The announcement was made in conjunction with the sale of football season tickets for the 2021 season. Duke University June 8 at 7:59 AM  ·  Interdisciplinary inquiry, academic research, and scholarship in the service of society.  These 13 incoming Blue Devils will receive Karsh International Scholarships, awarded to an intellectually and civically engaged cohort of international students. DURHAM, N.C. -- Thirteen incoming first-year students have been awarded the Karsh International Scholarship to pursue their undergraduate studies at Duke University. The scholarships are awarded to an intellectually and civically engaged cohort of international students who promote interdisciplinary... today.duke.edu Duke Awards 13 First-Year Students With Karsh International Scholarships DURHAM, N.C. -- Thirteen incoming first-year students have been awarded the Karsh International Scholarship to pursue their undergraduate studies at Duke University. The scholarships are awarded to an intellectually and civically engaged cohort of international students who promote interdisciplinary... DURHAM, N.C. -- Thirteen incoming first-year students have been awarded the Karsh International Scholarship to pursue their undergraduate studies at Duke University. The scholarships are awarded to an intellectually and civically engaged cohort of international students who promote interdisciplinary... Duke University June 7 at 8:33 AM  ·  \"This extraordinary gift from Duke Endowment advances our university’s position as a destination for exceptional faculty ... These scholars will accelerate discovery and collaborative research across our campus and around the world.” — President Price The Duke Endowment of Charlotte, N.C., is supporting Duke University’s efforts to expand its faculty in computation, materials science and the resilience of the body and brain by completing the second phase of a $100 million investment. This is the largest award Duke University has ever received. today.duke.edu $100 Million to Advance Duke Science and Technology Research The Duke Endowment of Charlotte, N.C., is supporting Duke University’s efforts to expand its faculty in computation, materials science and the resilience of the body and brain by completing the second phase of a $100 million investment. This is the largest award Duke University has ever received. The Duke Endowment of Charlotte, N.C., is supporting Duke University’s efforts to expand its faculty in computation, materials science and the resilience of the body and brain by completing the second phase of a $100 million investment. This is the largest award Duke University has ever received. Duke University June 6 at 9:00 AM  ·  Congratulations to the four incoming first-year students from North Carolina awarded Trinity Scholarships DURHAM, N.C. -- Four incoming first-year students from North Carolina have been awarded the Trinity Scholarship. The scholarship was established by Duke alumni to honor the university's origins as Trinity College in Randolph County. There are numerous Trinity Scholarships, each funded by different d... today.duke.edu Duke Names Four Trinity Scholarship Recipients from NC DURHAM, N.C. -- Four incoming first-year students from North Carolina have been awarded the Trinity Scholarship. The scholarship was established by Duke alumni to honor the university's origins as Trinity College in Randolph County. There are numerous Trinity Scholarships, each funded by different d... DURHAM, N.C. -- Four incoming first-year students from North Carolina have been awarded the Trinity Scholarship. The scholarship was established by Duke alumni to honor the university's origins as Trinity College in Randolph County. There are numerous Trinity Scholarships, each funded by different d... Duke University June 4 at 2:24 PM  ·  Jon Scheyer was formally announced as  Duke Men's Basketball 's next head coach in a press conference at Cameron Indoor Stadium this morning. Scheyer will take over the reins in April 2022, following Coach K's retirement. DURHAM – Duke University formally announced Jon Scheyer as the next head coach of the men's basketball program in a press conference in historic Cameron Indoor Stadium Friday morning. Scheyer will take over the reins of the iconic program in April of 2022. goduke.com Jon Scheyer Introduced as Next Head Coach - Duke University DURHAM – Duke University formally announced Jon Scheyer as the next head coach of the men's basketball program in a press conference in historic Cameron Indoor Stadium Friday morning. Scheyer will take over the reins of the iconic program in April of 2022. DURHAM – Duke University formally announced Jon Scheyer as the next head coach of the men's basketball program in a press conference in historic Cameron Indoor Stadium Friday morning. Scheyer will take over the reins of the iconic program in April of 2022. Duke University June 4 at 7:50 AM  ·  Extra good news this Friday — Not only is  Duke Lemur Center  reopening today for prepaid tours, but the DLC has also recently welcomed five new baby lemurs  🎉  Meet Coconut Palm, Clancy, Atticus, Malala, and Scout  🤩 +2 Duke University June 3 at 9:48 AM  ·  Happy 82nd anniversary to  Duke Engineering   🔬 🧬 ⚙️ 🚀 🔎  Since its formation, Pratt has grown into one of the nation’s fastest-rising engineering programs with nearly 3,000 faculty, staff and students, 15,000 accomplished alumni, and a record of trailblazing achievements Duke University June 2 at 5:20 PM  ·  In 46 years as a head coach at Army West Point and Duke, Coach K has amassed an NCAA-record 1,170 victories. In 41 seasons in Durham, he has led  Duke Men's Basketball  to five NCAA national championships and 12 Final Fours. Jon Scheyer has been named Coach K's successor and will be the program's 20th head coach beginning in 2022-23. DURHAM – Duke men's basketball head coach Mike Krzyzewski, who has won more Division I men's college basketball games than any coach in history, announced Wednesday that the 2021-22 season will be his final year of coaching. goduke.com Krzyzewski Announces 2021-22 as Final Season; Scheyer Named Next Head Coach - Duke University DURHAM – Duke men's basketball head coach Mike Krzyzewski, who has won more Division I men's college basketball games than any coach in history, announced Wednesday that the 2021-22 season will be his final year of coaching. DURHAM – Duke men's basketball head coach Mike Krzyzewski, who has won more Division I men's college basketball games than any coach in history, announced Wednesday that the 2021-22 season will be his final year of coaching. Duke University June 2 at 4:01 PM  ·  The winningest coach in Division I men’s basketball history will retire after the 2021-22 season — Thank you, Coach K  💙 Duke University June 2 at 9:09 AM  ·  Can’t imagine campus without  Duke University Chapel   🤩  Formally dedicated on this day in 1935, the Chapel’s iconic design was the work of prominent African American architect Julian Abele Duke University June 1 at 8:12 AM  ·  Sarah P. Duke Gardens  has officially reopened to the public  🌷   🔗   https://gardens.duke.edu/phase2 Duke University May 31 at 6:06 AM  ·  On this Memorial Day, we honor those who gave their lives in service to our country.  The university and  Duke Alumni  maintain a memorial on campus to recognize and remember Duke alumni who died while on active duty in the United States military. Located between Duke Chapel and Duke Divinity School, the memorial was first dedicated in 1993 to honor the sacrifice of Duke’s 236 World War II dead. In 2009, the names of 54 men and women who gave their lives on active duty since World War II were added to the existing wall. Duke University May 30 at 1:16 PM  ·  Congratulations to  Duke Baseball  on winning the first ACC Championship title in program history  🔵 😈 🏆   📸   Reagan Lunn Duke University May 28 at 7:24 AM  ·  President Price invites the Class of 2020 to campus for a graduation celebration the weekend of September 24-26, 2021 Dear Members of the Class of 2020, I am delighted to invite you to save the date for the Duke Class of 2020 graduation celebration, to be held on campus the weekend of September 24-26, 2021. today.duke.edu Save the Date! Class of 2020 to Celebrate Graduation on Campus Sept. 24-26 Dear Members of the Class of 2020, I am delighted to invite you to save the date for the Duke Class of 2020 graduation celebration, to be held on campus the weekend of September 24-26, 2021. Dear Members of the Class of 2020, I am delighted to invite you to save the date for the Duke Class of 2020 graduation celebration, to be held on campus the weekend of September 24-26, 2021. See More \n \n \n"
}