{
    "docno": "RJP74",
    "url": "https://www.facebook.com/FMACucriverside/?ref=py_c",
    "text": "\n Filipino Martial Arts Club at UCR - Home | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home About Photos Videos Events Posts Community See more of Filipino Martial Arts Club at UCR on Facebook Log In or Create New Account See more of Filipino Martial Arts Club at UCR on Facebook Log In Forgot account? or Create New Account Not Now Community See All 256 people like this 276 people follow this About See All (804) 372-7462 www.fmaschool.com/fmac Organization Page Transparency See More Facebook is showing information to help you better understand the purpose of a Page. See actions taken by the people who manage and post content. Page created - September 23, 2015 People 256  likes Related Pages Visayan Legacy Martial Arts Martial Arts School Eskrima Filipino Martial Arts Health/Beauty Fog City FCS Kali Martial Arts School Pekiti Tirsia Kali Hubon - Arizona Martial Arts School Eskrima Guro Philippines Martial Arts School Kali Dynamics Education Filipino Bladed Martial Arts: UBW Singapore School Cabales Serrada Escrima (Official) Martial Arts School Asian Pacific Student Programs - UCR APSP School 413 Travels Travel Agency AzKali. Renegade Kali warriors. School Clear Lake Modern Arnis Martial Arts School PTK - SMF South Bay Gym/Physical Fitness Center Modern Arnis Cyprus Martial Arts School Pekiti Tirsia Tactical Association HEL Finland/ PTTA HEL Finland Nonprofit Organization Pekiti Tirsia Kali Baltimore Martial Arts School Pekiti Tirsia Tactical Association Korea Sports Team Genbukan Haruka Dojo Martial Arts School One Accord Karate Martial Arts School GSBA USA Nonprofit Organization See More triangle-down English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 Photos See All Videos 1 1 Eskrima University 4 3 Hello highlanders! Come one come all! Filipino martial arts club here at UCR is tabling by the bell tower again, so pass by to say hi or to come play with our sticks. We meet every Thursday at SRC North multi purpose room C from 7:00 pm-9:00 pm 1 1 See All Posts Filipino Martial Arts Club at UCR February 25  ·  Hello everyone.  We unfortunately will be closing the club. All practices will cease and any issues with money/administration will be dealt with by the officers of the club. We would like to thank everyone for supporting us over the years. Remember to keep swinging those sticks! Filipino Martial Arts Club at UCR February 2  ·  It is with a broken heart that we announce that Filipino Martial Arts Club is no longer associated with Filipino Martial Arts School and Visayan Legacy Associations See All See More \n \n \n"
}