{
    "docno": "RJP708",
    "url": "https://www.workplace.com/?ref=fb4b_nav",
    "text": "\n \n \n \n \n \n \n \n \n \n \n \n \n \n Communication tools for business | Workplace from Facebook Home Home Features Why Workplace? Pricing Resources Log In Contact Us Try Workplace Menu See Workplace in action Interactive Demo \n                Learn how to use Workplace to bring your company together.\n               Workplace Product Tour \n                See how different Workplace features can help you meet your goals.\n               Calculate your potential ROI Forrester Certified ROI Calculator \n              Estimate your ROI from using Workplace for organizational communication.\n             Try the calculator Features Browse all features Live Video \n            The authentic way to communicate with your company.\n           Knowledge Library \n            Make company knowledge discoverable on desktop and mobile.\n           Groups \n            Communicate and collaborate with the right people.\n           Integrations \n            Connect to the tools you’re already using.\n           News Feed \n            Stay up to date with the company information you care about.\n           Safety Center \n            Customized messages and tracking to keep people safe and informed.\n           Use Cases HR \n            Attract, train and keep the best talent.\n           Frontline \n            Engage your deskless workforce.\n           Comms \n            Bring your company culture to life.\n           Enterprise \n            Make your large company feel smaller.\n           IT \n            Securely connect your people.\n           Remote working \n            Connect your remote workers.\n           Customer Stories Browse all stories AstraZeneca \n            Connecting 64,000 people to harness the power of community.\n           Sam's Club \n            Building community and driving business results.\n           Workplace for Good We make Workplace Advanced available for free to eligible non-profit charitable organizations Learn more Blog Unleash your potential with the Workplace One Partner Program \n            We're excited to launch the Workplace One Partner Program. Read all about it and become a Workplace partner today.\n           Why connecting frontline managers is good for business \n            New research shows how organizations are neglecting essential frontline managers. We dig into the data and explore five reasons to start connecting them.\n           View All Events Webinars and Conferences \n            See when we’re coming to an event near you.\n           Partners Technology Partners \n            Connect to the tools you already use and love\n           Service & Reseller Partners \n            Get help launching and adopting Workplace\n           Workplace One Partner Program \n            Become a partner\n           Already a Partner? \n            Sign in to the Partner Portal\n           Help & Resources Customer Resource Center \n            Free Workplace guides, toolkits and learning videos.\n           Ebooks, guides and more \n            Resources for transforming companies into communities.\n           Help Center \n            Step-by-step instructions and FAQs.\n           View All Features See Workplace in action Interactive Demo Workplace Product Tour Calculate your potential ROI Features Why Workplace? Use Cases HR Frontline Comms Enterprise IT Remote working Customer Stories Workplace for Good Pricing Resources Blog Events Webinars and Conferences Partners Technology Partners Service & Reseller Partners Workplace One Partner Program Already a Partner? Help & Resources Log In Contact Us Try Workplace Bring your company together Workplace is a communication tool that connects everyone in your company, even if they’re working remotely. Use familiar features like Groups, Chat, Rooms and Live video broadcasting to get people talking and working together. Try Workplace Contact Us Home Notifications Chat Search Workplace Explore News Feed See More Groups Company Announcements Sales Team London Team Project Planning Team Create Group People Discover People Company Announcements Open Group · 6,472 Members Chat About Posts Chat More Search Workplace Primrose Contreras   5 hrs ·  Hi everybody! I wanted to give an update about our new working from home policy and how we can use Workplace to stay in touch. LIVE 5.1k Thanks for joining. I've got some exciting news to share with you today. 3.2K 349 comments 98 shares Seen by 6K Dhruv Spencer  created a poll 5 hrs ·  How often should we hold all-company meetings? We’d love to get your thoughts on how often we should hold these town hall style meetings. So please vote! Weekly Monthly Quarter Annual 105 12 comments 21 shares Seen by 2K Samantha Cheung  thanked you Thursday at 2:04 PM ·  \n          Thanks for stepping in to help us close the deal, Jay! \n         23 2 comments 5 shares Seen by 401 Aneri Bhandari   Yesterday at 10:14 PM ·  Livestreaming Product Reviews We've heard from feedback that people want more transparency around product reviews. Our Engineering SVP Anne Hastings will be using Workplace Live to broadcast this quarter's reviews so you can see what's on her mind. Follow along in this Group on Wednesday at 3pm. 67 11 comments 18 shares Seen by 2K Primrose Contreras   5 hrs ·  Hi everybody! I wanted to give an update about our new working from home policy and how we can use Workplace to stay in touch. LIVE 5.1k Thanks for joining. I've got some exciting news to share with you today. 3.2K 349 comments 98 shares Seen by 6K Dhruv Spencer  created a poll 5 hrs ·  How often should we hold all-company meetings? We’d love to get your thoughts on how often we should hold these town hall style meetings. So please vote! Weekly Monthly Quarter Annual 105 12 comments 21 shares Seen by 2K Samantha Cheung  thanked you Thursday at 2:04 PM ·  \n          Thanks for stepping in to help us close the deal, Jay! \n         23 2 comments 5 shares Seen by 401 Aneri Bhandari   Yesterday at 10:14 PM ·  Livestreaming Product Reviews We've heard from feedback that people want more transparency around product reviews. Our Engineering SVP Anne Hastings will be using Workplace Live to broadcast this quarter's reviews so you can see what's on her mind. Follow along in this Group on Wednesday at 3pm. 67 11 comments 18 shares Seen by 2K Primrose Contreras   5 hrs ·  Hi everybody! I wanted to give an update about our new working from home policy and how we can use Workplace to stay in touch. LIVE 5.1k Thanks for joining. I've got some exciting news to share with you today. 3.2K 349 comments 98 shares Seen by 6K Dhruv Spencer  created a poll 5 hrs ·  How often should we hold all-company meetings? We’d love to get your thoughts on how often we should hold these town hall style meetings. So please vote! Weekly Monthly Quarter Annual 105 12 comments 21 shares Seen by 2K Samantha Cheung  thanked you Thursday at 2:04 PM ·  \n          Thanks for stepping in to help us close the deal, Jay! \n         23 2 comments 5 shares Seen by 401 Aneri Bhandari   Yesterday at 10:14 PM ·  Livestreaming Product Reviews We've heard from feedback that people want more transparency around product reviews. Our Engineering SVP Anne Hastings will be using Workplace Live to broadcast this quarter's reviews so you can see what's on her mind. Follow along in this Group on Wednesday at 3pm. 67 11 comments 18 shares Seen by 2K About Members Shared In This Group Upload a File Photos and Videos Workplace Transform North America At Workplace Transform North America, we’ll be bringing together employee experience experts who are using Workplace to put people at the heart of their organizations. Join us virtually on June 23rd at 10am PST. Register Now Join over 7m paying subscribers on Workplace Talk to everyone Workplace makes it easy to speak to everybody in your company, from head office to the shop floor. Talk to the right people at the right time with Groups Capture their attention with Live video Measure the impact with Insights How Workplace lets you talk to everyone Engage with everyone Your people have great ideas. Workplace gives everyone a voice so you can start making the most of them. Hear instant feedback through Comments and Reactions Open the conversation to everyone with Auto-Translate Get input on decisions with Polls and Surveys How Workplace gives everyone a voice Access for everyone Workplace is simple, secure and connects everybody, whether they're behind a desk or in front of customers. Manage employee access through G Suite and Azure Get emailless workers on board with Access Codes Put safety first with Single Sign-On and Access Controls How Workplace connects everyone Discover the secrets of connected companies “With Workplace, we've seen the inspiration and innovation that come from connecting people who have never been able to interact before.” Cristina Macina, Global Internal Communications & Engagement Strategy Lead, Nestlé “With Workplace, it's our people that create the messages and start the conversations. That makes it far more interactive and engaging.” Suzie Elliott, CHRO, Farmers Insurance “Workplace makes our executives much more effective in their communications because they’re much more visible.\" Roeland van der Heiden, Digital Director, Global Corporate Affairs, AstraZeneca Previous Next Show slide number 1 Show slide number 2 Show slide number 3 Get Started Enter your email to start your free trial today. Your Business Email Try Workplace Share to Twitter Share to LinkedIn Share to Facebook Share to Instagram Legal Terms Workplace Status Security Brand Guidelines Help Privacy Policy English (US) English (UK) 日本語 Español Français (France) Italiano Português (Brasil) ภาษาไทย Tiếng Việt English (US) Facebook © 2021 \n \n \n \n \n \n \n \n \n   \n"
}