{
    "docno": "RJP77",
    "url": "https://www.facebook.com/CaltechSeismo/?ref=py_c",
    "text": "\n Caltech Seismological Laboratory - Home | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home Posts About Photos Community See more of Caltech Seismological Laboratory on Facebook Log In or Create New Account See more of Caltech Seismological Laboratory on Facebook Log In Forgot account? or Create New Account Not Now Caltech Seismological Laboratory Science, Technology & Engineering in Pasadena, California Community See All 90 people like this 99 people follow this 2 check-ins About See All 1200 E California Blvd (29.18 mi)  Pasadena, CA, CA 91125 Get Directions (626) 395-6919 www.seismolab.caltech.edu/index.html Science, Technology & Engineering Page Transparency See More Facebook is showing information to help you better understand the purpose of a Page. See actions taken by the people who manage and post content. Page created - January 6, 2020 People 90  likes 2   visits Related Pages Carnegie Mellon Robotics Institute - RI Education Bruin Spacecraft Group at UCLA Aerospace Company Wisekarte Innovation Private Limited Electronics Caltech Graduate Student Council College & University Caltech Neuroscience Science, Technology & Engineering Underwater Robotics at Berkeley Organization American Society of Mechanical Engineers at UCSD Organization Bright and Sparkly with Pauline Health/Beauty Prodigal Daughter: A Memoir Book University Avenue Baptist Church Baptist Church Southern California Section of the American Chemical Society Nonprofit Organization Caltech Center for Teaching, Learning, & Outreach College & University UCLA ELFIN Satellite Aerospace Company Caltech Alpine Club Organization Caltech Beavers School Sports Team Distinctive Voices Nonprofit Organization Development Engineering Master Education Website Laurell Spin Coater Commercial Equipment Harvard Undergraduate Science Olympiad College & University CMU Silicon Valley College & University See More triangle-down Pages Liked by This Page Caltech Caltech Alumni Association Caltech Magazine Places Pasadena, California Caltech Seismological Laboratory English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 Posts Caltech Seismological Laboratory January 7, 2020  ·  An international team of geoscientists led by Caltech has used fiber optic communications cables stationed at the bottom of the North Sea as a giant seismic network, tracking both earthquakes and ocean waves. A fiber optic network in the North Sea was used to record seismicity. caltech.edu Submarine Cables to Offshore Wind Farms Transformed into a Seismic Network A fiber optic network in the North Sea was used to record seismicity. A fiber optic network in the North Sea was used to record seismicity. Caltech Seismological Laboratory January 6, 2020  ·  Did you know that the Seismo Lab offers tours to middle and high school classes?  Click the link to learn more about this opportunity for your young scientists to visit a working laboratory! Caltech's Seismological Laboratory, an arm of the Division of Geological and Planetary Sciences (GPS), was established in 1921. It has a distinguished history of leadership in science and serving the public interest. Internationally recognized for excellence in geophysical research and academics whi... seismolab.caltech.edu Seismo Lab Tours - Caltech Seismological Laboratory Caltech's Seismological Laboratory, an arm of the Division of Geological and Planetary Sciences (GPS), was established in 1921. It has a distinguished history of leadership in science and serving the public interest. Internationally recognized for excellence in geophysical research and academics whi... Caltech's Seismological Laboratory, an arm of the Division of Geological and Planetary Sciences (GPS), was established in 1921. It has a distinguished history of leadership in science and serving the public interest. Internationally recognized for excellence in geophysical research and academics whi... See All Photos See All Posts See More \n \n \n"
}