{
    "docno": "RJP752",
    "url": "https://fr-fr.facebook.com/policies/cookies/",
    "text": "\n Politique d’utilisation des cookies \n \n \n \n \n \n \n \n \n \n \n \n \n Aller vers Sections de cette Page Aide accessibilité Facebook Adresse e-mail ou mobile Mot de passe Informations de compte oubliées ? S’inscrire Ressources complémentaires  Version imprimable de la Politique d’utilisation des cookies   Politique d’utilisation des données   Conditions générales   Paramètres des publicités Facebook   Privacy Basics  Cookies et autres technologies de stockage  Les cookies sont de petits éléments de texte qui servent à stocker des informations sur les navigateurs web. Les cookies sont notamment utilisés pour stocker et recevoir des identifiants et d’autres informations sur des appareils comme les ordinateurs ou les téléphones. D’autres technologies, dont les données que nous stockons sur votre navigateur web ou sur votre appareil, les identifiants associés à votre appareil et d’autres logiciels, sont utilisées dans des buts similaires. Dans la présente politique, nous désignons toutes ces technologies par le terme « cookies ».   Nous utilisons des cookies si vous avez un compte Facebook, si vous utilisez les  Produits Facebook , y compris notre site web et nos applications, ou si vous consultez d’autres sites web et applications qui ont recours aux Produits Facebook (notamment le bouton J’aime et d’autres Technologies Facebook). Les cookies permettent à Facebook de vous proposer les Produits Facebook et de comprendre les informations reçues de votre part, notamment les informations concernant votre utilisation des autres sites web et applications, que vous soyez inscrit(e) ou connecté(e) ou non.   Cette politique explique comment nous utilisons les cookies et présente les choix dont vous disposez à cet égard. Sauf indication contraire dans la présente politique, la  Politique d’utilisation des données  s’appliquera à nos traitements des données que nous collectons au moyen des cookies.  Revenir en haut  Pourquoi utilisons-nous des cookies ?   Les cookies nous aident à proposer, à protéger et à améliorer les Produits Facebook (par exemple, en personnalisant le contenu), ainsi qu’à adapter et à mesurer les publicités, et à offrir une expérience plus sûre. Les cookies que nous utilisons comprennent des cookies de session, qui sont supprimés lorsque vous fermez votre navigateur, et des cookies permanents, qui restent sur votre navigateur jusqu’à ce qu’ils expirent ou que vous les supprimiez. Bien que les cookies que nous utilisons puissent changer au fil des améliorations et des mises à jour des Produits Facebook, nous les utilisons aux fins suivantes :  Authentification Nous utilisons des cookies pour vérifier votre compte et pour déterminer les moments où vous êtes connecté(e), de façon à faciliter votre accès aux Produits Facebook et à vous proposer une expérience et des fonctionnalités adaptées à votre utilisation. Par exemple :  Nous utilisons des cookies pour que vous restiez connecté(e) lorsque vous naviguez d’une Page Facebook à l’autre. Ils nous aident aussi à enregistrer votre navigateur web pour que vous n’ayez pas à vous reconnecter à Facebook à chaque fois et pour que vous puissiez plus facilement vous connecter à Facebook par le biais d’applications et de sites web tiers. Par exemple, nous utilisons les cookies « c_user » and « xs » à cette fin, dont la durée de vie est de 365 jours.  Sécurité du site et intégrité des produits  Nous utilisons des cookies pour garantir la sécurité de votre compte, de vos données et des Produits Facebook.  Par exemple :  Les cookies peuvent nous aider à déterminer si quelqu’un tente d’accéder à un compte Facebook sans autorisation (par exemple, en devinant rapidement différents mots de passe) et à imposer des mesures de sécurité supplémentaires. Nous utilisons également des cookies pour stocker des informations qui nous permettent de récupérer votre compte si vous oubliez votre mot de passe, ou de demander une authentification supplémentaire si vous nous prévenez que votre compte a été piraté. Cela inclut, par exemple, nos cookies « sb » et « dbin », qui nous permettent d’identifier votre navigateur en toute sécurité. Les cookies nous permettent également de lutter contre les activités qui enfreignent nos politiques ou qui dégradent notre capacité à fournir les Produits Facebook. Par exemple :  Les cookies nous aident à lutter contre les spams et les tentatives d’hameçonnage, en nous permettant d’identifier des ordinateurs utilisés pour créer un nombre important de faux comptes Facebook. Nous utilisons également des cookies pour détecter les ordinateurs infectés par des logiciels malveillants et les empêcher de causer davantage de dégâts. Notre cookie « csrf », par exemple, nous aide à empêcher des attaques de type « Cross-site request forgery ». Les cookies nous aident également à empêcher la création de comptes Facebook par des personnes non autorisées à s’inscrire en raison de leur âge. Publicités, recommandations, statistiques et mesures  Nous utilisons des cookies afin de proposer des publicités et de faire des recommandations pour des entreprises et d’autres organisations à des gens qui pourraient être intéressés par leurs produits, leurs services ou les causes qu’elles soutiennent.  Par exemple :  Les cookies nous permettent de présenter des publicités à des personnes qui ont déjà consulté le site web d’une entreprise ou acheté ses produits ou utilisé ses applications, et pour recommander des produits et des services sur la base de cette activité. Les cookies nous permettent de limiter le nombre de fois que vous voyez une publicité, pour que la même publicité ne s’affiche pas encore et encore. Par exemple, le cookie « fr » est utilisé pour fournir, mesurer et améliorer la pertinence des publicités, et sa durée de vie est de 90 jours.   Ils nous aident également à mesurer l’efficacité des campagnes publicitaires diffusées par des entreprises qui utilisent les Produits Facebook.  Par exemple :  Nous utilisons des cookies pour compter le nombre de fois où une publicité est diffusée et pour calculer le coût de ces publicités. Nous utilisons également des cookies pour mesurer la fréquence à laquelle les personnes agissent, comme le fait de faire un achat après avoir vu une publicité. Le cookie « _fbp » identifie les navigateurs pour offrir des services publicitaires et d’analyse de sites, et a une durée de vie de 90 jours. .  Les cookies nous aident à diffuser et à mesurer des publicités sur différents navigateurs et appareils utilisés par une même personne.  Par exemple :  Nous pouvons utiliser des cookies pour que la même publicité ne s’affiche pas encore et encore sur les différents appareils dont vous vous servez.  Ils nous permettent également de proposer des statistiques sur les personnes qui utilisent les Produits Facebook et les personnes qui interagissent avec les publicités, les sites web et les applications de nos annonceurs et des entreprises qui utilisent les Produits Facebook.  Par exemple :  Grâce aux cookies, nous aidons les entreprises à comprendre qui sont les personnes qui aiment leur Page Facebook ou qui utilisent leurs applications, afin qu’elles puissent proposer un contenu plus pertinent et développer des fonctionnalités susceptibles d’intéresser leurs clients.  Nous utilisons aussi des cookies, comme notre cookie « oo » dont la durée de vie est de cinq ans, pour vous permettre de ne plus voir certaines publicités sur Facebook en fonction de vos activités sur les sites web tiers.  Découvrez  quelles informations nous recevons, comment nous choisissons les publicités que nous vous proposons sur les Produits Facebook et en dehors, et les possibilités de contrôle qui s’offrent à vous.  Fonctionnalités et services du site  Nous utilisons des cookies pour mettre en place des fonctionnalités qui nous aident à proposer les Produits Facebook.  Par exemple :  Les cookies nous aident à enregistrer les préférences, à savoir quand vous avez vu ou interagi avec le contenu des Produits Facebook, et à vous proposer un contenu et des expériences personnalisés. Par exemple, les cookies nous permettent de faire des suggestions, à vous et aux autres personnes, mais aussi de personnaliser le contenu des sites tiers dans lesquels nos modules sociaux sont intégrés. Si vous êtes administrateur d’une Page, les cookies vous permettent de passer d’une publication sur votre compte Facebook personnel à une publication sur cette Page. Nous utilisons des cookies comme le cookie de présence temporaire pour supporter votre utilisation des fenêtres de discussion Messenger.  Nous utilisons également des cookies pour vous proposer un contenu qui correspond à vos paramètres régionaux.  Par exemple :  Nous stockons des données dans un cookie placé sur votre navigateur ou votre appareil, afin que le site s’affiche dans votre langue de préférence. Performance Les cookies nous servent à rendre votre utilisation du site aussi agréable que possible. Par exemple :  Les cookies nous aident à acheminer le trafic entre les serveurs et à comprendre la vitesse de chargement des Produits Facebook pour différentes personnes. Les cookies nous aident aussi à enregistrer le format et les dimensions de votre écran et de vos fenêtres et à savoir lorsque vous activez le mode de contraste élevé, de façon à afficher correctement notre site et nos applications. Par exemple, nous installons les cookies « dpr » et « wd », ayant chacun une durée de vie de 7 jours, pour fournir une expérience optimale sur l’écran de votre appareil.  Analyse et recherche Nous utilisons des cookies pour mieux comprendre comment les gens se servent des Produits Facebook, afin de pouvoir les améliorer. Par exemple :  Les cookies nous aident à comprendre comment les gens se servent du Service Facebook, à analyser quelles parties des Produits Facebook ils trouvent les plus utiles et intéressantes, et à identifier les fonctionnalités qui pourraient être améliorées. Google Analytics  Nous plaçons également des cookies depuis le domaine Facebook.com qui fonctionnent avec le service Google Analytics, afin de comprendre comment les entreprises utilisent les sites de développeurs de Facebook. Ces cookies ont des noms tels que __utma, __utmb, __utmc, __utmz, __qca, and _ga.  Sites web et applications externes  Nos partenaires commerciaux peuvent également choisir de partager leurs informations avec Facebook à l’aide de cookies placés sur les domaines de leurs propres site web, que vous ayez ou non un compte Facebook ou que vous soyez connecté(e) ou non. Plus précisément, des cookies nommés _fbc ou _fbp peuvent être placés sur le domaine du partenaire commercial de Facebook dont vous consultez le site. Contrairement aux cookies installés sur les domaines appartenant à Facebook, Facebook ne peut pas accéder à ces cookies lorsque vous êtes sur un autre site que celui sur lequel ils sont installés, y compris lorsque vous vous trouvez sur l’un de nos domaines. Ils ont les mêmes fonctions que les cookies placés sur les domaines de Facebook, c’est-à-dire de personnaliser le contenu (y compris les publicités), d’adapter et de mesurer les publicités, de produire des données d’analyse et de proposer une expérience plus sécurisée, comme indiqué en détail dans cette Politique d’utilisation des cookies.  Revenir en haut Quand utilisons-nous des cookies ?  Nous pouvons placer des cookies sur votre ordinateur ou votre appareil et recevoir les informations stockées dans des cookies lorsque vous utilisez ou consultez :  les  Produits Facebook  ; les produits proposés par d’autres membres des  Entités Facebook  ; et des sites web et des applications proposés par d’autres entreprises qui utilisent les Produits Facebook, notamment des entreprises qui intègrent les Technologies Facebook à leurs sites web et à leurs applications. Facebook utilise des cookies et reçoit des informations lorsque vous consultez ces sites et ces applications, notamment des  informations sur les appareils  et des informations à propos de votre activité, sans autre action de votre part. Cela se produit que vous ayez ou non un compte Facebook et que vous soyez ou non connecté(e). Revenir en haut D’autres entités utilisent-elles des cookies en lien avec les Produits Facebook ?  Oui, d’autres entités sont susceptibles d’utiliser des cookies sur les Produits Facebook pour nous fournir des services, à nous ainsi qu’aux entreprises qui font de la publicité sur Facebook.   Par exemple, nos partenaires de mesure utilisent des cookies sur les Produits Facebook pour aider les annonceurs à comprendre l’efficacité de leurs campagnes publicitaires Facebook et pour comparer les performances de ces campagnes à celles de publicités diffusées sur d’autres sites web ou d’autres applications.  Découvrez  quelles entreprises utilisent des cookies sur les Produits Facebook.   Des tiers peuvent également utiliser des cookies sur leurs propres sites et applications en lien avec les Produits Facebook. Pour comprendre comment ces tiers utilisent les cookies, veuillez consulter leurs politiques.  Revenir en haut Comment pouvez-vous contrôler l’utilisation des cookies par Facebook ?  Nous utilisons des cookies pour vous aider à personnaliser et améliorer le contenu et les services, fournir une expérience plus sécurisée et vous montrer des publicités utiles et pertinentes sur Facebook et ailleurs. Vous pouvez contrôler la façon dont nous exploitons les données pour vous proposer des publicités et plus, grâce aux outils décrits ci-dessous.  Si vous avez un compte Facebook : Vous pouvez utiliser vos  préférences publicitaires  afin de savoir pourquoi vous voyez une publicité en particulier et de contrôler la façon dont nous utilisons les informations que nous recueillons pour vous proposer des publicités. Afin de vous montrer des publicités plus pertinentes, nous utilisons les données que les annonceurs et d’autres partenaires nous fournissent à propos de votre activité en dehors des Produits des Entités Facebook, notamment les sites web et les applications. Vous pouvez décider si nous pouvons utiliser ces données pour vous présenter des publicités dans vos  paramètres publicitaires . L’Audience Network de Facebook permet aux annonceurs de vous présenter des publicités sur des applications et des sites web qui ne font pas partie des  Produits des entités Facebook . L’Audience Network peut vous présenter des publicités pertinentes en analysant, entre autres, vos préférences publicitaires et en déterminant ainsi les publicités susceptibles de vous intéresser. Vous pouvez définir cela dans vos  paramètres publicitaires.  Vous pouvez consulter votre activité en dehors de Facebook que des entreprises et des organisations partagent avec nous au sujet de vos interactions avec elles, comme les visites sur leurs applications ou sites web. Ils utilisent nos  Outils Business , comme le pixel Facebook, pour partager des informations avec nous. Cela nous permet notamment de vous offrir une expérience plus personnalisée sur Facebook. En savoir plus  sur l’activité en dehors de Facebook , comment nous l’utilisons et comment vous pouvez la gérer. Tout le monde :  Vous pouvez vous désinscrire des publicités basées sur les centres d’intérêt en ligne émanant de Facebook et de toutes entreprises participantes par le biais de la  Digital Advertising Alliance  aux États-Unis, la  Digital Advertising Alliance of Canada  au Canada ou la  European Interactive Digital Advertising Alliance  en Europe, ou par le biais des paramètres de votre appareil mobile, lorsqu’ils sont disponibles, si vous utilisez Android, iOS 13 ou une version antérieure d’iOS. Remarque : les bloqueurs de publicité et les outils qui restreignent notre utilisation des cookies peuvent interférer avec ces contrôles.  Plus d’informations sur la publicité en ligne : Les agences de publicité avec lesquelles nous travaillons utilisent généralement des cookies et des technologies similaires dans le cadre de leurs services. Pour en savoir plus sur la manière dont les annonceurs utilisent généralement les cookies et sur les choix dont vous disposez par rapport à ceux-ci, reportez-vous aux ressources ci-après :  Alliance de la publicité numérique Alliance canadienne de la publicité numérique Alliance européenne pour l’éthique en matière de publicité numérique Contrôle des cookies de navigateur : De plus, votre navigateur ou votre appareil propose peut-être des paramètres vous permettant de choisir si les cookies du navigateur sont activés et de les supprimer. Ces contrôles varient en fonction du navigateur et les fabricants peuvent modifier les paramètres disponibles et le fonctionnement de ceux-ci à tout moment. Depuis le 5 octobre 2020, vous pouvez trouver des informations supplémentaires sur les contrôles proposés par les navigateurs populaires en consultant les liens ci-dessous. Certaines parties des Produits Facebook peuvent ne pas fonctionner correctement si vous avez désactivé l’utilisation des cookies dans votre navigateur. Soyez conscient que ces contrôles sont distincts de ceux que Facebook vous propose.  Google Chrome ; Internet Explorer. Firefox ; Safari ; Safari Mobile Opera.  Date de la dernière révision : 5 octobre 2020  Français (France) English (US) Español 中文(简体) العربية Português (Brasil) 한국어 Italiano Deutsch हिन्दी 日本語 S’inscrire Connexion Messenger Facebook Lite  Watch  Personnes Pages Catégories de Page Lieux Jeux Lieux Marketplace Facebook Pay Groupes Offres d’emploi Oculus Portal Instagram Local Collectes de fonds Services Centre d’information sur les élections À propos Créer une publicité Créer une Page Développeurs Emplois Confidentialité Cookies Choisir sa pub Conditions générales Aide Paramètres Historique personnel  Facebook © 2021 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n"
}