{
    "docno": "RJP751",
    "url": "https://es-la.facebook.com/policies/cookies/",
    "text": "\n Política de cookies \n \n \n \n \n \n \n \n \n \n \n \n \n Ir a Secciones de esta página Ayuda sobre accesibilidad Facebook Correo electrónico o teléfono Contraseña ¿Olvidaste tu cuenta? Registrarte Más recursos  Política de cookies para imprimir   Política de datos   Condiciones   Configuración de anuncios de Facebook   Aspectos básicos de la privacidad  Cookies y otras tecnologías de almacenamiento  Las cookies son pequeños fragmentos de texto que se utilizan para conservar información en navegadores web. Se usan para almacenar y recibir identificadores y otros datos en computadoras, teléfonos y otros dispositivos. Otras tecnologías, incluidos datos que almacenamos en tu navegador web o dispositivo, identificadores asociados con tu dispositivo y otras herramientas de software, se utilizan con fines similares. En esta política, nos referimos a todas estas tecnologías con el nombre de \"cookies\".   Utilizamos cookies si tienes una cuenta de Facebook, utilizas los  Productos de Facebook , como nuestro sitio web y nuestras apps, o visitas otros sitios web y apps que usan los Productos de Facebook (incluidos el botón \"Me gusta\" u otras tecnologías de Facebook). Las cookies permiten a Facebook ofrecerte los Productos de Facebook y entender la información que recibimos sobre ti, incluidos datos sobre cómo usas otros sitios web y apps o si te registraste o iniciaste sesión en ellos.   En esta política, se explica cómo usamos las cookies y las opciones que tienes. Excepto que se especifique lo contrario en esta política, la  Política de datos  se aplicará a nuestro tratamiento de los datos que recopilamos mediante cookies.  Volver arriba  ¿Por qué utilizamos cookies?   Las cookies nos ayudan a proporcionar, proteger y mejorar los Productos de Facebook, ya que nos permiten, por ejemplo, personalizar el contenido, adaptar los anuncios y medir su rendimiento, y brindar una experiencia más segura. Entre ellas se incluyen las cookies de sesión, que se eliminan cuando cierras el navegador, y las persistentes, que permanecen en el navegador hasta que caducan o las eliminas. Si bien las cookies pueden cambiar de vez en cuando a medida que mejoramos y actualizamos los Productos de Facebook, las utilizamos con los fines que se detallan a continuación:  Autenticación Utilizamos cookies para verificar tu cuenta y determinar cuándo inicias sesión. De este modo, podemos ayudarte a acceder a los Productos de Facebook con mayor facilidad y mostrarte la experiencia y las funciones correspondientes. Por ejemplo:  utilizamos cookies para mantener tu sesión abierta mientras navegas entre páginas de Facebook. Las cookies también nos ayudan a recordar tu navegador, de tal modo que no tengas que iniciar sesión en Facebook constantemente y puedas hacerlo fácilmente mediante apps y sitios web de terceros. Para esto usamos las cookies \"c_user\" y \"xs\", por ejemplo, con una duración de 365 días.  Seguridad e integridad de los sitios y productos  Utilizamos cookies para proteger tu cuenta, tus datos y los Productos de Facebook.  Por ejemplo:  las cookies pueden ayudarnos a determinar e imponer medidas adicionales de seguridad en caso de que alguien intente acceder a una cuenta de Facebook sin autorización, por ejemplo, adivinando rápidamente diferentes contraseñas. También utilizamos cookies para almacenar información que nos permita recuperar tu cuenta en caso de que olvides la contraseña o para solicitar información adicional de autenticación si nos indicas que hackearon tu cuenta. Estas incluyen, por ejemplo, nuestras cookies \"sb\" y \"dbln\", que nos permiten identificar tu navegador de forma segura. También utilizamos cookies para combatir actividades que infringen nuestras políticas o afectan de otro modo nuestra capacidad de proporcionar los Productos de Facebook. Por ejemplo:  las cookies nos ayudan a combatir el spam y los ataques de phishing al permitirnos identificar las computadoras que se usan para crear un gran número de cuentas de Facebook falsas. También usamos cookies para detectar computadoras infectadas con malware y adoptar medidas que impidan que causen daños mayores. Nuestra cookie \"csrf\", por ejemplo, nos ayuda a prevenir ataques de falsificación de solicitudes entre sitios. Las cookies también nos ayudan a impedir que menores de edad se registren en Facebook. Publicidad, recomendaciones, estadísticas y medición  Utilizamos cookies para mostrar anuncios y hacer recomendaciones de negocios y otras organizaciones a personas que pueden estar interesadas en los productos, los servicios o las causas que promocionan.  Por ejemplo:  las cookies nos permiten entregar anuncios a personas que ya visitaron el sitio web de un negocio, compraron sus productos o usaron sus apps, así como recomendar productos y servicios en función de esa actividad. También nos permiten limitar el número que se muestra un anuncio para que no veas el mismo una y otra vez. Por ejemplo, la cookie \"fr\" se usa para entregar anuncios, medirlos y mejorar su relevancia, y tiene una duración de 90 días.   También utilizamos cookies para medir el rendimiento de las campañas publicitarias de negocios que usan los Productos de Facebook.  Por ejemplo:  utilizamos cookies para llevar un recuento del número de veces que se muestra un anuncio y calcular su costo. También usamos cookies para medir la frecuencia con la que se realizan acciones, como comprar un producto después de ver la impresión de un anuncio. La cookie\"_fbp\" identifica navegadores para proporcionar servicios de análisis de sitios y publicidad, y tiene una duración de 90 días. .  Las cookies nos ayudan a mostrar y medir anuncios en diferentes navegadores y dispositivos utilizados por la misma persona.  Por ejemplo:  podemos utilizar cookies para impedir que veas el mismo anuncio una y otra vez en los diferentes dispositivos que usas.  Las cookies también nos permiten proporcionar estadísticas sobre las personas que usan los Productos de Facebook, las que interactúan con los anuncios, los sitios web y las apps de nuestros anunciantes, y los negocios que usan dichos Productos.  Por ejemplo:  utilizamos cookies para ayudar a los negocios a conocer qué tipo de personas indican que les gusta su página de Facebook o usan sus apps, de tal modo que puedan ofrecer contenido más relevante y desarrollar funciones con mayores probabilidades de interesar a sus clientes.  También usamos cookies, como nuestra cookie \"oo\" con cinco años de duración, para ayudarte a indicar que no quieres ver anuncios de Facebook en función de tu actividad en sitios web de terceros.  Obtén más información  sobre los datos que recibimos, cómo decidimos qué anuncios mostrarte tanto dentro como fuera de los Productos de Facebook y los controles que tienes a tu disposición.  Funciones y servicios del sitio  Utilizamos cookies para habilitar las funciones que nos ayudan a proporcionar los Productos de Facebook.  Por ejemplo:  las cookies nos ayudan a almacenar preferencias, saber cuándo viste contenido de Productos de Facebook o interactuaste con él, y ofrecerte contenido y experiencias personalizados. Por ejemplo, nos permiten realizar sugerencias a las personas y personalizar el contenido de sitios de terceros que usen nuestros plugins sociales. Si eres administrador de una página, las cookies te permiten publicar en nombre de tu cuenta personal de Facebook o de tu página. Usamos cookies como la cookie basada en sesiones \"presence\" para permitirte usar ventanas de chat de Messenger.  También utilizamos cookies a fin de ofrecerte contenido relevante para tu configuración regional.  Por ejemplo:  almacenamos información en una cookie instalada en tu navegador o dispositivo para que veas el sitio web en tu idioma preferido. Rendimiento Usamos cookies para ofrecerte la mejor experiencia posible. Por ejemplo:  las cookies nos ayudan a dirigir el tráfico entre los servidores y conocer con qué rapidez se cargan los Productos de Facebook para distintas personas. También nos ayudan a registrar la relación de aspecto y las dimensiones de la pantalla y las ventanas, y a saber si tienes activado el modo de contraste alto para que podamos mostrar correctamente nuestros sitios y apps. Por ejemplo, usamos las cookies \"dpr\" y \"wd\", cada una con una duración de siete días, para entregar una experiencia óptima para la pantalla de tu dispositivo.  Análisis e investigación Utilizamos cookies para conocer mejor cómo se utilizan los Productos de Facebook con el fin de mejorarlos. Por ejemplo:  las cookies nos ayudan a conocer cómo se utiliza el servicio de Facebook, analizar qué partes de los Productos de Facebook resultan más útiles e interesantes, e identificar funciones para mejorar. Google Analytics  También instalamos cookies del dominio Facebook.com que colaboran con el servicio de Google Analytics para ayudarnos a comprender cómo utilizan los negocios los sitios para desarrolladores de Facebook. Estas cookies tienen nombres como \"__utma\", \"__utmb\", \"__utmc\", \"__utmz\", \"__qca\" y \"_ga\".  Sitios web y apps de terceros  Nuestros socios comerciales también pueden decidir compartir con Facebook información proveniente de cookies instaladas en los dominios de sus propios sitios web, independientemente de si tienes una cuenta de Facebook o si iniciaste sesión en ella. Las cookies \"_fbc\" o \"_fbp\" en particular pueden estar instaladas en el dominio del sitio web del socio comercial de Facebook que visitas. Facebook no tiene acceso a estas cookies cuando no estás en el sitio en que se instalaron (ni siquiera si visitas uno de nuestros dominios), a diferencia de las cookies instaladas en los propios dominios de Facebook. Permiten realizar las mismas funciones que las cookies instaladas en el propio dominio de Facebook, como personalizar contenido (incluidos anuncios), medir anuncios, generar análisis y ofrecer una experiencia más segura, como se establece en esta Política de cookies.  Volver arriba ¿Dónde utilizamos las cookies?  Podemos colocar cookies en tu computadora o dispositivo y recibir información almacenada en ellas cuando utilizas o visitas:  los  Productos de Facebook ; los productos proporcionados por otros miembros de las  empresas de Facebook ; y los sitios web y las apps proporcionados por otras empresas que utilizan los Productos de Facebook, incluidas empresas que incorporan las tecnologías de Facebook en sus sitios web y apps. Facebook usa cookies y recibe información cuando visitas esos sitios y apps, incluida  información del dispositivo  e información sobre tu actividad, sin ninguna intervención adicional de tu parte. Esto sucede sin importar si tienes o no una cuenta de Facebook o si iniciaste sesión en ella. Volver arriba ¿Otras partes utilizan cookies en relación con los Productos de Facebook?  Sí, otras partes pueden utilizar cookies en los Productos de Facebook para brindar servicios tanto a nosotros como a los negocios que se anuncian en Facebook.   Por ejemplo, nuestros socios de medición utilizan cookies en los Productos de Facebook para ayudar a los anunciantes a conocer la eficacia de sus campañas publicitarias de Facebook y a comparar el rendimiento de dichas campañas con el de anuncios mostrados en otros sitios web y apps.  Obtén más información  sobre las empresas que utilizan cookies en los Productos de Facebook.   Existen terceros que también utilizan cookies en sus propios sitios y apps en relación con los Productos de Facebook. Para conocer cómo otras partes usan las cookies, consulta sus políticas.  Volver arriba ¿Cómo puedes controlar el uso que hace Facebook de las cookies?  Usamos cookies para personalizar y mejorar el contenido y los servicios, proporcionar una experiencia más segura y mostrarte anuncios útiles y relevantes dentro y fuera de Facebook. Puedes controlar cómo utilizamos los datos para mostrarte anuncios y más mediante las herramientas que se describen a continuación.  Si tienes una cuenta de Facebook: Puedes usar tus  preferencias de anuncios  para saber por qué ves un anuncio en particular y controlar el uso que hacemos de la información que recopilamos para mostrarte anuncios. Para mostrarte anuncios más relevantes, usamos datos que los anunciantes y otros socios nos proporcionan sobre tu actividad fuera de los Productos de las empresas de Facebook, incluidos sitios web y apps. Desde la  configuración de anuncios , puedes decidir si quieres que usemos estos datos para mostrarte anuncios. Facebook Audience Network permite a los anunciantes mostrarte anuncios en apps y sitios web fuera de los  Productos de las empresas de Facebook . Una de las formas en las que Audience Network muestra anuncios relevantes es mediante tus preferencias de anuncios. Gracias a ellas, puede determinar qué anuncios te pueden interesar. Puedes controlar esto en la  configuración de anuncios .  Puedes revisar tu actividad fuera de Facebook, que es un resumen de actividad que negocios y organizaciones comparten con nosotros en relación con las interacciones que llevas a cabo con ellos, como cuando visitas sus sitios web o apps. Usan nuestras  herramientas para empresas , como el píxel de Facebook, para compartir información con nosotros, lo que nos ayuda a proporcionarte una experiencia más personalizada en Facebook. Obtén más información sobre la  actividad fuera de Facebook , cómo la usamos y cómo puedes administrarla. Todos:  Puedes indicar que no quieres ver anuncios online basados en intereses de Facebook y otras empresas participantes en virtud de la  Digital Advertising Alliance  en los EE. UU., la  Digital Advertising Alliance of Canada  en Canadá o la  European Interactive Digital Advertising Alliance  en Europa, o mediante la configuración de tu dispositivo móvil, si está disponible, en Android o iOS 13 (o una versión anterior). Ten en cuenta que los bloqueadores de anuncios y las herramientas que restringen el uso de nuestras cookies pueden interferir con estos controles.  Más información sobre la publicidad online: Las empresas de publicidad con las que trabajamos suelen usar cookies y otras tecnologías similares como parte de sus servicios. Para obtener más información sobre cómo los anunciantes suelen usar cookies y las opciones que ofrecen, consulta los siguientes recursos:  Digital Advertising Alliance Digital Advertising Alliance of Canada European Interactive Digital Advertising Alliance Controles de cookies de navegadores: Además, tu navegador o tu dispositivo pueden ofrecer opciones de configuración que te permiten indicar si quieres que se usen cookies del navegador y eliminarlas. Estos controles varían según el navegador, y los desarrolladores pueden cambiar tanto las opciones de configuración que ofrecen como su funcionamiento en cualquier momento. Desde el 5 de octubre de 2020, puedes encontrar más información sobre los controles que ofrecen los navegadores más populares en los siguientes enlaces. Es posible que algunas partes de los Productos de Facebook no funcionen correctamente si desactivas el uso de cookies del navegador. Ten en cuenta que estos controles son distintos a los controles que te ofrece Facebook.  Google Chrome Internet Explorer Firefox Safari Safari Mobile Opera  Fecha de la última revisión: 5 de octubre de 2020  Español English (US) Français (France) 中文(简体) العربية Português (Brasil) 한국어 Italiano Deutsch हिन्दी 日本語 Registrarte Iniciar sesión Messenger Facebook Lite  Watch  Personas Páginas Categorías de páginas Lugares Juegos Ubicaciones Marketplace Facebook Pay Grupos Empleos Oculus Portal Instagram Local Recaudaciones de fondos Servicios Centro de información de votación Información Crear anuncio Crear página Desarrolladores Empleo Privacidad Cookies Opciones de anuncios Condiciones Ayuda Configuración Registro de actividad  Facebook © 2021 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n"
}