{
    "docno": "RJP757",
    "url": "https://it-it.facebook.com/policies/cookies/",
    "text": "\n Normativa sui cookie \n \n \n \n \n \n \n \n \n \n \n \n \n Vai a Sezioni di questa pagina Assistenza per l'accessibilità Facebook E-mail o telefono Password Non ricordi più come accedere all'account? Iscriviti Altre risorse  Normativa sui cookie stampabile   Normativa sui dati   Condizioni   Impostazioni delle inserzioni di Facebook   Informazioni di base sulla privacy  Cookie e altre tecnologie di memorizzazione  I cookie sono piccoli frammenti di testo usati per memorizzare le informazioni nei browser web. I cookie vengono usati per memorizzare e ricevere identificativi e altre informazioni su computer, cellulari e altri dispositivi. Altre tecnologie, compresi i dati da noi memorizzati nel tuo browser web o dispositivo, gli identificativi associati al tuo dispositivo e altri software, vengono usate per scopi simili. Nella presente normativa, tutte queste tecnologie vengono definite \"cookie\".   Usiamo i cookie se disponi di un account Facebook, utilizzi i  Prodotti Facebook , compresi il nostro sito web e le nostre app, o visiti altri siti web e app che usano i Prodotti Facebook (compreso il pulsante \"Mi piace\" o altre Tecnologie di Facebook). I cookie consentono a Facebook di offrirti i Prodotti Facebook e di comprendere le informazioni che riceviamo su di te, comprese le informazioni sull'uso di altri siti web e app, che tu abbia effettuato o meno l'iscrizione o l'accesso.   La presente normativa illustra in che usiamo i cookie e le scelte a tua disposizione. Salvo quanto diversamente indicato nella presente normativa, la  Normativa sui dati  si applica alla nostra elaborazione dei dati raccolti tramite cookie.  Torna all'inizio  Perché usiamo i cookie?   I cookie ci consentono di fornire, proteggere e migliorare i Prodotti Facebook, ad esempio personalizzando i contenuti, mostrando inserzioni su misura e fornendo un'esperienza più sicura. I cookie che usiamo comprendono i cookie di sessione, che vengono eliminati alla chiusura del tuo browser, e i cookie persistenti, che rimangono nel browser fino alla loro scadenza o eliminazione. Anche se i cookie che usiamo potrebbero subire delle variazioni periodiche in seguito al miglioramento e all'aggiornamento dei Prodotti Facebook, usiamo i cookie per le seguenti finalità:  Autenticazione Usiamo i cookie per verificare il tuo account e stabilire quando hai effettuato l'accesso, in modo da semplificare l'accesso ai Prodotti Facebook e offrirti l'esperienza e le funzioni adatte. Ad esempio:  usiamo i cookie per mantenere il tuo accesso quando passi da una Pagina Facebook all'altra. I cookie ci consentono inoltre di ricordare il tuo browser; in questo modo non dovrai effettuare l'accesso a Facebook ogni volta e potrai accedere più facilmente tramite applicazioni e siti web di terzi. Ad esempio, usiamo i cookie \"c_user\" e \"xs\" a tale scopo, con una durata di 365 giorni.  Sicurezza, integrità del sito e del prodotto  Usiamo i cookie per mantenere il tuo account, i tuoi dati e i Prodotti Facebook sicuri.  Ad esempio:  i cookie ci consentono di identificare e adottare ulteriori misure di sicurezza quando una persona tenta di accedere a un account Facebook senza autorizzazione, ad esempio provando a inserire rapidamente password diverse. Usiamo i cookie anche per memorizzare informazioni che ci consentono di recuperare il tuo account nel caso in cui avessi dimenticato la password o per richiedere maggiori informazioni in merito all'autenticazione se ci comunichi che il tuo account è stato violato. Ciò comprende, ad esempio i nostri cookie \"sb\" e \"dbln\", che ci consentono di identificare il tuo browser in modo sicuro. Usiamo inoltre i cookie per combattere le attività che violano le nostre normative o che pregiudicano in altro modo la nostra capacità di fornire i Prodotti Facebook. Ad esempio:  i cookie ci aiutano a combattere lo spam e gli attacchi di phishing, consentendoci di identificare i computer usati per creare un numero elevato di account Facebook falsi. Usiamo i cookie anche per rilevare i computer in cui sono presenti malware e per adottare misure in grado di prevenire ulteriori danni. Il nostro cookie \"csrf\", ad esempio, ci aiuta a prevenire gli attacchi CSRF. I cookie ci consentono inoltre di impedire che i minorenni creino un account Facebook. Pubblicità, suggerimenti, dati statistici e misurazione  Usiamo i cookie per mostrare le inserzioni e presentare suggerimenti per aziende e altre organizzazioni alle persone che potrebbero essere interessate ai loro prodotti, servizi o alle cause promosse.  Ad esempio:  i cookie ci consentono di mostrare le inserzioni alle persone che in precedenza hanno visitato il sito web di un'azienda, acquistato i suoi prodotti o usato le sue app e di suggerire prodotti e servizi in base a tali attività. I cookie ci permettono inoltre di limitare il numero di visualizzazioni di un'inserzione; in questo modo, non vedrai sempre la stessa inserzione. Ad esempio, il cookie \"fr\" consente la pubblicazione delle inserzioni, nonché la misurazione e il miglioramento della loro pertinenza, con una durata di 90 giorni.   Usiamo i cookie anche per misurare le prestazioni delle campagne pubblicitarie delle aziende che usano i Prodotti Facebook.  Ad esempio:  usiamo i cookie per contare il numero di volte che un'inserzione viene mostrata e calcolare il costo di tali inserzioni. Usiamo anche i cookie per misurare la frequenza con cui le persone compiono le azioni (ad es. effettuare un acquisto dopo l'impression dell'inserzione). Il cookie \"_fbp\" identifica i browser al fine di fornire servizi pubblicitari e statistici del sito e ha una durata di 90 giorni.   I cookie ci consentono di mostrare e misurare le inserzioni nei browser e dispositivi diversi usati dalla stessa persona.  Ad esempio:  possiamo usare i cookie per evitare di mostrarti sempre la stessa inserzione nei diversi dispositivi che usi.  I cookie ci permettono inoltre di fornire dati statistici sulle persone che usano i Prodotti Facebook, sulle persone che interagiscono con le inserzioni, i siti web e le app dei nostri inserzionisti e sulle aziende che usano i Prodotti Facebook.  Ad esempio:  usiamo i cookie per consentire alle aziende di comprendere quali tipi di persone hanno messo \"Mi piace\" alla loro Pagina Facebook o usano le loro applicazioni in modo che possano fornire contenuti più pertinenti e sviluppare funzioni interessanti per i loro clienti.  Usiamo inoltre i cookie, come il nostro cookie \"oo\" che ha una durata di 5 anni, per consentirti di disabilitare la visualizzazione delle inserzioni di Facebook in base alle tue attività su siti web di terzi.  Scopri di più  sulle informazioni che riceviamo, sul modo in cui decidiamo quali inserzioni mostrarti all'interno e all'esterno dei Prodotti Facebook e sulle opzioni di controllo a tua disposizione.  Funzioni e servizi del sito  Usiamo i cookie per abilitare la funzionalità che ci consente di fornire i Prodotti Facebook.  Ad esempio:  i cookie ci permettono di memorizzare le preferenze, di sapere quando hai visto contenuti dei Prodotti Facebook o hai interagito con essi e di fornirti contenuti ed esperienze personalizzati. Per esempio, grazie ai cookie possiamo fornire suggerimenti a te e ad altre persone e personalizzare i contenuti su siti di terzi che integrano i nostri plug-in social. Se sei amministratore di una Pagina, i cookie ti consentono di passare dalla pubblicazione di post con il tuo account Facebook personale alla pubblicazione a nome della Pagina. Usiamo i cookie, come quello \"presence\" basato sulla sessione, per agevolare l'uso delle finestre della chat di Messenger.  Usiamo i cookie anche per fornirti contenuti pertinenti in base alla tua lingua.  Ad esempio:  memorizziamo le informazioni in un cookie posizionato nel tuo browser o dispositivo per consentirti di visualizzare il sito nella lingua che preferisci. Prestazioni Usiamo i cookie per fornirti la migliore esperienza possibile. Ad esempio:  i cookie ci aiutano a indirizzare il traffico tra i server e a verificare la velocità di caricamento dei Prodotti Facebook per persone diverse. I cookie ci permettono inoltre di registrare le proporzioni e le dimensioni dello schermo e delle finestre e di sapere se hai abilitato la modalità a contrasto elevato; in questo modo possiamo mostrare correttamente i nostri siti e le nostre app. Ad esempio, impostiamo i cookie \"dpr\" e \"wd\", ciascuno con una durata di 7 giorni, per offrire un'esperienza ottimale in base allo schermo del tuo dispositivo.  Strumenti di analisi e ricerca Usiamo i cookie per comprendere meglio la modalità di utilizzo dei Prodotti Facebook da parte delle persone al fine di migliorarli. Ad esempio:  i cookie ci consentono di comprendere come le persone usano i servizi Facebook, di analizzare quali parti dei Prodotti Facebook trovano più utili e coinvolgenti e di identificare funzioni che possono essere migliorate. Google Analytics  Impostiamo anche cookie del dominio Facebook.com che funzionano con il servizio Google Analytics per aiutarci a capire in che modo le aziende usano i siti degli sviluppatori di Facebook. Questi cookie hanno nomi come __utma, __utmb, __utmc, __utmz, __qca e _ga.  Siti web e app di terzi  I nostri partner commerciali possono anche scegliere di condividere con Facebook informazioni dai cookie impostati nei domini dei propri siti web, che tu abbia o meno un account Facebook o che tu abbia effettuato o meno l'accesso. Nello specifico, i cookie _fbc o _fbp possono essere impostati nel dominio del partner commerciale di Facebook di cui stai visitando il sito. A differenza dei cookie impostati nei domini di Facebook, questi cookie non sono accessibili da parte di Facebook quando ti trovi su un sito diverso da quello su cui erano stati impostati, compresi i casi in cui ti trovi in uno dei nostri domini. Hanno gli stessi scopi dei cookie impostati nel dominio di Facebook, ovvero la personalizzazione dei contenuti (comprese le inserzioni), la misurazione delle inserzioni, la creazione di dati statistici e l'offerta di un'esperienza più sicura, come indicato nella nostra Normativa sui cookie.  Torna all'inizio Dove usiamo i cookie?  Posizioniamo i cookie sul tuo computer o dispositivo e riceviamo le informazioni memorizzate negli stessi in caso di utilizzo o accesso ai seguenti servizi:  Prodotti Facebook Prodotti forniti da altri membri delle  Aziende di Facebook Prodotti e app forniti da altre aziende che usano i Prodotti Facebook, comprese le aziende che incorporano le Tecnologie di Facebook nei loro siti web e nelle loro app. Facebook usa i cookie e riceve informazioni quando visiti questi siti e queste app, comprese  informazioni sul dispositivo  e informazioni sulle tue attività, senza alcuna ulteriore azione da parte tua. Ciò si verifica che tu abbia o meno un account Facebook o che tu abbia effettuato o meno l'accesso. Torna all'inizio Esistono altre parti che usano i cookie in relazione ai Prodotti Facebook?  Sì, altre parti possono usare i cookie sui Prodotti Facebook per fornire servizi a noi e alle aziende che fanno pubblicità su Facebook.   Ad esempio, i nostri partner dedicati alla misurazione usano i cookie sui Prodotti Facebook per consentire agli inserzionisti di comprendere l'efficacia delle campagne pubblicitarie di Facebook e per confrontare le prestazioni di tali campagne e delle inserzioni mostrate su altri siti web e app.  Scopri di più  sulle aziende che usano i cookie nei Prodotti Facebook.   I cookie vengono usati da terzi anche sui propri siti e sulle proprie app in relazione ai Prodotti Facebook. Per comprendere come vengono usati i cookie da terzi, consulta le loro rispettive normative.  Torna all'inizio Come si può controllare il modo in cui Facebook usa i cookie?  Usiamo i cookie per personalizzare e migliorare contenuti e servizi, per offrire un'esperienza più sicura e per mostrare inserzioni utili e pertinenti all'interno e all'esterno di Facebook. Puoi controllare il modo in cui usiamo i dati per mostrarti le inserzioni e per altre finalità tramite gli strumenti descritti di seguito.  Se hai un account Facebook: Puoi usare le  preferenze relative alle inserzioni  per scoprire il motivo per cui visualizzi una determinata inserzione e controllare come usiamo le informazioni che raccogliamo per mostrarti le inserzioni. Per mostrarti le migliori inserzioni, usiamo i dati che gli inserzionisti e gli altri partner ci forniscono in merito alle tue attività al di fuori dei Prodotti offerti dalle aziende di Facebook, compresi siti web e app. Puoi controllare se usiamo questi dati per mostrarti le inserzioni nelle  impostazioni delle inserzioni . Audience Network di Facebook consente agli inserzionisti di mostrarti inserzioni nelle app e nei siti web all'esterno dei  Prodotti offerti dalle aziende di Facebook . Uno dei modi tramite cui Audience Network ti mostra inserzioni pertinenti è l'uso delle preferenze relative alle inserzioni per determinare quali inserzioni potrebbero interessarti. Puoi controllare questo aspetto nelle  impostazioni delle inserzioni .  Puoi controllare la tua attività fuori da Facebook, che è un riepilogo delle attività che le aziende e le organizzazioni condividono con noi in merito alle tue interazioni con loro, ad esempio quando visiti le loro app o i loro siti web. Utilizzano i nostri  Strumenti per le aziende , come il Pixel di Facebook, per condividere tali informazioni con noi. In questo modo possiamo offrirti un'esperienza su Facebook ancora più personalizzata. Scopri di più  sulla attività fuori da Facebook , su come la utilizziamo e su come puoi gestirla. Tutti:  puoi disattivare la visualizzazione di inserzioni basate sugli interessi online, per Facebook e per le altre aziende partecipanti mediante la  Digital Advertising Alliance  negli Stati Uniti, la  Digital Advertising Alliance of Canada  in Canada o la  European Interactive Digital Advertising Alliance  in Europa oppure accedendo alle impostazioni del tuo dispositivo mobile, se disponibili, che utilizza Android, iOS 13 o una versione precedente di iOS. Tieni presente che le funzioni di blocco delle inserzioni e gli strumenti che limitano il nostro uso dei cookie potrebbero pregiudicare queste opzioni di controllo.  Maggiori informazioni sulla pubblicità online: le aziende pubblicitarie con cui collaboriamo in genere usano cookie e tecnologie simili come parte dei loro servizi. Per maggiori informazioni sul modo in cui gli inserzionisti di solito usano i cookie e sulle scelte che offrono, puoi consultare le risorse seguenti:  Digital Advertising Alliance Digital Advertising Alliance of Canada European Interactive Digital Advertising Alliance Controlli dei cookie del browser: Inoltre, il browser o il dispositivo possono contenere impostazioni che ti permettono di scegliere se impostare i cookie e di eliminarli. Questi controlli variano in base al browser e i produttori possono modificare in qualsiasi momento le impostazioni messe a disposizione e il loro funzionamento. A partire dal 5 ottobre 2020, puoi trovare ulteriori informazioni sui controlli offerti dai browser più diffusi nei link qui sotto. Alcuni elementi dei Prodotti Facebook potrebbero non funzionare correttamente se hai disabilitato l'uso dei cookie. Tieni presente che questi controlli sono diversi rispetto a quelli offerti da Facebook.  Google Chrome Internet Explorer Firefox Safari Safari Mobile Opera  Data dell'ultima revisione: 5 ottobre 2020  Italiano English (US) Español Français (France) 中文(简体) العربية Português (Brasil) 한국어 Deutsch हिन्दी 日本語 Iscriviti Accedi Messenger Facebook Lite  Watch  Persone Pagine Categorie per le Pagine Luoghi Giochi Luoghi Marketplace Facebook Pay Gruppi Offerte di lavoro Oculus Portal Instagram Nei dintorni Raccolte fondi Servizi Centro informazioni sul voto Informazioni Crea un'inserzione Crea una Pagina Sviluppatori Opportunità di lavoro Privacy Cookie Scegli tu! Condizioni Centro assistenza Impostazioni Registro attività  Facebook © 2021 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n"
}