{
    "docno": "RJP769",
    "url": "https://www.facebook.com/UCRBCOE/?fref=tag",
    "text": "\n Bourns College of Engineering at UC Riverside - Home | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home About Posts Photos Videos Events Groups Community Live See more of Bourns College of Engineering at UC Riverside on Facebook Log In or Create New Account See more of Bourns College of Engineering at UC Riverside on Facebook Log In Forgot account? or Create New Account Not Now Bourns College of Engineering at UC Riverside College & University in Riverside, California Always Open Community See All 1,823 people like this 1,917 people follow this 2,728 check-ins About See All 900 University Ave (74.02 mi)  Riverside, CA, CA 92521 Get Directions +95 1 827 5190 www.engr.ucr.edu College & University  ·  School Hours  Always Open Page Transparency See More Facebook is showing information to help you better understand the purpose of a Page. See actions taken by the people who manage and post content. Page created - April 27, 2010 People 1,823  likes 2,728   visits Related Pages Bourns Science and Engineering Day Event UC Riverside International Affairs College & University UC Cross-Campus Enrollment College & University Highlander Racing College & University Theta Tau at UCR: Sigma Delta Chapter Nonprofit Organization UCR CEE GSA Organization SHPE at UCR School Cutie Hack Interest UC Davis Philosophy Department School University Of California, Davis College & University UC Berkeley Department of French College & University UCR School Psychology Program Campus Building Department of Ethnic Studies - University of San Diego School UC Berkeley Department of Italian Studies College & University Rose Hack Event UC Riverside Media and Cultural Studies Department College & University Department of Plant Sciences, UC Davis College & University Citrus Hack Science, Technology & Engineering University of San Diego Department of Psychological Sciences College & University UCR Transportation Services Parking Garage / Lot See More triangle-down Pages Liked by This Page Irvine Valley College UCSB College of Engineering Riverside City College Berkeley Engineering Bioengineering Graduate Student Association The Institution of Engineering and Technology (IET) UC Davis College of Engineering National Science Policy Network - NSPN Mt. SAC UT Arlington College of Engineering Norco College UCLA Engineering STEPCon Stevens Institute of Technology UC Riverside Commencement UCR Computer Science and Engineering - Graduate UC San Diego Jacobs School of Engineering The Henry Samueli School of Engineering at UC Irvine UC Irvine Civil & Environmental Engineering UCR Parents Association See More triangle-down Places Riverside, California Bourns College of Engineering at UC Riverside English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 Posts Bourns College of Engineering at UC Riverside 1 hr  ·  Meet David Wong, one of our Class of 2021 student speakers. David has fought to protect underdogs his whole life, including spearheading a bill to help secure funding for Cal Grant recipients. Switching from outside BCOE, he choose bioengineering to find ways to assist people with tangible technologies in addition to policy changes. David served as the Operations Lead for BioHack, re-evaluating its budget and programming in a way that helped future hackathons succeed in a rem ... ote environment, and rekindled UCR's chess culture by assembling a Chess Club e-sports team that made it to the national playoffs. Before pursuing a master's in bioengineering, David will compete in the Deep Space Food Challenge to design nutritional technologies for future astronauts. In his graduation speech, he explores the meaning of \"living the promise.\"  # BCOEGrad2021   # UCRGrad2021   # UC2021Grad   See More It looks like you may be having problems playing this video. If so, please try restarting your browser. Close BCOE Class of 2021 Student Speaker David Wong Posted by  Bourns College of Engineering at UC Riverside 14 Views Bourns College of Engineering at UC Riverside 2 hrs  ·  Meet Janine Huang, one of our Class of 2021 student speakers. A computer science student from Temple City, at BCOE Janine was actively involved as a student leader: serving as the first female chair of the Association for Computing Machinery (ACM@UCR) and a founding organizer of Rock Hack, UCR's first women-oriented hackathon. Now, Janine is now pursuing a master’s in Computer Science at UCR and is currently employed by NASA Jet Propulsion Laboratory (JPL). In her graduation speech, Janine reflects on the power of confident curiosity, and motivates her peers to surround themselves with a diverse support system.  # BCOEGrad2021   # UCRGrad2021   # UC2021Grad It looks like you may be having problems playing this video. If so, please try restarting your browser. Close BCOE Class of 2021 Student Speaker Janine Huang Posted by  Bourns College of Engineering at UC Riverside 31 Views See All Photos See All Videos More lights! 13 1 A Message From BCOE Students to Faculty 16 How UCR's NSBE Supports Future Engineers 6 1 See All See More \n \n \n"
}