{
    "docno": "RJP755",
    "url": "https://pt-br.facebook.com/policies/cookies/",
    "text": "\n Política de Cookies \n \n \n \n \n \n \n \n \n \n \n \n \n Pular para Seções desta Página Ajuda de Acessibilidade Pressione  alt  +  /  para abrir este menu Facebook Email ou telefone Senha Esqueceu a conta? Cadastre-se Mais recursos  Política de Cookies para Impressão   Política de Dados   Termos   Configurações de anúncios do Facebook   Noções básicas de privacidade  Cookies e outras tecnologias de armazenamento  Cookies são pequenos trechos de texto usados para armazenar informações em navegadores da web. Os cookies são usados para armazenar e receber identificadores e outras informações em computadores, smartphones e outros dispositivos. Outras tecnologias, inclusive os dados que armazenamos em seu navegador ou dispositivo, identificadores associados ao seu dispositivo e outros softwares, são usados com finalidades semelhantes. Nesta política, chamamos todas essas tecnologias de “cookies”.   Se você tem uma conta do Facebook, usa os  Produtos do Facebook , inclusive nossos sites e aplicativos, ou visita outros sites e aplicativos que usam os Produtos do Facebook (inclusive o botão Curtir ou outras tecnologias do Facebook), saiba que usamos cookies. Os cookies permitem que o Facebook lhe ofereça nossos Produtos e entenda as informações que recebemos sobre você, como informações sobre seu uso de outros sites e aplicativos, ou se você está cadastrado(a) ou conectado(a).   Esta política explica como usamos os cookies e as escolhas que você tem. Salvo disposições em contrário indicadas nesta política, a  Política de Dados  será aplicada ao tratamento de dados coletados por meio de cookies.  Voltar ao topo  Por que usamos cookies?   Os cookies nos ajudam a fornecer, proteger e aprimorar os Produtos do Facebook, seja personalizando conteúdo, mensurando e aprimorando anúncios ou viabilizando uma experiência mais segura. Os cookies que usamos incluem cookies de sessões, que são excluídos quando você fecha o navegador, e cookies recorrentes, que ficam no navegador até eles expirarem ou serem excluídos por você. Embora os cookies usados possam variar à medida que melhoramos e atualizamos os Produtos do Facebook, eles são usados com as seguintes finalidades:  Autenticação Usamos cookies para verificar sua conta e determinar quando você está conectado(a), para podermos facilitar seu acesso aos Produtos do Facebook e mostrar a você a experiência e os recursos apropriados. Por exemplo:  usamos cookies para manter você conectado(a) enquanto navega por Páginas do Facebook. Cookies também nos ajudam a lembrar do seu navegador, para que você não precise ficar entrando no Facebook toda hora e para que entre no Facebook mais facilmente quando usar aplicativos e sites de terceiros. Por exemplo, usamos os cookies “c_user” e “xs” para essa finalidade. Eles têm uma vida útil de 365 dias.  Integridade de produtos, site e segurança  Usamos cookies para nos ajudar a manter sua conta, seus dados e os Produtos do Facebook seguros e protegidos.  Por exemplo:  cookies podem nos ajudar a identificar e a impor medidas adicionais de segurança quando alguém tenta acessar uma conta do Facebook sem autorização, por exemplo, tentando adivinhar senhas diferentes rapidamente. Também usamos cookies para armazenar informações que nos permitem recuperar sua conta caso você se esqueça da senha ou para exigir autenticação adicional se você nos informar de que sua conta foi invadida. Isso inclui, por exemplo, os cookies “sb” e “dbln”, que nos permitem identificar seu navegador com segurança. Também os usamos para combater atividades que violam nossas políticas ou que prejudicam nossa capacidade de fornecer os Produtos do Facebook. Por exemplo:  os cookies nos ajudam a combater spam e ataques de phishing ao nos permitir identificar computadores que são usados para criar uma grande quantidade de contas do Facebook falsas. Também usamos cookies para detectar computadores infectados com malware e tomar medidas para evitar que eles possam causar mais prejuízos. O cookie “csrf”, por exemplo, nos ajuda a evitar ataques de falsificação de solicitação entre sites. Os cookies também nos ajudam a evitar que menores de idade se registrem em contas do Facebook. Publicidade, recomendações, informações e mensuração  Usamos cookies para nos ajudar a mostrar anúncios e fazer recomendações de empresas e outras organizações a usuários que possam estar interessados nos produtos, serviços ou causas patrocinadas por elas.  Por exemplo:  os cookies nos permitem mostrar anúncios a pessoas que já visitaram o site de uma empresa, compraram seus produtos ou usaram seus aplicativos, além de nos permitir recomendar produtos e serviços com base nessa atividade. Eles também nos permitem limitar a quantidade de vezes que você vê um anúncio, para não ter que vê-lo repetidamente. Por exemplo, o cookie “fr” é usado para veicular, mensurar e melhorar a relevância dos anúncios. Ele tem uma vida útil de 90 dias.   Também usamos cookies para nos ajudar a mensurar o desempenho de campanhas de anúncios de empresas que usam os Produtos do Facebook.  Por exemplo:  usamos cookies para contar a quantidade de vezes que um anúncio é exibido e calcular o custo desses anúncios. Também usamos cookies para medir a frequência com que as pessoas realizam ações, por exemplo, fazer uma compra após uma impressão de anúncio. O cookie “_fbp” identifica navegadores com a finalidade de fornecer serviços de análise de site e de publicidade. Ele tem uma vida útil de 90 dias. .  Os cookies nos ajudam a exibir e medir anúncios em diferentes navegadores e dispositivos usados por uma mesma pessoa.  Por exemplo:  podemos usar cookies para evitar que você veja o mesmo anúncio repetidamente em todos os dispositivos que você usa.  Os cookies também nos permitem ter informações sobre as pessoas que usam os Produtos do Facebook e sobre as pessoas que interagem com anúncios, sites e aplicativos de nossos anunciantes e de empresas que usam os Produtos do Facebook.  Por exemplo:  usamos cookies para ajudar empresas a entender o tipo de pessoa que curte sua Página do Facebook ou usa seus aplicativos para que elas possam oferecer conteúdo mais relevante e desenvolver recursos que provavelmente serão do interesse dos clientes.  Também usamos cookies, como “oo”, que tem uma vida útil de cinco anos, para ajudar você a recusar a exibição de anúncios do Facebook com base em sua atividade em sites de terceiros.  Saiba mais  sobre as informações que recebemos, como decidimos quais anúncios são exibidos dentro e fora dos Produtos do Facebook e os controles disponíveis para você.  Recursos e serviços do site  Usamos cookies para ativar os recursos que nos ajudam a oferecer os Produtos do Facebook.  Por exemplo:  os cookies nos ajudam a armazenar preferências, a saber quando você visualizou ou interagiu com conteúdo dos Produtos do Facebook e a fornecer conteúdo e experiências personalizadas. Por exemplo, os cookies nos permitem fazer sugestões a você e a outras pessoas, e personalizar conteúdo em sites de terceiros que integram nossos plugins sociais. Se você é um administrador de Página, os cookies permitem alternar entre publicar em sua conta pessoal do Facebook e na Página. Usamos cookies como “presence”, com base em sessões, para dar suporte ao uso que você faz das janelas de bate-papo do Messenger.  Também usamos cookies para nos ajudar a fornecer conteúdo relevante para seu idioma.  Por exemplo:  armazenamos informações em um cookie colocado em seu navegador ou dispositivo para que você veja o site em seu idioma preferido. Desempenho Usamos cookies para lhe proporcionar a melhor experiência possível. Por exemplo:  os cookies nos ajudam a rotear o tráfego entre servidores e saber a velocidade do carregamento dos Produtos do Facebook para diferentes pessoas. Os cookies também nos ajudam a registrar as dimensões da sua tela e janelas e a saber se você ativou o modo de alto contraste, para que possamos processar nossos sites e aplicativos adequadamente. Por exemplo, configuramos os cookies “dpr” e “wd”, cada um com uma vida útil de sete dias, para proporcionar uma experiência ideal de acordo com a tela do dispositivo.  Análises e pesquisas Usamos cookies para entender melhor como as pessoas usam os Produtos do Facebook e poder aprimorá-los. Por exemplo:  os cookies podem nos ajudar a entender como as pessoas usam o serviço do Facebook, a analisar quais partes dos Produtos do Facebook são consideradas mais úteis e envolventes pelos usuários e a identificar recursos que podem ser aprimorados. Google Analytics  Nós também definimos cookies do domínio Facebook.com que funcionam com o serviço Google Analytics para nos ajudar a entender como seu negócio usa os sites de desenvolvedor do Facebook. Esses cookies usam nomes como __utma, __utmb, __utmc, __utmz, __qca e _ga.  Sites e aplicativos de terceiros  Nossos parceiros de negócios também podem escolher compartilhar informações com o Facebook usando cookies definidos nos respectivos domínios de sites. Isso acontece quer você tenha ou não uma conta do Facebook, estando ou não conectado(a) a ela. Especificamente, cookies nomeados _fbc ou _fbp podem ser definidos no domínio do parceiro de negócios do Facebook cujo site você está visitando. Diferentemente dos cookies definidos nos domínios do Facebook, esses cookies não podem ser acessados pelo Facebook quando você está em um site diferente daquele em que eles foram definidos, inclusive quando você está em um de nossos domínios. Eles têm as mesmas finalidades dos cookies definidos no domínio do Facebook, que são personalizar conteúdo (inclusive anúncios), mensurar anúncios, gerar análises e proporcionar uma experiência mais segura, conforme estabelecido nesta Política de Cookies.  Voltar ao topo Onde usamos cookies?  Podemos colocar cookies em seu computador ou dispositivo e receber informações armazenadas nos cookies quando você usa ou visita:  Os  Produtos do Facebook ; Os produtos fornecidos por outros membros das  Empresas do Facebook ; e Os sites e aplicativos fornecidos por outras empresas que usam os Produtos do Facebook, como empresas que incorporam tecnologias do Facebook em seus sites e aplicativos. O Facebook usa cookies e recebe informações quando você visita esses sites e aplicativos, inclusive  informações do dispositivo  e informações sobre sua atividade, sem nenhuma outra ação sua. Isso acontece quer você tenha ou não uma conta do Facebook, estando ou não conectado(a) a ela. Voltar ao topo Outras partes usam cookies com os Produtos do Facebook?  Sim, outras partes podem usar cookies nos Produtos do Facebook para fornecer serviços para nós e outras empresas que anunciam no Facebook.   Por exemplo, nossos parceiros de mensuração usam cookies nos Produtos do Facebook para ajudar os anunciantes a entender a eficácia de suas campanhas de anúncios no Facebook e para comparar o desempenho dessas campanhas a anúncios exibidos em outros sites e aplicativos.  Saiba mais  sobre as empresas que usam cookies nos Produtos do Facebook.   Terceiros também usam cookies em seus próprios sites e aplicativos associados aos Produtos do Facebook. Para entender como outras partes usam cookies, analise as respectivas políticas.  Voltar ao topo Como você pode controlar o uso de cookies do Facebook?  Usamos cookies para ajudar a personalizar e melhorar o conteúdo e os serviços, proporcionar uma experiência mais segura e mostrar a você anúncios úteis e relevantes dentro e fora do Facebook. Você pode controlar como usamos os dados para mostrar anúncios e muito mais usando as ferramentas descritas abaixo.  Se você tiver uma conta do Facebook: Você pode usar suas  preferências de anúncios  para saber por que está vendo determinado anúncio e controlar como usamos as informações que coletamos para exibir anúncios. Para podermos mostrar a você anúncios mais relevantes, usamos dados que os anunciantes e outros parceiros nos fornecem sobre sua atividade fora dos Produtos das Empresas do Facebook, como sites e aplicativos. Para controlar nosso uso desses dados para mostrar anúncios a você, acesse as  configurações de anúncios . O Audience Network do Facebook é uma maneira de os anunciantes mostrarem a você anúncios em aplicativos e sites fora dos  Produtos das Empresas do Facebook . Uma das maneiras usadas pela Audience Network do Facebook para mostrar anúncios relevantes é usar as suas preferências de anúncios a fim de determinar os anúncios que podem ser interessantes. Você pode controlar isso nas suas  configurações de anúncios.  Você pode analisar sua atividade fora do Facebook, que são um resumo das atividades que empresas e organizações compartilham conosco sobre suas interações com elas, como visitas aos aplicativos ou sites delas. Elas usam nossas  Ferramentas para Empresas , como o pixel do Facebook, para compartilhar essas informações conosco. Isso nos ajuda a fazer ações como proporcionar a você uma experiência mais personalizada no Facebook. Saiba mais sobre a  atividade fora do Facebook  e sobre como usá-la e gerenciá-la. Todos:  você pode recusar a exibição de anúncios do Facebook e de todas as empresas participantes pela  Digital Advertising Alliance  nos EUA, pela  Digital Advertising Alliance of Canada  no Canadá ou pela  European Interactive Digital Advertising Alliance  na Europa ou usando as configurações do dispositivo móvel, quando disponíveis, no Android, no iOS 13 ou em uma versão anterior do iOS. Observe que bloqueadores de anúncios e ferramentas que restringem o uso de cookies podem interferir nesses controles.  Mais informações sobre publicidade online: As empresas de publicidade com que nós trabalhamos geralmente usam cookies e tecnologias semelhantes como parte de seus serviços. Para saber mais sobre como anunciantes de modo geral usam cookies e as escolhas que eles oferecem, consulte os recursos a seguir:  Digital Advertising Alliance Digital Advertising Alliance of Canada European Interactive Digital Advertising Alliance Controles de cookies do navegador: Além disso, seu navegador ou dispositivo pode ter configurações que permitam a você escolher se quer definir cookies ou não e excluí-los. Estes controles variam de acordo com o navegador, e os fabricantes podem, a qualquer momento, alterar as configurações e a forma como funcionam. A partir de 5 de outubro de 2020, você poderá encontrar nos links abaixo informações adicionais sobre os controles que navegadores populares oferecem. Determinadas partes dos Produtos do Facebook poderão não funcionar corretamente se o uso de cookies do navegador tiver sido desativado. Esteja ciente de que esses controles são diferentes daqueles oferecidos pelo Facebook.  Google Chrome Internet Explorer Firefox Safari Safari para celular Opera  Data da última revisão: 5 de outubro de 2020  Português (Brasil) English (US) Español Français (France) 中文(简体) العربية 한국어 Italiano Deutsch हिन्दी 日本語 Cadastre-se Entrar Messenger Facebook Lite  Watch  Pessoas Páginas Categorias de Página Locais Jogos Locais Marketplace Facebook Pay Grupos Vagas de emprego Oculus Portal Instagram Local Campanhas de arrecadação de fundos Serviços Central de Informações de Votação Sobre Criar anúncio Criar Página Desenvolvedores Carreiras Privacidade Cookies Escolhas para anúncios Termos Ajuda Configurações Registro de Atividades  Facebook © 2021 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n"
}