{
    "docno": "RJP73",
    "url": "https://www.facebook.com/ISCFresnoState/?ref=py_c",
    "text": "\n Indian Student Club - Fresno State - Home | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home About Events Photos Videos Community Reviews Posts See more of Indian Student Club - Fresno State on Facebook Log In or Create New Account See more of Indian Student Club - Fresno State on Facebook Log In Forgot account? or Create New Account Not Now Community See All 450 people like this 482 people follow this About See All 5241 N Maple Avenue, Fresno, CA  ,  93740 (650) 995-2572 www.fresnostateisc.com Community Organization Page Transparency See More Facebook is showing information to help you better understand the purpose of a Page. See actions taken by the people who manage and post content. Page created - March 12, 2017 People 450  likes Related Pages Indian Students Association, Purdue Fort Wayne Community Organization Indian Student Association Organization Indian Student Association at WKU Nonprofit Organization Soil & Crop Sciences Graduate Organization College & University Indian Student Association UT Tyler Community Organization Fresno State CSCI Club Education Indian Student Association- Eastern Michigan University Community Organization Fresno State - International Ambassadors College & University Indian Students Association - ISA Marshall University Nonprofit Organization International Culture Night - Fresno State Campus Building CSU Fresno International Business Association Education UHCL Cricket Student Association Community Organization Fresno County Gujarati Samaj Organization ASU Cricket Club School Sports Team Iha Bharadwaj Author Mumbai Masti Pizza Pizza Place Indian Student Association - Utah State University Organization Indian Student Organization Public & Government Service Amber India Los Altos Indian Restaurant Indian Student Association UMass Amherst Community Organization See More triangle-down Pages Community Organization Indian Student Club - Fresno State English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 Photos See All Videos We want to hear from YOU and speak to you at our first general meeting (information session). April 5th, Friday, 4PM at Family & Food Sciences building, Room 213. 15 9 Wishing Happy Independence Day to all of you. Let this day be incredible. We have a right to be what we want. Let's make our country proud in whatever way, we can ❤️❤️🇮🇳🇮🇳 Wishing everyone a Happy Independence Day again 🇮🇳🇮🇳 \n\n#indianbyheart\n#fresnostateisc                               \n#indianstudentclub\n#india\n#ilovemyIndia 🇮🇳🇮🇳❤️❤️ 21 Bulldogs, it’s just one day left for the kick start. Get ready for unlimited fun, games, music and food.🎷🎼\n#isc\n#kick_start_party_isc\n#iscfresnostate 7 See All See More \n \n \n"
}