{
    "docno": "RJP758",
    "url": "https://de-de.facebook.com/policies/cookies/",
    "text": "\n Cookie-Richtlinie \n \n \n \n \n \n \n \n \n \n \n \n \n Gehe zu: Bereiche dieser Seite Bedienhilfen Facebook E-Mail-Adresse oder Handynummer Passwort Passwort vergessen? Registrieren Weitere Ressourcen  Druckbare Version der Cookie-Richtlinie   Datenrichtlinie   Nutzungsbedingungen   Einstellungen für Facebook-Werbeanzeigen   Privatsphäre-Grundlagen  Cookies und andere Speichertechnologien  Cookies sind kleine Textstücke, die zum Speichern von Informationen in Webbrowsern verwendet werden. Cookies werden verwendet, um Kennungen und sonstige Informationen auf Computern, Telefonen und anderen Geräten zu speichern bzw. zu erhalten. Sonstige Technologien, einschließlich der von uns in deinem Webbrowser oder Gerät gespeicherten Daten, der mit deinem Gerät verknüpften Kennungen sowie sonstiger Software, werden für ähnliche Zwecke genutzt. In dieser Richtlinie bezeichnen wir alle diese Technologien als „Cookies“.   Wir verwenden Cookies, wenn du ein Facebook-Konto hast, die  Facebook-Produkte , einschließlich unserer Website und Apps, nutzt oder andere Websites und Apps besuchst, die die Facebook-Produkte nutzen (einschließlich des „Gefällt mir“-Buttons oder anderer Facebook-Technologien). Cookies ermöglichen es Facebook, dir die Facebook-Produkte anzubieten und die Informationen zu verstehen, die wir über dich erhalten, einschließlich Informationen über deine Nutzung anderer Websites und Apps, und zwar unabhängig davon, ob du registriert bzw. angemeldet bist oder nicht.   Diese Richtlinie erläutert, wie wir Cookies verwenden, und welche Auswahlmöglichkeiten dir zur Verfügung stehen. Sofern in dieser Richtlinie nichts anderes angegeben wird, gilt die  Datenrichtlinie  für unsere Verarbeitung der von uns über Cookies erhobenen Daten.  Zurück zum Seitenanfang  Warum verwenden wir Cookies?   Cookies helfen uns dabei, die Facebook-Produkte bereitzustellen, sie zu schützen und zu verbessern. Beispielsweise indem wir Inhalte personalisieren, Werbeanzeigen individuell gestalten und sie messen bzw. ein sichereres Nutzererlebnis bereitstellen. Zu den von uns verwendeten Cookies gehören Sitzungs-Cookies, die gelöscht werden, wenn du deinen Browser schließt, und dauerhafte Cookies, die auf deinem Browser verbleiben, bis sie ablaufen oder du sie löschst. Auch wenn sich die von uns verwendeten Cookies während unserer Optimierung und Aktualisierung der Facebook-Produkte von Zeit zu Zeit ändern können, verwenden wir sie für folgende Zwecke:  Authentifizierung Wir verwenden Cookies, um dein Konto zu verifizieren und um festzustellen, wann du angemeldet bist, damit wir dir den Zugriff auf die Facebook-Produkte erleichtern und dir das passende Nutzererlebnis sowie geeignete Funktionen bereitstellen können. Beispiel:  Wir verwenden Cookies, damit du angemeldet bleiben kannst, während du zwischen verschiedenen Facebook-Seiten hin und her wechselst. Cookies helfen uns auch dabei, deinen Browser wiederzuerkennen, damit du dich nicht immer wieder neu bei Facebook anmelden musst und dich über Apps und Websites Dritter einfacher bei Facebook anmelden kannst. Beispielsweise verwenden wir hierfür die „c_user“- und „xs“-Cookies mit einer Speicherzeit von 365 Tagen.  Sicherheit, Website- und Produktintegrität  Die Verwendung von Cookies hilft uns dabei, die Sicherheit deines Kontos, deiner Daten sowie der Facebook-Produkte zu gewährleisten.  Beispiel:  Mithilfe von Cookies können wir zusätzliche Sicherheitsmaßnahmen ermitteln und einsetzen, wenn jemand versucht, ohne Autorisierung auf ein Facebook-Konto zuzugreifen, wie z. B. durch schnelles Erraten verschiedener Passwörter. Wir verwenden Cookies auch zum Speichern von Informationen, mit deren Hilfe wir dein Konto wiederherstellen können, falls du dein Passwort vergisst, oder um eine zusätzliche Authentifizierung zu fordern, wenn du uns mitteilst, dass dein Konto gehackt wurde. Hierzu gehören beispielsweise unsere „sb“- und „dbln“-Cookies, durch die wir deinen Browser sicher identifizieren können. Außerdem verwenden wir Cookies zur Bekämpfung von Aktivitäten, die gegen unsere Richtlinien verstoßen bzw. auf sonstige Art und Weise unsere Fähigkeit schwächen, die Facebook-Produkte bereitzustellen. Beispiel:  Cookies helfen uns, Spam und Phishing-Angriffe zu bekämpfen, indem sie es uns ermöglichen, Computer zu identifizieren, die eingesetzt werden, um eine große Mengen an gefälschten Facebook-Konten zu erstellen. Mithilfe von Cookies können wir außerdem Computer ermitteln, die von Schadprogrammen befallen sind, und Maßnahmen ergreifen, damit diese keinen weiteren Schaden anrichten können. Unser „csrf“-Cookie hilft uns beispielsweise, Cross-Site-Request-Forgery-Angriffe zu verhindern. Darüber hinaus unterstützen Cookies uns dabei zu verhindern, dass Minderjährige sich für Facebook-Konten registrieren. Werbung, Empfehlungen, Insights und Messungen  Wir verwenden Cookies als Unterstützung, um denjenigen Personen, die sich möglicherweise für die von Unternehmen und sonstigen Organisationen beworbenen Produkte, Dienstleistungen oder Zwecke interessieren, Werbeanzeigen zu diesen Unternehmen und Organisationen zu zeigen und Empfehlungen für sie auszusprechen.  Beispiel:  Mithilfe von Cookies können wir denjenigen Personen, die bereits zuvor die Website eines Unternehmens besucht, seine Produkte gekauft oder seine Apps verwendet haben, Werbeanzeigen zeigen und ihnen auf dieser Aktivität basierende Produkte und Dienstleistungen empfehlen. Cookies ermöglichen uns außerdem die Begrenzung der Häufigkeit, mit der dir eine Werbeanzeige angezeigt wird, damit du dieselbe Werbeanzeige nicht immer wieder siehst. Der „fr“-Cookie wird beispielsweise verwendet, um Werbeanzeigen auszuliefern und ihre Relevanz zu messen und zu verbessern. Er hat eine Speicherzeit von 90 Tagen.   Wir verwenden Cookies auch, um Unternehmen, die die Facebook-Produkte nutzen, dabei zu unterstützen, den Erfolg ihrer Werbekampagnen zu messen.  Beispiel:  Wir verwenden Cookies, um zu ermitteln, wie oft eine Werbeanzeige angezeigt wird, und um die Kosten dieser Werbeanzeigen zu berechnen. Außerdem verwenden wir Cookies, um zu messen, wie oft Menschen nach einer Anzeigen-Impression Handlungen durchführen, wie z. B. einen Kauf tätigen. Der „_fbp“-Cookie identifiziert Browser, um Analysedienste für Werbung und Websites bereitzustellen. Er hat eine Speicherzeit von 90 Tagen. .  Cookies helfen uns, Werbeanzeigen auf verschiedenen Browsern und Geräten, die von derselben Person genutzt werden, auszuliefern und zu messen.  Beispiel:  Wir können Cookies verwenden, um zu verhindern, dass du auf den verschiedenen von dir genutzten Geräten immer wieder dieselbe Werbeanzeige siehst.  Cookies ermöglichen uns auch die Bereitstellung von Insights zu den Personen, die die Facebook-Produkte nutzen, sowie zu denjenigen, die mit den Werbeanzeigen, Websites und Apps unserer Werbekunden und der Unternehmen, die die Facebook-Produkte nutzen, interagieren.  Beispiel:  Wir verwenden Cookies, um Unternehmen dabei zu unterstützen, etwas darüber zu erfahren, welchen Personen ihre Facebook-Seite gefällt bzw. welche Personen ihre Apps verwenden, so dass sie relevantere Inhalte bereitstellen und Funktionen entwickeln können, die wahrscheinlich von Interesse für ihre Kunden sind.  Weiterhin verwenden wir Cookies wie unser „oo“-Cookie mit einer Speicherzeit von fünf Jahren, um dir zu helfen, dich davon abzumelden, dass du Werbeanzeigen von Facebook siehst, die auf deinen Aktivitäten auf den Websites Dritter basieren.  Erfahre mehr  über die Informationen, die wir erhalten, und darüber, wie wir entscheiden, welche Werbeanzeigen wir dir auf den Facebook-Produkten und außerhalb dieser anzeigen, sowie über die dir zur Verfügung stehenden Kontrollmöglichkeiten.  Website-Funktionen und -dienste  Mithilfe von Cookies wird die Funktionalität ermöglicht, die uns bei der Bereitstellung der Facebook-Produkte unterstützt.  Beispiel:  Cookies helfen uns, Einstellungen bzw. Präferenzen zu speichern, zu erfahren, wann du Inhalte der Facebook-Produkte angesehen bzw. mit ihnen interagiert hast, und dir personalisierte Inhalte und Erlebnisse bereitzustellen. Beispielsweise können wir mithilfe von Cookies dir und anderen Vorschläge unterbreiten und Inhalte auf Websites Dritter personalisieren, die unsere sozialen Plug-ins einbinden. Wenn du ein Seitenadministrator bist, kannst du mithilfe von Cookies zwischen dem Posten von deinem persönlichen Facebook-Konto und der Seite hin und her wechseln. Wir verwenden Cookies wie den sitzungsbasierten „Präsenz“-Cookie, um deine Nutzung von Messenger-Chat-Fenstern zu unterstützen.  Wir verwenden Cookies auch, um dir Inhalte bereitzustellen, die für deine Ländereinstellung relevant sind.  Beispiel:  Wir speichern Informationen in einem Cookie, der in deinem Browser oder auf deinem Gerät platziert wird, so dass du die Website in deiner bevorzugten Sprache siehst. Performance Wir verwenden Cookies, um dir das bestmögliche Nutzererlebnis bereitzustellen. Beispiel:  Mithilfe von Cookies können wir den Traffic zwischen Servern leiten und in Erfahrung bringen, wie schnell sich Facebook-Produkte für verschiedene Personen laden lassen. Cookies helfen uns auch bei der Protokollierung der Seitenverhältnisse und Abmessungen deines Bildschirms und deiner Fenster sowie bei der Ermittlung, ob du den Hochkontrastmodus aktiviert hast, so dass wir unsere Websites und Apps korrekt darstellen können. So setzen wir z. B. die „dpr“- und „wd“-Cookies, die jeweils eine Speicherzeit von 7 Tagen haben, um ein optimales Erlebnis für den Bildschirm deines Geräts bereitzustellen.  Analysen und Forschung Wir verwenden Cookies, um besser zu verstehen, wie Menschen die Facebook-Produkte nutzen, so dass wir diese verbessern können. Beispiel:  Cookies können uns helfen zu verstehen, wie Menschen den Facebook-Dienst nutzen, zu analysieren, welche Teile der Facebook-Produkte für sie am nützlichsten und ansprechendsten sind, und Funktionen zu ermitteln, die verbessert werden könnten. Google Analytics  Wir setzen außerdem Cookies von der Facebook.com-Domain, die uns gemeinsam mit dem Google Analytics-Dienst dabei helfen, mehr darüber zu erfahren, wie Unternehmen die Entwickler-Websites von Facebook nutzen. Diese Cookies haben Namen wie __utma, __utmb, __utmc, __utmz, __qca und _ga.  Websites und Apps Dritter  Unsere Geschäftspartner können sich auch dafür entscheiden, Informationen mit Facebook zu teilen, die aus in ihren eigenen Website-Domains gesetzten Cookies stammen. Dies ist unabhängig davon, ob du ein Facebook-Konto hast oder nicht. Insbesondere _fbc oder _fbp genannte Cookies können in der Domain des Facebook-Geschäftspartners gesetzt werden, dessen Website du besuchst. Anders als bei Cookies, die in den eigenen Domains von Facebook gesetzt werden, kann Facebook nicht auf diese Cookies zugreifen, wenn du dich auf einer anderen Website befindest als derjenigen, auf der sie gesetzt wurden. Dies gilt auch, wenn du dich in einer unserer Domains befindest. Sie dienen denselben Zwecken wie Cookies, die in der eigenen Domain von Facebook gesetzt werden, nämlich der Personalisierung von Inhalten (einschließlich Werbeanzeigen), der Messung von Werbeanzeigen, der Erstellung von Analysen und der Bereitstellung eines sichereren Erlebnisses. Dies wird in unserer Cookie-Richtlinie dargelegt.  Zurück zum Seitenanfang Wo verwenden wir Cookies?  Wir können Cookies auf deinem Computer oder Gerät platzieren und so Informationen erhalten, die in den Cookies gespeichert werden, wenn du Folgendes nutzt bzw. besuchst:  Die  Facebook-Produkte ; Produkte, die von anderen Mitgliedern der  Facebook-Unternehmen  bereitgestellt werden; und Websites und Apps, die von anderen Unternehmen bereitgestellt werden, die die Facebook-Produkte nutzen, einschließlich Unternehmen, die die Facebook-Technologien in ihre Websites und Apps einbinden. Facebook verwendet Cookies und erhält ohne irgendeine weitere Handlung deinerseits Informationen, wenn du solche Websites und Apps besuchst, einschließlich  Geräteinformationen  und Informationen über deine Aktivität. Dies geschieht unabhängig davon, ob du ein Facebook-Konto hast oder angemeldet bist. Zurück zum Seitenanfang Verwenden andere Parteien Cookies in Verbindung mit den Facebook-Produkten?  Ja, andere Parteien können auf den Facebook-Produkten Cookies verwenden, um uns bzw. den auf Facebook werbenden Unternehmen Dienstleistungen bereitzustellen.   Beispielsweise verwenden unsere Partner für Messungen Cookies auf den Facebook-Produkten, um Werbetreibenden zu helfen, etwas über die Effektivität ihrer Facebook-Werbekampagnen zu erfahren und den Erfolg dieser Kampagnen mit den Werbeanzeigen zu vergleichen, die auf anderen Websites und in anderen Apps angezeigt werden.  Erfahre mehr  über die Unternehmen, die Cookies auf den Facebook-Produkten verwenden.   Drittanbieter verwenden Cookies im Zusammenhang mit den Facebook-Produkten auch auf ihren eigenen Websites bzw. in ihren Apps. Um zu erfahren, wie andere Parteien Cookies verwenden, lies dir bitte deren Richtlinien durch.  Zurück zum Seitenanfang Wie kannst du die Verwendung von Cookies durch Facebook kontrollieren?  Wir verwenden Cookies, um Inhalte und Dienste zu personalisieren und zu verbessern, ein sichereres Erlebnis bereitzustellen und dir auf und außerhalb von Facebook relevante Werbeanzeigen zu zeigen. Du kannst kontrollieren, wie wir Daten verwenden, um dir Werbeanzeigen und anderes zu zeigen, indem du die weiter unten erläuterten Tools nutzt.  Wenn du ein Facebook-Konto hast: Mithilfe deiner  Werbepräferenzen  kannst du erfahren, warum du eine bestimmte Werbeanzeige siehst, und kontrollieren, wie wir erhobene Informationen verwenden, um dir Werbeanzeigen zu zeigen. Um dir bessere Werbeanzeigen zu zeigen, verwenden wir Daten, die uns Werbetreibende und andere Partner über deine Aktivität außerhalb der Produkte der Facebook-Unternehmen bereitstellen, einschließlich Websites und Apps. Du kannst in deinen  Einstellungen für Werbeanzeigen  kontrollieren, ob wir diese Daten verwenden, um dir Werbeanzeigen zu zeigen. Das Facebook Audience Network stellt eine Möglichkeit für Werbetreibende dar, dir Werbeanzeigen in Apps und auf Websites außerhalb der  Produkte der Facebook-Unternehmen  zu zeigen. Eine der Möglichkeiten, wie das Audience Network dir relevante Werbeanzeigen zeigt, ist die Nutzung deiner Werbepräferenzen, um zu ermitteln, an welchen Werbeanzeigen du möglicherweise interessiert bist. Du kannst dies in deinen  Einstellungen für Werbeanzeigen  festlegen.  Du kannst deine Aktivitäten außerhalb von Facebook überprüfen. Dies ist die Zusammenfassung der Aktivitäten, die Unternehmen und Organisationen mit uns hinsichtlich deiner Interaktionen mit ihnen teilen, wie z. B. Besuche ihrer Apps oder Websites. Sie nutzen unsere  Business-Tools  wie das Facebook-Pixel, um diese Informationen mit uns zu teilen. Dadurch können wir dir beispielsweise ein individuelleres Erlebnis auf Facebook bereitstellen. Erfahre mehr  zu Aktivitäten außerhalb von Facebook , wie wir sie verwenden und wie du sie verwalten kannst. Alle:  Mithilfe von Android, iOS 13 oder einer früheren Version von iOS kannst du dich gegebenenfalls über die  Digital Advertising Alliance  in den USA, die  Digital Advertising Alliance of Canada  in Kanada bzw. die  European Interactive Digital Advertising Alliance  in Europa bzw. über die Einstellungen deines Mobilgeräts davon abmelden, interessenbasierte Online-Werbeanzeigen von Facebook und anderen teilnehmenden Unternehmen zu sehen. Beachte bitte, dass Werbeblocker und Tools, die unsere Verwendung von Cookies einschränken, möglicherweise diese Kontrolloptionen beeinträchtigen.  Weitere Informationen zu Online-Werbung: Die Werbeunternehmen, mit denen wir zusammenarbeiten, verwenden im Rahmen ihrer Dienstleistungen in der Regel Cookies und ähnliche Technologien. Mehr dazu, wie Werbetreibende in der Regel Cookies verwenden und welche Auswahlmöglichkeiten sie anbieten, erfährst du in folgenden Ressourcen:  Digital Advertising Alliance Digital Advertising Alliance of Canada European Interactive Digital Advertising Alliance Kontrolloptionen für Browser-Cookies: Darüber hinaus bietet dein Browser oder Gerät möglicherweise Einstellungen an, die es dir ermöglichen auszuwählen, ob Browser-Cookies platziert werden, bzw. diese zu löschen. Diese Kontrolloptionen sind je nach Browser unterschiedlich. Außerdem können Hersteller sowohl die von ihnen zur Verfügung gestellten Einstellungen als auch deren Funktionsweise jederzeit ändern. Ab dem 5. Oktober 2020 findest du unter den nachstehenden Links möglicherweise zusätzliche Informationen zu den Kontrolloptionen, die beliebte Browser anbieten. Bestimmte Teile der Facebook-Produkte funktionieren möglicherweise nicht richtig, wenn du die Verwendung von Browser-Cookies deaktiviert hast. Hinweis: Diese Kontrolloptionen unterscheiden sich von den Kontrolloptionen, die Facebook dir anbietet.  Google Chrome Internet Explorer Firefox Safari Safari Mobile Opera  Datum der letzten Überarbeitung: 5. Oktober 2020  Deutsch English (US) Español Français (France) 中文(简体) العربية Português (Brasil) 한국어 Italiano हिन्दी 日本語 Registrieren Anmelden Messenger Facebook Lite  Watch  Personen Seiten Seitenkategorien Orte Spiele Standorte Marketplace Facebook Pay Gruppen Jobs Oculus Portal Instagram Lokales Spendenaktionen Services Wahl-Informationszentrum Info Werbeanzeige erstellen Seite erstellen Entwickler Karriere Privatsphäre Cookies Datenschutzinfo Nutzungsbedingungen Hilfe Einstellungen Aktivitätenprotokoll  Facebook © 2021 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n"
}