{
    "docno": "RJP72",
    "url": "https://www.facebook.com/Iranian.Students.CA/?ref=py_c",
    "text": "\n Iranian Students of California - Home | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home Posts Events Reviews Live Videos Photos About Community See more of Iranian Students of California on Facebook Log In or Create New Account See more of Iranian Students of California on Facebook Log In Forgot account? or Create New Account Not Now Community See All 459 people like this 513 people follow this About See All iranianstudentsca.org Community Organization  ·  College & University Page Transparency See More Facebook is showing information to help you better understand the purpose of a Page. See actions taken by the people who manage and post content. Page created - July 28, 2020 People 459  likes Related Pages USC IGSA Nonprofit Organization Perspective Magazine Magazine SUTA Southern California Organization Persian Party Musician/Band USC Persian Students and Alumni Education Taak Ensemble Musician/Band Persian Events Musician/Band Iranian Student Association at University of Nevada, Reno Community College UC Santa Cruz Armenian Students Association Organization Saeid Karandish, MD Health/Beauty Sassan Kamali Radio Station Amnesty International Group 48 - Portland Community Organization Iranian Student Association (IranSA) at CSUF Nonprofit Organization The Little Soul Education Time for sympathy Arts & Humanities Website FAHA Nonprofit Organization LOA/Apricot Tree, Inc. Nonprofit Organization Census 2020 Public Square / Plaza UC Riverside International Affairs College & University PSA - Persian Student Association at Stanford University Nonprofit Organization See More triangle-down Pages Liked by This Page Middle Eastern Resource Center - UCSB EOP Farhang Foundation Pages Community Organization Iranian Students of California English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 Posts Iranian Students of California April 2  ·  Come ane see the last day of our festival with our amazing guest performers!! Event is less than an hour away at 6pm pst!! It looks like you may be having problems playing this video. If so, please try restarting your browser. Close ASADI & TEHRAN IN LESS THAN AN HOUR @ 6PM PAT Posted by  Iranian Students of California 35 Views Iranian Students of California April 1  ·  The last day of our virtual Nowruz Event is coming up! We have collaborated with UCLA, UC Berkeley, USC, UCD, UCR, UCSD, UCSB, UofSF, UofWashington, UCI, and Chai Talk in order to bring you an amazing event featuring an awesome Musician and Comedian, Asadi and Tehran!    The event will be live on zoom this Friday (aka tomorrow) at 6pm! Can’t wait to see all of you! It looks like you may be having problems playing this video. If so, please try restarting your browser. Close Posted by  Iranian Students of California 18 Views See All See More \n \n \n"
}