{
    "docno": "RJP706",
    "url": "https://developers.facebook.com/startups",
    "text": "\n Facebook Startup Programs | Facebook for Developers \n \n \n \n \n \n Startup programs  About   F8 Refresh  Something Went Wrong We're having trouble playing this video. Learn More Accelerate your startup's growth Our startup programs connect innovative businesses with opportunities to leverage Facebook technologies to grow.  Accelerate your startup's growth Our startup programs connect innovative businesses with opportunities to leverage Facebook technologies to grow.  Accelerate your startup's growth Our startup programs connect innovative businesses with opportunities to leverage Facebook technologies to grow.  DISCOVER & INTEGRATE FACEBOOK PRODUCTS Whether you’re new to the solutions Facebook offers beyond advertising, or already building with us, we provide programs that enable startups to discover and integrate products under the guidance of Facebook experts. WHAT WE OFFER Learn about new products We host experiences like startup bootcamps that provide practical training on Facebook products and platforms, delivered by in-house experts Integrate Facebook technologies  Our global startup accelerators help innovative businesses integrate Facebook products for growth Opportunities for ecosystem enablers We regularly connect with VCs and other startup enablers to share information on our programs, and the Facebook products and technology areas we're focusing on We're always looking to welcome innovative businesses to our startup programs  Sign up for email updates  Get the latest news and application updates for Facebook's startup programs  Sign up for email updates  Latest News  Meet the startups from the Facebook Accelerator: Commerce program   November 12, 2020 Introducing the First Cohort of the Facebook Accelerator: Connectivity Program  November 9, 2020 Driving growth for startups through the Facebook Accelerator program August 3, 2020 See all Startups news See how fellow startups achieved their goals How Startups are Pivoting During the Pandemic Facebook is committed to supporting the global startup community during the Coronavirus (COVID-19) public health crisis.   Read the blog post   Visit the Resource Hub  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n"
}