{
    "docno": "RJP739",
    "url": "https://pt-pt.facebook.com/business/",
    "text": "\n Facebook Business: marketing no Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Soluções Por objetivo Aumentar a divulgação da marca Promover o teu negócio local Aumentar as vendas online Promover a tua app Gerar leads Monetizar os teus conteúdos Redefinir os clientes existentes como público-alvo Ver todos os objetivos Por tipo de negócio Pequenas empresas Grandes empresas Agência Editor e conteúdos multimédia Criador de conteúdos Programador Startup Parceiro de marketing Plataformas e produtos Plataformas Facebook Instagram Messenger WhatsApp Audience Network Oculus Workplace Produtos Ferramentas gratuitas Histórias Lojas Facebook Business Suite Anúncios Anúncios de vídeo Gestor de Anúncios Medição Inspiração Estatísticas e inspiração Estatísticas de marketing do Facebook IQ Notícias sobre negócios Estudos de caso Vídeo Eventos e colaboração Eventos Centro Criativo Educação e recursos Competências e formação Cursos de aprendizagem online Programas de certificação Webinars Guias e recursos Guia de anúncios Recursos para a COVID-19 Segurança e integridade Igualdade nos negócios Bem social Encontrar um Parceiro de Marketing Suporte Criar um anúncio chevron-down chevron-down Criar uma Página Criar uma Página Soluções Por objetivo Aumentar a divulgação da marca Promover o teu negócio local Aumentar as vendas online Promover a tua app Gerar leads Monetizar os teus conteúdos Redefinir os clientes existentes como público-alvo Ver todos os objetivos Por tipo de negócio Pequenas empresas Grandes empresas Agência Editor e conteúdos multimédia Criador de conteúdos Programador Startup Parceiro de marketing Plataformas e produtos Plataformas Facebook Instagram Messenger WhatsApp Audience Network Oculus Workplace Produtos Ferramentas gratuitas Histórias Lojas Facebook Business Suite Anúncios Anúncios de vídeo Gestor de Anúncios Medição Inspiração Estatísticas e inspiração Estatísticas de marketing do Facebook IQ Notícias sobre negócios Estudos de caso Vídeo Eventos e colaboração Eventos Centro Criativo Educação e recursos Competências e formação Cursos de aprendizagem online Programas de certificação Webinars Guias e recursos Guia de anúncios Recursos para a COVID-19 Segurança e integridade Igualdade nos negócios Bem social Encontrar um Parceiro de Marketing Search Soluções Plataformas e produtos Inspiração Educação e recursos Suporte Criar um anúncio  Criar uma Página  Plano de marketing personalizado Dissipa todas as dúvidas sobre o crescimento do teu negócio. Obtém orientação passo a passo, estatísticas do setor e ferramentas para monitorizares o teu progresso, tudo num único local. Criar um plano Alcança os teus objetivos mais depressa. Começa já. Escolhe um objetivo comercial e vê como o Facebook pode ajudar. Ver tudo Ver tudo Boost with Facebook Obtém formação, apoio e estatísticas durante a nossa época de apoio. Saber mais Ocorreu um erro Estamos a ter problemas a reproduzir este vídeo. Saber mais  Mais atualizações de época festiva Facebook IQ Sabe como as pessoas esperam celebrar e fazer compras. Saber mais Lojas do Facebook Permite que os clientes descubram os teus melhores produtos de época festiva. Saber mais Lojas do Instagram Descobre como te podes antecipar nesta época. Saber mais Mais notícias Plataformas Contacta com os teus clientes nas suas plataformas favoritas. Ajuda e suporte do Facebook Em que mais te podemos ajudar? Obtém apoio  para um problema específico no Centro de Ajuda para Negócios. Esta página foi útil? Sim Não Plataformas Facebook Instagram Messenger WhatsApp Audience Network Oculus Workplace Produtos Ferramentas gratuitas Páginas do Facebook Perfis do Instagram Stories Lojas Facebook Business Suite Anúncios do Facebook Anúncios do Messenger Anúncios do Instagram Anúncios de vídeo Gestor de Anúncios Objetivos Configurar uma Página do Facebook Introdução ao Messenger Aumentar a divulgação da marca Promover o teu negócio local Aumentar as vendas online Promover a tua app Gerar leads Medir e otimizar anúncios Redefinir os clientes existentes como público-alvo Ver todos os objetivos Tipos de negócio Pequena empresa Grandes empresas Agência Publicador e conteúdos  multimédia Criador de  conteúdos Programador Startup Parceiro de marketing Setores Setor automóvel B2B Artigos embalados para consumo Comércio eletrónico Entretenimento e média Serviços financeiros Jogos Imobiliário Restaurantes Retalho Tecnologia e telecomunicações Viagens Inspiração Estatísticas do mercado a partir do Facebook IQ Notícias sobre negócios Estudos de caso Vídeo Eventos Centro Criativo Competências e formação Aprendizagem online Programas de certificação Webinars Guias e recursos Guia de anúncios Recursos para a COVID-19 Segurança e integridade Encontrar um Parceiro de Marketing  Facebook © 2021 Acerca de Programadores Empregos Privacidade Cookies Termos Centro de Ajuda Português (Portugal) English (US) English (UK) Español Português (Brasil) Français (France) Mais idiomas Español (España) العربية Tiếng Việt Italiano Deutsch ภาษาไทย 中文(台灣) Čeština Dansk Ελληνικά Suomi Français (Canada) עברית हिन्दी Magyar Bahasa Indonesia 日本語 한국어 Bahasa Melayu Norsk (bokmål) Nederlands Polski Română Русский Svenska Türkçe 中文(简体) 中文(香港) \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n   \n"
}