{
    "docno": "RJP704",
    "url": "https://ja-jp.facebook.com/privacy/explanation",
    "text": "\n Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n 移動: このページのセクション アクセシビリティのヘルプ このメニューを開くには、 alt と / を同時に押してください Facebook メールアドレスまたは電話番号 パスワード アカウントを忘れた場合 登録 全データの使用に関するポリシー  カリフォルニア州消費者プライバシー法は、2020年1月1日に発効しています。カリフォルニア州にお住まいの方は、ご自身に認められているプライバシー権の詳細について こちら をご確認ください。  Facebook広告管理   プライバシー基本ガイド   Cookieポリシー   規約  その他のリソース  　　 データに関するポリシーの印刷用バージョンを表示する   インタラクティブなツール   未成年利用者の安全   Facebookのプライバシーに関するページ   Facebookの安全に関するページ   「Facebook Site Governance」ページ   EU-米国間プライバシーシールドおよびスイス-米国間プライバシーシールドに関する通知  データに関するポリシー このポリシーは、弊社が提供するFacebook、Instagram、Messengerおよびその他の製品や機能(以下、 Facebook製品 または弊社製品)をサポートするために、弊社が処理する情報について説明しています。その他のツールや詳細な情報については、 Facebookの設定 および Instagramの設定 をご覧ください。 トップに戻る  弊社が取得する情報の種類   Facebook製品を提供するにあたり、弊社は利用者に関する情報を処理する必要があります。弊社が取得する情報の種類は、利用者が弊社製品をどのように使用するかによって決まります。弊社が取得する情報にアクセスする方法および情報を削除する方法については、 Facebookの設定 および Instagramの設定 をご覧ください。  利用者等が実行および提供するもの 利用者が提供する情報とコンテンツ 利用者が弊社製品を利用する際(アカウント登録、コンテンツの作成やシェア、メッセージの送受信や他の利用者とのコミュニケーションなど)、Facebookは、利用者が提供するコンテンツ、コミュニケーション、その他の情報を取得します。当該情報には、例えば写真の位置情報やファイル作成日など、利用者が提供するコンテンツに含まれる情報または関連する情報(メタデータなど)が含まれます。さらに、利用者がFacebookの提供する機能を通じて見るものを含みます。例えば、Facebookの提供する カメラ などにおいて、情報を取得することにより、利用者が好むと思われるマスクやフィルターの提案や、カメラフォーマットの使用ヒントなどを提供できるようにすることもあります。弊社のシステムでは、利用者が提供するコンテンツやコミュニケーションを自動的に処理し、 以下 の目的で背景や内容を分析します。共有する内容が表示される範囲の管理方法について詳しくは、 こちら をご覧ください。  特別に保護されるデータ: 利用者の選択により、宗教・信仰、政治観、「恋愛対象」、健康に関する情報を、Facebookの プロフィールフィールド やライフイベントに掲載することができます。この情報、および他の情報(人種、種族的出身、哲学的信条、労働組合への加入など)は、利用者の居住国の法律上、特別な保護の対象となる可能性があります。 ネットワークやつながり 弊社の取得情報には、利用者がつながっている人、 ページ 、アカウント、 ハッシュタグ およびグループに加え、弊社の全製品にわたる相手との交流方法(例えば最も頻繁にコミュニケーションをとる人や参加しているグループなど)に関するものがあります。利用者が 連絡先情報をデバイスからアップロード、同期、インポートすることを選択する 場合(アドレス帳、通話記録、SMSの記録履歴など)、Facebookはこのような情報を取得して、知り合い候補を見つけたり、 以下 に掲げる他の目的に利用する場合があります。 弊社製品の利用 Facebookは、弊社製品の利用方法に関する情報を取得します。例えば、見たり参加したりするコンテンツのタイプ、利用機能、行動、交流する人やアカウント、アクティビティの時間、頻度、間隔といった情報が含まれます。例えばFacebookでは、弊社製品が利用されている時間や最後の利用時間、利用者がFacebook製品で見た投稿、動画その他のコンテンツなどを記録しています。また、カメラなどの機能の利用方法に関する情報も取得しています。 Facebook製品での取引に関する情報 利用者が 購入 やその他の金銭的な取引(ゲームでの購入や 寄付 など)のためにFacebook製品を利用する場合、Facebookは購入または取引に関する情報を取得します。ここで取得される情報には、クレジットカード、デビットカードの番号その他のカード情報、その他のアカウント情報や認証情報、請求や配送、連絡先などの詳細が含まれます。 利用者に関する他者の行動や、利用者に関して他者が提供する情報 Facebookは、利用者以外の人が弊社製品を利用する際に提供するコンテンツ、コミュニケーション、情報を受信し、分析します。他者があなたの写真を共有したり、あなたの写真にコメントしたりする場合、あなたにメッセージを送信する場合、あなたの連絡先情報をアップロード、同期、インポートする場合などには、Facebookが受信、分析する情報に、あなたに関する情報も含まれる可能性があります。 デバイス情報  以下の説明にあるように、弊社は、弊社製品と接続して利用者が使用するコンピューター、携帯電話、スマートテレビなどのウェブ接続デバイスからの情報、およびこれらのデバイスに関する情報を取得し、利用者が使用する各デバイスの情報を統合します。例えば、利用者による携帯電話での弊社製品の利用に関して取得した情報を使用して、弊社は、利用者がノートパソコンやタブレットなど別のデバイスで弊社製品を使用する際に見るコンテンツ( 広告 も含みます)や機能のパーソナライズ精度を高めたり、携帯電話で表示された広告に対して利用者が他のデバイスでアクションを実行したかどうかを測定したりします。   弊社がこれらのデバイスから取得する情報は、以下を含みます。  デバイスの特質:  オペレーティングシステム、ハードウェアとソフトウェアのバージョン、電池レベル、信号強度、ストレージの空き容量、ブラウザーの種類、アプリとファイルの名称と種類、プラグインなどの情報。 デバイスの操作:  デバイス上で行われる操作と行動、ウィンドウが前景か背景であるか、マウスの動き(ボットの識別に役立てることが可能)などの情報。 識別情報:  利用者が利用するゲーム、アプリ、アカウントからの固有の識別情報、デバイスID、その他の識別情報、およびFamily Device ID(または、同じデバイスやアカウントに関連付けられている Facebookグループ企業の製品 に固有の他の識別情報)。 デバイスの信号: Bluetoothシグナル、および近くのWi-Fiアクセスポイント、ビーコン、セルタワーに関する情報。 デバイス設定データ:  GPSの位置情報、カメラ、写真など、デバイス設定で有効にすることにより利用者が弊社のアクセスを認めている情報。 ネットワークおよび接続:  携帯電話会社名、インターネットサービスプロバイダー名、言語、タイムゾーン、携帯電話番号、IPアドレス、接続速度、場合によっては近くにあるまたはネットワーク上にある他のデバイスに関する情報など、弊社が利用者の利用を手助けするための情報( 動画を携帯電話からテレビにストリーミングする など)。 Cookieデータ:  使用デバイスに保存されたCookieデータ(CookieのIDや設定など)。弊社がCookieを利用する方法について、詳しくは Facebook Cookieポリシー および Instagram Cookieポリシー をご覧ください。 パートナーからの情報  広告主、 アプリ 開発者およびパブリッシャーは、利用している Facebookビジネスツール (ソーシャルプラグイン(「いいね！」ボタンなど)、Facebookログイン、弊社の APIとSDK 、Facebook ピクセル など)を通じて、弊社に情報を送信することができます。これらのパートナーが提供する情報には、利用者のFacebook外におけるアクティビティに関するものが含まれます。これには利用者のデバイス、訪問したウェブサイト、購入履歴、閲覧した広告、パートナーのサービスの利用状況が含まれ、利用者がFacebookアカウントを保持しているかどうか、またはFacebookにログインしているかどうかに関わらず提供されます。例えば、ゲーム開発者が弊社APIを使用して利用者がどのゲームをプレイしたかを弊社に送信したり、事業者が自社ストアにおいて利用者が行った購入について弊社に情報を提供したりすることがあります。また、利用者のオンライン・オフラインアクションについて、および利用者の情報を弊社に提供する権利を有するサードパーティデータプロバイダーからの購入についての情報が弊社に提供されます。   利用者がパートナーのサービスを訪問、利用した場合、またはパートナーが連携する外部パートナーを通して、パートナーは利用者のデータを受け取ります。これらのパートナーが弊社にデータを提供する前に、パートナーが利用者のデータを取得、利用、共有する正当な権利を有していることを弊社は当該パートナーに要求します。弊社がデータを受け取るパートナーの種類について、詳しくは こちら をご覧ください。   弊社がFacebookビジネスツールに関連してCookieを利用する方法について、詳しくは Facebook Cookieポリシー および Instagram Cookieポリシー をご覧ください。  トップに戻る  弊社が取得した情報の利用目的   弊社は、 Facebook利用規約 および Instagram利用規約 に記載された弊社製品と関連サービスを提供、サポートするために、保有している情報を(利用者の選択に従い)以下のとおり利用します。保有している情報の具体的な利用目的は以下のとおりです。  弊社製品の提供、パーソナライズおよび改善  弊社は保有する情報を、機能とコンテンツ(利用者に表示される ニュースフィード 、 Instagramフィード 、Instagramストーリーズ、広告など)のパーソナライズ、弊社製品の内外における利用者へのおすすめ(興味がありそうなグループもしくは イベント 、またはフォローしたいと思われるトピックなど)の表示を含め、弊社製品を提供するために利用します。弊社は、利用者に合わせて関連性の高いパーソナライズ製品を作成するために、利用者などから取得および認識したデータ(利用者が提供することを選択した 特別に保護されるデータ を含む)に基づく利用者のつながり、嗜好、関心、およびアクティビティを利用します。また、利用者の弊社製品の利用状況ならびに弊社製品に対する反応、および利用者が弊社製品の内外でつながりを持ち関心を抱いている人、場所、物についても同様に利用します。以下に、弊社が利用者に関する情報をどのように利用して、FacebookやInstagramなどのFacebook製品内で利用者に提供される機能、コンテンツ、おすすめなどをパーソナライズしているかを説明します。併せて、利用者に表示される 広告 がどのように選ばれているかも説明します。  Facebook製品とデバイスとの情報のやり取り:  弊社は、さまざまなFacebook製品やデバイスでの利用者のアクティビティ情報を連動させ、すべてのFacebook製品において利用者に合った一貫性のあるサービスを提供できるようにしています。例えば、Instagramでフォローしている人やMessengerで対話している人がメンバーになっているFacebookグループへの参加をおすすめしています。弊社はシームレスな利用を進める取り組みも行っています。弊社製品のアカウント登録の際に、すでに利用している別のFacebook製品の登録情報(携帯電話番号など)を自動入力する機能はその一例です。 位置関連情報:  弊社は、 広告を含む 弊社製品を利用者などに提供、パーソナライズ、および改良する目的で、利用者の現在位置、住所、好んで行く場所、付近の事業者や人々などの 位置関連情報 を利用します。位置関連情報は、デバイスの正確な位置情報(利用者が弊社にその情報の取得を認めている場合)、IPアドレス、利用者などのFacebook製品の利用から得た情報(チェックインやイベント参加など)などに基づくことがあります。 製品調査・開発:  弊社では、弊社製品を開発、テスト、改善する目的で保有情報を利用し、アンケートや調査の実施、新製品や機能のテストおよびトラブルシューティングなどを行います。 顔認識機能:  利用者がこの機能をオンにした場合、弊社は写真、動画、またはカメラ操作においてその利用者を識別するために、顔認識技術を使用します。Facebook作成の顔認識テンプレートは、利用者の国の法律に基づく 特別に保護されるデータ を構成する可能性があります。 Facebookが顔認識技術を利用 し、またその技術の利用を管理する方法について、詳しくは Facebookの設定 をご覧ください。顔認識技術をInstagramに導入する場合、弊社はその旨を事前に利用者へ通知し、弊社がこの技術を利用者のために使用するかどうかを、利用者自身が決定できるようにします。 広告とその他のスポンサーコンテンツ:  弊社は、広告やクーポンなどの利用者に表示するスポンサーコンテンツを選定およびパーソナライズする目的で、利用者に関して弊社が保有する、利用者の趣味・関心、アクション、つながりなどの情報を利用します。弊社が 広告を選定およびパーソナライズ する方法、および弊社が利用者に表示する広告などのスポンサーコンテンツを選定するために使用するデータに関して利用者がとれる選択肢について、詳しくは Facebookの設定 および Instagramの設定 をご覧ください。 測定、分析、その他のビジネスサービスの提供  弊社は、保有する情報(訪問したウェブサイトや閲覧した広告など、利用者の弊社製品外におけるアクティビティを含む)を、広告主などのパートナーが広告効果やサービス利用状況を測定し、そのパートナーのウェブサイト、アプリ、サービスをどのようなタイプの人々が利用し、どのように反応しているかを分析できるようにする目的で使用します。弊社がパートナーと情報を共有する方法について、詳しくは こちら をご覧ください。  安全、保全、セキュリティの推進  弊社は、保有する情報を、アカウントとアクティビティの認証、悪質な行為への対処、スパムなどの問題の検知と防止、弊社製品の保全維持、弊社製品の内外における安全とセキュリティの推進のために利用します。例えば、不審なアクティビティや弊社の利用規約あるいはポリシーへの違反を調査したり、 助けが必要な人を特定 したりするために、保有情報を利用しています。詳しくは、 Facebookヘルプセンター および Instagramヘルプセンター のセキュリティに関するヒントをご覧ください。  利用者とのコミュニケーション  弊社は、保有する利用者情報を、マーケティング情報の送信、Facebook製品に関するご案内、ポリシーや利用規約に関するお知らせのために利用します。また、利用者からのお問い合わせに返信するためにも使用します。  公益目的の調査とイノベーション  弊社は、保有する情報(弊社が連携する調査パートナーからのものを含む)を、広く社会の福祉、技術の発展、および公共の利益、健康、福利に関する 調査 とイノベーションの実施や支援に利用します。例えば、 災害発生時には避難行動パターンに関して弊社が保有する情報を分析して 救援活動をサポートします。弊社の調査プログラムについて、詳しくは こちら をご覧ください。  トップに戻る  情報の共有方法   利用者情報は、以下の方法で他者と共有されます。  Facebook製品上での共有 利用者がコンテンツの公開や送信の対象とする人およびアカウント  利用者は、弊社製品を利用してコンテンツの公開や送信を行う際に、 当該コンテンツの共有範囲を指定 します。例えば、利用者がFacebookに投稿する際には、グループ、友達全員、公開、表示先のカスタムリストなど、共有範囲を指定します。同様に、利用者がMessengerやInstagramで人や事業者にコンテンツの公開や送信を行うと、その人や事業者は利用者が送信したコンテンツを見ることができます。利用者が弊社製品上でとったアクションは、広告などのスポンサーコンテンツに対する反応も含め、利用者のネットワーク(友達など)にも表示される場合があります。弊社はまた、FacebookストーリーズまたはInstagramストーリーズを誰が閲覧したかを、それらを投稿したアカウントから見ることができるようにします。  公開情報 は、Facebookアカウントを持っていない人を含め、誰でもFacebook製品の内外で見ることができます。公開情報には、利用者のInstagramユーザーネーム、公開指定でシェアする情報、 Facebook上の公開プロフィール 内の情報、および利用者がFacebookページ、 Instagram公開アカウント 、もしくはその他の公開フォーラム( Facebook Marketplace など)上でシェアするコンテンツが含まれます。利用者、それ以外のFacebookおよびInstagramの利用者、および弊社は、Facebookグループ企業の他の製品内、検索結果内、またはツールやAPI経由を含め弊社製品の内外で、公開情報へのアクセスを提供することも、公開情報を任意の相手に送信することもできます。公開情報は、検索エンジン、API、テレビなどのオフラインメディアに代表される第三者のサービスを通じて、また弊社製品と連携するアプリやウェブサイトなどのサービスによって、閲覧、アクセス、再シェア、またはダウンロードすることもできます。   公開情報、および共有範囲のコントロール方法について、詳しくは Facebook および Instagram をご覧ください。  利用者に関して他の利用者がシェアまたは再シェアするコンテンツ  Facebook製品では、利用者のアクティビティを見ることができる人は、その利用者が共有範囲に指定していない人にも弊社製品の内外でコンテンツをシェアできるため、あなた自身が自分のコンテンツをシェアする人や事業者を慎重に選ぶ必要があります。例えば、あなたが特定の友達やアカウントにシェアした投稿や送信したメッセージを、その友達やアカウントは弊社製品の内外で直接または Facebook Spaces などのバーチャルリアリティ体験内で、ダウンロード、スクリーンショット、再シェアを通じて第三者に共有することが可能です。また、利用者が他人の投稿に付けたコメントやリアクションは、その投稿を見ることができる人なら誰にでも表示されますし、投稿者が後から共有範囲を変更する可能性もあります。   さらに、他人が弊社製品を使ってあなたに関するコンテンツを作成し、その人が指定した共有範囲でシェアする場合もあります。例えば、ストーリーでは、あなた以外の利用者があなたの写真をシェアしたり、投稿で位置情報を付けてあなたについて言及またはタグ付けしたり、投稿やメッセージであなたに関する情報をシェアできます。弊社製品上であなたに関する不快なコンテンツがシェアされている場合には、 そのコンテンツを報告 することができます。  弊社製品におけるオンライン状況とプレゼンスに関する情報  利用者のネットワークのメンバーには、利用者の弊社製品におけるオンライン状況、例えば Instagram 、 Messenger 、Facebookにおいて現在オンライン中かどうか、最後にオンラインになったのはいつか、などを示すシグナルが表示されます。  弊社製品を利用または統合したアプリ、ウェブサイト、第三者のサービス  あなたが、弊社製品を使用、またはそれと連携するサードパーティのアプリやウェブサイトなどのサービスを利用することを選択した場合、あなたが投稿または共有したものに関する情報がそのようなサービスに送信される可能性があります。例えば、あなたがゲームをFacebookの友達と一緒にプレイしたり、ウェブサイトに埋め込まれたFacebookのコメントやシェアのボタンを使用すると、ゲーム内でのあなたのアクティビティに関する情報がゲーム開発者やウェブサイトに送信されたり、コメントやシェアしたコンテンツへのリンクが送信されたりする可能性があります。また、このようなサードパーティのサービスをあなたがダウンロードしたり使用したりすると、そのサードパーティは、あなたのFacebook上の 公開プロフィール と、あなたがそのサードパーティと共有する情報にアクセスできます。利用者が利用するアプリとウェブサイトでは、利用者がFacebookの友達リストをシェアすることを選択した場合、友達はそのリストを受け取る可能性があります。しかし、利用者が利用するアプリやウェブサイトでは、Facebookの友達についてのその他の情報、またはInstagramのフォロワーについての情報を受け取ることはできません(しかし、言うまでもなく友達やフォロワーがこの情報をシェアすることを選択する可能性があります)。このようなサードパーティのサービスにより取得される情報には、本ポリシーではなく、それぞれが定めた規約やポリシーが適用されます。   ネイティブバージョンのFacebookおよびInstagramを提供するデバイスおよびオペレーティングシステム(つまり弊社のファーストパーティアプリを弊社が開発していない場合)は、そのネイティブバージョンのFacebookおよびInstagramの主要機能を利用者に提供するために、利用者が当該デバイスおよびオペレーティングシステムに共有することを選択したすべての情報にアクセス権を持つことになります。これには利用者の友達が利用者にシェアした情報も含まれます。   注:  弊社は現在、データの不正使用対策を強化するため、開発者によるデータへのアクセスに制限を設ける取り組みを進めています。例えば、利用者が3か月間アプリを利用していない場合、弊社は開発者がその利用者のFacebookやInstagramのデータにアクセスできないようにします。弊社はログインの仕様を変更し、次のバージョンでは、アプリのレビューなしにアプリがリクエストできるデータを名前、Instagramユーザーネーム、自己紹介、プロフィール写真、電子メールアドレスのみに減らす予定です。他のデータを取得するにはFacebookの承認が必要となります。 新オーナー  弊社製品またはその資産の全部または一部が譲渡または移管された場合、弊社は、利用者情報もそれに伴い移管することができます。  サードパーティパートナーとの共有  弊社は、弊社製品の提供と改善をサポートするサードパーティパートナー、またはFacebookのビジネスツールを使って自社ビジネスを拡大するサードパーティパートナーと連携することによって、私達の会社の運営と世界中の人への無料サービス提供を実現しています。弊社は、あなたの情報を他者に販売していませんし、今後も決していたしません。また、パートナーに対しては、弊社が提供するデータの利用と開示方法について厳しい制約を課しています。情報を共有する外部パートナーの種類は次のとおりです。  弊社の分析サービスを利用するパートナー  弊社は、個人または事業者が自身の投稿、リスティング、ページ、動画、その他Facebook製品内外のコンテンツに対する人々の反応を把握できるように、集約した統計やインサイトを提供します。例えば、ページ管理者やInstagramビジネスプロフィールは、そのページやプロフィールの投稿を閲覧し、またはそれに対して反応やコメントを返した人やアカウントの数に関する情報に加え、そのページやプロフィールの反響を把握するのに役立つデモグラフィック属性などの統計情報を受け取ります。  広告主  Facebookは、広告を見た人のタイプや広告の効果についてのレポートを広告主に提供していますが、利用者が許可する場合を除き、利用者を特定する情報(利用者への連絡や特定につながる利用者名やメールアドレスなど)は共有しません。例えば、利用者のデモグラフィック情報や趣味・関心に関する一般的な情報(例えば、広告を見た利用者は、マドリッドに住んでいる25～34歳の女性で、ソフトウェアエンジニアリングに関心があるといった情報)を、ターゲット層を把握するために役立たせる目的で広告主に提供しています。また、どのFacebook広告が購入やアクションにつながったかを確認し、広告主に知らせます。  効果測定を行うパートナー企業  弊社は、利用者に関する情報を、弊社パートナーに分析や測定のレポートを提供する目的で、データ集計を行う企業と共有します。  弊社製品で商品およびサービスを販売するパートナー  利用者が有料コンテンツの受信を申し込むか、弊社製品内で販売されるものを購入する場合、当該コンテンツのクリエイターや販売者は、利用者の公開情報や他の共有情報、および取引完了に必要な情報(配送先や連絡先情報など)を受信します。  ベンダーとサービスプロバイダー  弊社は、技術インフラサービスの提供、弊社製品の利用状況の分析、カスタマーサービスの提供、決済の代行、アンケートの実施などにより弊社の事業を補助するベンダーとサービスプロバイダーに、情報とコンテンツを提供します。  研究機関や教育機関  また弊社は、自社の事業やミッションを支える学問やイノベーションを推進し、広く社会の福祉、技術の発展、および公共の利益、健康、福利に関する発見とイノベーションに資する調査を実施するために、調査パートナーおよび 学術機関 に情報とコンテンツを提供します。  法執行機関や法的要請  弊社は、 以下に 挙げる状況において、法執行機関に対し、または法的要請に応えて、情報を共有します。   サードパーティパートナーと共有されるあなたの情報をあなたが管理する方法について、詳しくは Facebookの設定 および Instagramの設定 をご覧ください。  トップに戻る  Facebookグループ企業の連携方法   FacebookとInstagramは、利用者が使用する Facebookグループ企業の製品 すべてにわたり、革新的で、関連性が高く、一貫性のある安全な体験を提供するため、インフラストラクチャ、システム、技術を他の Facebookグループ企業 (WhatsApp、Oculusなど)と共有します。また、弊社は、利用者に関する情報をFacebookグループ企業全体にわたり前述の目的で処理していますが、このような処理を、適用法が許容する範囲で、各企業の利用規約とポリシーに従って行います。例えば、弊社はWhatsAppのサービスでスパムを送信するアカウントに関する情報を処理し、Facebook、Instagram、Messengerでそのような問題のあるアカウントに対して適切な措置を講じられるようにしています。また、Facebookグループ企業の製品の利用状況と反響を把握するため、製品別のユニークユーザー数の調査なども行います。  トップに戻る  利用者が自分の情報を管理または削除する方法   利用者は、自分のデータにアクセスし、修正、移動、消去することができます。詳細については、 Facebookの設定 および Instagramの設定 をご覧ください。   弊社は、弊社サービスやFacebook製品の提供に必要でなくなる時点、または利用者のアカウントが削除される時点のいずれか早い時点まで、データを保存します。この判断は、データの性質、取得や処理の理由、関連する法的または業務上のデータ保持の必要性といった要因に応じて、事例ごとに行われます。例えば、利用者がFacebookで検索を行う場合、検索履歴に含まれるクエリにはいつでもアクセスし、削除できますが、その検索記録は6か月後に削除されます。利用者がアカウント認証のために提出した公的機関発行の本人確認書類のコピーは、別途定めがない限り審査の30日後に削除されます。詳しくは、 共有されたコンテンツ および ソーシャルプラグインから取得されたCookieデータ の削除に関する説明をご覧ください。   利用者がアカウントを削除した場合、弊社はその利用者が投稿したコンテンツ(写真や近況アップデートなど)を 削除します 。いったん削除された情報は回復できません。利用者に対して他の利用者がシェアした情報は、利用者のアカウントに含まれないため削除されません。アカウントを削除するつもりはなく、製品の利用を一時的に停止したい場合、利用者は、アカウントを利用解除することができます。アカウントはいつでも削除することができます。 Facebookの設定 および Instagramの設定 をご覧ください。  トップに戻る  法的要請への対応、危害の防止   Facebookは、次の場合、利用者情報にアクセスし、これを保持し、規制当局、法執行機関またはその他の当事者と共有します。  Facebookが法律により求められていると誠実に判断するときに、法律上の要請(捜査令状、裁判所命令、召喚状など)に応じる場合。これには、米国外の法域から法的要請を受け、当該法域の法律に従い弊社がこれに応える義務があり、弊社の対応がこの法域の利用者に影響を及ぼし、かつ国際的に認められた基準にも沿うことになると弊社が誠実に判断した場合に、当該要請に応じることも含まれます。 不正行為、製品の無断使用、弊社規約やポリシーへの違反、他の悪質または違法な活動を検知、防止、対処するため、弊社(権利、財産、製品を含む)または利用者などを保護するため(捜査や規制当局からの問い合わせの一環である場合など)、または死亡や差し迫った身体への危害を防止するために必要であるとFacebookが誠実に信じる場合。例えば、該当する場合は、利用者アカウントの信頼性についてサードパーティのパートナーに情報を提供するとともに、サードパーティパートナーから情報を受け取り、弊社製品またはそれ以外での詐欺、不正利用、その他の悪質な活動を防止します。  弊社が利用者に関して受け取った情報(Facebookを経由した購入に関する金融取引データを含む)は、法的要請もしくは義務、政府による調査の対象になった場合、弊社規約やポリシーの違反の疑いに関する調査の対象となった場合、または危害を防止する目的で、通常の期間を超えてアクセスおよび保持される可能性があります。また、利用規約違反を理由に停止されたアカウントの情報を1年以上保持し、悪用などの規約違反が繰り返されることを防止します。  トップに戻る  弊社のグローバルなサービスとしてのデータの運用と移転方法   Facebookでは、Facebookグループ企業内だけでなく、弊社のパートナーや利用者が世界中でつながる共有者などの外部者とも、本ポリシーに従って情報を世界規模で共有しています。利用者の情報は、本ポリシーに記載される目的で、米国やその他利用者の居住地以外の国に移転、転送、保存、処理される場合があります。 このようなデータの移転は、 Facebook利用規約 および Instagram利用規約 に明記されるサービスの提供や、弊社製品のグローバルな運用と利用者への提供のために必要です。Facebookは、 標準契約条項 を活用するほか、該当する場合には特定国に関する欧州委員会の 十分性認定 に依拠し、米国や米国以外の国へのこのようなデータの移転について利用者の同意を取得しています。  トップに戻る  ポリシー変更の際の通知方法   このポリシーに変更を加える場合、弊社は事前に利用者へ通知し、利用者が改訂後のポリシーを確認し、今後製品の利用を続けるかどうかを検討できる機会を設けます。  トップに戻る  カリフォルニア州居住者向けのプライバシー通知   カリフォルニアにお住まいの方は、 カリフォルニア居住者のプライバシー通知 を参照して、消費者のプライバシー権の詳細を確認することができます。  トップに戻る Facebookへのお問い合わせ  プライバシーの詳細については、Facebookなら こちら 、Instagramなら こちら をご覧ください。このポリシーに関してご質問がある場合は、以下の方法で弊社にご連絡ください。   お問い合わせ   Facebookへのお問い合わせは、  オンライン  または以下の宛先へ郵便でお願いいたします。   Facebook, Inc.  ATTN: Privacy Operations  1601 Willow Road  Menlo Park, CA 94025   最終更新日: 2021年1月11日  日本語 English (US) Español Français (France) 中文(简体) العربية Português (Brasil) 한국어 Italiano Deutsch हिन्दी アカウント登録 ログイン Messenger Facebook Lite  Watch  ユーザー ページ ページカテゴリ スポット ゲーム 場所 Marketplace Facebook Pay グループ 求人 Oculus Portal Instagram ローカル 募金キャンペーン サービス 投票情報センター Facebookについて 広告を作成 ページを作成 開発者 採用情報 プライバシー Cookie AdChoices 規約 ヘルプ 設定 アクティビティログ  Facebook © 2021 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n"
}