{
    "docno": "RJP76",
    "url": "https://www.facebook.com/sigcse2021/?ref=py_c",
    "text": "\n Sigcse Technical Symposium 2021 - Home | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home Reviews About Photos Posts Community See more of Sigcse Technical Symposium 2021 on Facebook Log In or Create New Account See more of Sigcse Technical Symposium 2021 on Facebook Log In Forgot account? or Create New Account Not Now Sigcse Technical Symposium 2021 Science, Technology & Engineering  1 1 out of 5 stars. Community See All 468 people like this 498 people follow this About See All sigcse2021.sigcse.org Science, Technology & Engineering  ·  Education Page Transparency See More Facebook is showing information to help you better understand the purpose of a Page. See actions taken by the people who manage and post content. Page created - May 20, 2018 People 468  likes Related Pages CS Teaching Tips Education Snap Education Midwest Computer Museum Museum SIGCSE 2014 Educational Research Center Code from Zero Education GoGoBrain Education UWEC Women & Gender Minorities in STEM Organization Duke Undergraduate Machine Learning College & University Modern Figures Podcast Science, Technology & Engineering Python 4 Youth Education Website Computing Educators Oral History Project (CEOHP) Education CSTA Minnesota Education Anti-Gentrification Project Interest The Green Gatsby Travel & Transportation Seymour Papert Public Figure Blanket Statement Product/Service BJC: The Beauty and Joy of Computing Education Exploring Computer Science Education University of Utah Science & Engineering Fair Education The Beinecke Scholarship Program Nonprofit Organization See More triangle-down Pages Businesses Science, Technology & Engineering Sigcse Technical Symposium 2021 English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 Photos See All Posts Sigcse Technical Symposium 2021 March 14  ·  🎉 🎉 🎉  And..WE ARE LIVE  # SIGCSE2021  Opening Celebration is starting now!    https://pathable.sigcse2021.org/meetings/…/ZBmtLFtteBkpwzRjo  Join us to hear from your conference team, members of the SIGCSE Board and of course a panel Artificial Intelligence and Real Justice, Moderated by Kamau Bobb from @Google!! pathable.sigcse2021.org pathable.sigcse2021.org Sigcse Technical Symposium 2021 March 4  ·  Grab your morning  ☕️  and join our chairs for the first episode of  # SIGCSE2021  Morning Coffee!   https://www.youtube.com/watch?v=k5t14FNc5b0  We'll be sharing short episodes through March 20th! We'll give you session highlights, conference updates, and speak to members of the community. Welcome to SIGCSE Morning Coffee - a show all about what's going on at the 2021 SIGCSE Technical Symposium! youtube.com SIGCSE Morning Coffee - Welcome to SIGCSE TS 2021! Welcome to SIGCSE Morning Coffee - a show all about what's going on at the 2021 SIGCSE Technical Symposium! Welcome to SIGCSE Morning Coffee - a show all about what's going on at the 2021 SIGCSE Technical Symposium! See All See More \n \n \n"
}