{
    "docno": "RJP75",
    "url": "https://www.facebook.com/URBerkeley/?ref=py_c",
    "text": "\n Underwater Robotics at Berkeley - Home | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home About Photos Events Posts Community See more of Underwater Robotics at Berkeley on Facebook Log In or Create New Account See more of Underwater Robotics at Berkeley on Facebook Log In Forgot account? or Create New Account Not Now Community See All 173 people like this 199 people follow this About See All urobotics.berkeley.edu Organization Page Transparency See More Facebook is showing information to help you better understand the purpose of a Page. See actions taken by the people who manage and post content. Page created - August 20, 2016 People 173  likes Related Pages Robotics at Berkeley Organization Space Technologies at Cal Aerospace Company CalSol - UC Berkeley Solar Vehicle Team College & University UAVs at Berkeley Education Launchpad Science, Technology & Engineering ASME at Berkeley Organization Engineers for a Sustainable World at Berkeley - ESW Berkeley Science, Technology & Engineering Rocket Project at UCLA Nonprofit Organization UC Berkeley Aero SAE Aerospace Company Pi Tau Sigma - UC Berkeley College & University UpSync Consulting Consulting Agency UC Berkeley Gamma Rho Lambda Nonprofit Organization Hydromechs ROV Nonprofit Organization Sports Analytics Group at Berkeley Company Stanford Energy Club Nonprofit Organization Socially Engaged Engineers - SEE Education Extended Reality at Berkeley Nonprofit Organization Cal ITE Organization Tech+ Social Impact Science, Technology & Engineering Quantum Computing at Berkeley College & University See More triangle-down Pages Liked by This Page EnableTech Robotics at Berkeley RoboNation - AUVSI Foundation CUAUV Cal Rec Sports Berkeley Engineering Student Services See More triangle-down English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 Photos See All Posts Underwater Robotics at Berkeley  added an  event . September 6, 2020  ·  SUN, SEP 6, 2020 Info session Online Event Underwater Robotics at Berkeley September 6, 2020  ·  Reminder that we're having our infosession now (1-2pm) and also later tonight (8-9pm) if you can't make the first one! See All See More \n \n \n"
}