{
    "docno": "RJP734",
    "url": "https://ko-kr.facebook.com/business/",
    "text": "\n Facebook for Business: Facebook 마케팅 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 솔루션 목표별 브랜드 인지도 향상 주변 지역에 비즈니스 홍보 온라인 판매 증가 앱 홍보 잠재 고객 확보 콘텐츠로 수익 창출 기존 고객 리타게팅 목표 모두 보기 비즈니스 유형별 소규모 비즈니스 대규모 비즈니스 대행사 미디어 및 퍼블리셔 크리에이터 개발자 스타트업 마케팅 파트너 플랫폼 및 제품 플랫폼 Facebook Instagram Messenger WhatsApp Audience Network Oculus Workplace 제품 무료 도구 스토리 Shops Facebook Business Suite 광고 동영상 광고 광고 관리자 측정 영감을 주는 스토리 인사이트 및 아이디어 Facebook IQ 마케팅 인사이트 비즈니스 소식 사례 연구 동영상 이벤트 및 협업 이벤트 크리에이티브 허브 교육 및 리소스 스킬 및 교육 온라인 학습 과정 인증 프로그램 웨비나 가이드 및 리소스 광고 가이드 코로나19 리소스 안전 및 무결성 비즈니스 평등 사회적 공익 마케팅 파트너 찾기 지원 광고 만들기 chevron-down chevron-down 페이지 만들기 페이지 만들기 솔루션 목표별 브랜드 인지도 향상 주변 지역에 비즈니스 홍보 온라인 판매 증가 앱 홍보 잠재 고객 확보 콘텐츠로 수익 창출 기존 고객 리타게팅 목표 모두 보기 비즈니스 유형별 소규모 비즈니스 대규모 비즈니스 대행사 미디어 및 퍼블리셔 크리에이터 개발자 스타트업 마케팅 파트너 플랫폼 및 제품 플랫폼 Facebook Instagram Messenger WhatsApp Audience Network Oculus Workplace 제품 무료 도구 스토리 Shops Facebook Business Suite 광고 동영상 광고 광고 관리자 측정 영감을 주는 스토리 인사이트 및 아이디어 Facebook IQ 마케팅 인사이트 비즈니스 소식 사례 연구 동영상 이벤트 및 협업 이벤트 크리에이티브 허브 교육 및 리소스 스킬 및 교육 온라인 학습 과정 인증 프로그램 웨비나 가이드 및 리소스 광고 가이드 코로나19 리소스 안전 및 무결성 비즈니스 평등 사회적 공익 마케팅 파트너 찾기 Search 솔루션 플랫폼 및 제품 영감을 주는 스토리 교육 및 리소스 지원 광고 만들기  페이지 만들기  맞춤형 마케팅 플랜 추측에 의존하는 비즈니스 성장 전략은 이제 그만. 단계별 가이드와 업계 인사이트, 진행 상황을 추적할 수 있는 도구를 한곳에서 간편하게 만나보세요. 플랜 만들기 더 빠르게 목표를 달성하세요. 지금 바로 시작하세요. 비즈니스 목표를 선택하고 Facebook이 어떤 도움이 되는지 알아보세요. 모두 보기 모두 보기 Boost with Facebook 지원 시즌 동안 교육, 지원 및 인사이트를 받아보세요. 더 알아보기 문제가 발생했습니다 이 동영상을 재생하는 중 문제가 발생했습니다. 더 알아보기  더 많은 연말 시즌 업데이트 Facebook IQ 사람들이 연말 시즌을 즐겁게 보내기 위해 어떤 계획을 세우고 어떤 쇼핑을 생각하고 있는지 알아보세요. 더 알아보기  Facebook Shops 고객이 최고의 연말 시즌 제품을 발견하도록 유도하세요. 더 알아보기  Instagram Shops 이번 연말 시즌을 성공적으로 준비하는 방법을 알아보세요. 더 알아보기  플랫폼 고객이 시간을 보내는 플랫폼에서 고객과 소통하세요. Facebook 도움말 및 지원 무엇을 도와드릴까요? 특정 문제에 대한 도움을 받으려면  비즈니스 고객 센터를 방문하세요 . 이 페이지가 도움이 되었나요? 예 아니요 플랫폼 Facebook Instagram Messenger WhatsApp Audience Network Oculus Workplace 제품 무료 도구 Facebook 페이지 Instagram 프로필 스토리 Shops Facebook Business Suite Facebook 광고 Messenger 광고 Instagram 광고 동영상 광고 광고 관리자 목표 Facebook 페이지 설정하기 Messenger 시작하기 브랜드 인지도 높이기 주변 지역에 비즈니스 홍보 온라인 판매 증가 앱 홍보 잠재 고객 확보 광고 측정 및 최적화 기존 고객 리타게팅 목표 모두 보기 비즈니스 유형 소규모 비즈니스 대규모 비즈니스 대행사 미디어 및  퍼블리셔 크리에이터 개발자 스타트업 마케팅 파트너 업종 자동차 B2B 소비재 전자상거래 엔터테인먼트 및 미디어 금융 서비스 게이밍 부동산 음식점 리테일 기술 및 통신 여행 아이디어 Facebook IQ 마케팅 인사이트 비즈니스 소식 사례 연구 동영상 이벤트 크리에이티브 허브 스킬 및 교육 온라인 학습 인증 프로그램 웨비나 가이드 및 리소스 광고 가이드 코로나19 리소스 안전 및 무결성 마케팅 파트너 찾기  Facebook © 2021 회사소개 개발자 채용 정보 개인정보처리방침 쿠키 이용 약관 고객 센터 한국어 English (US) English (UK) Español Português (Brasil) Français (France) 언어 더 보기 Español (España) العربية Tiếng Việt Italiano Deutsch ภาษาไทย 中文(台灣) Čeština Dansk Ελληνικά Suomi Français (Canada) עברית हिन्दी Magyar Bahasa Indonesia 日本語 Bahasa Melayu Norsk (bokmål) Nederlands Polski Português (Portugal) Română Русский Svenska Türkçe 中文(简体) 中文(香港) \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n   \n"
}