{
    "docno": "RJP86",
    "url": "https://www.facebook.com/saleemyapa/?ref=py_c",
    "text": "\n Saleem & Yapa East Coast Real Estate - Home | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home Services Reviews Photos Videos Posts About Community See more of Saleem & Yapa East Coast Real Estate on Facebook Log In or Create New Account See more of Saleem & Yapa East Coast Real Estate on Facebook Log In Forgot account? or Create New Account Not Now Saleem & Yapa East Coast Real Estate Real Estate Agent in Rancho Cucamonga, California 5 5 out of 5 stars. Always Open Community See All 111 people like this 112 people follow this About See All (951) 329-1732 Real Estate Agent  ·  Commercial Real Estate Agency  ·  Real Estate Company Price Range $$ Hours  Always Open Page Transparency See More Facebook is showing information to help you better understand the purpose of a Page. See actions taken by the people who manage and post content. Page created - February 3, 2017 People 111  likes Related Pages Visuddhimagga.info Education Website Homes By Roshi Company Spartans Cricket Club Sports Team Michele Ynajasa Real Estate Real Estate Agent Jodie Mohler Real Estate Real Estate Agent NuLeaf Creation Visual Arts Mark Cadwallader Real Estate Services Real Estate Service Aruni Y Photography Professional Service IE Notary Signing Agent Notary Public Instructor Rupinder Singh Bedi Education San Diego Buddhist Vihara Buddhist Temple TwinShare Shopping & Retail SouthernBiotech Biotechnology Company David Stumpp Photography Photographer ACMSOFT INC. Software Company Mediamora Advertising/Marketing Prestige Auto Performance LLC Automotive Repair Shop Gravity Gaming Video Game Joe Steele Real Estate Real Estate Agent Jeff Salgado San Francisco Real Estate Real Estate Agent See More triangle-down Places Rancho Cucamonga, California Real Estate Saleem & Yapa East Coast Real Estate English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 Services Residential and Commercial Real Estate We help you buy and sell real estate in California  See All Photos See All See More \n \n \n"
}