{
    "docno": "RJP82",
    "url": "https://www.facebook.com/ideahacks.la/?ref=py_c",
    "text": "\n IDEA Hacks - Home | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home About Photos Events Posts Videos Reviews Groups Community See more of IDEA Hacks on Facebook Log In or Create New Account See more of IDEA Hacks on Facebook Log In Forgot account? or Create New Account Not Now IDEA Hacks Computer Company  Community See All 710 people like this 723 people follow this About See All www.ideahacks.la Computer Company Page Transparency See More Facebook is showing information to help you better understand the purpose of a Page. See actions taken by the people who manage and post content. Page created - July 12, 2014 People 710  likes Related Pages LA Hacks Event UCLA IEEE-Eta Kappa Nu [HKN] College & University Theta Tau at UCLA: Upsilon Delta Chapter Sorority & Fraternity Bruin Spacecraft Group at UCLA Aerospace Company Tau Beta Pi at UCLA Interest Society of Women Engineers at UCLA Engineering Service AIAA at UCLA Community Organization 3 Day Startup at UCLA Organization Business Tech. Group School UCLA iGEM x Synthetic Biology Club Biotechnology Company Artificial Intelligence ACM Organization ASDRP - Aspiring Scholars Directed Research Program Educational Research Center The Software Developers Association Software HackMerced Interest IDEAS - Int'l Data Engineering and Science Association Nonprofit Organization Quantum Computing at UC Davis Science, Technology & Engineering MSJHS Debate and Speech Team Education Website DSC at UCLA Science, Technology & Engineering Cal Hacks School Hack CU Science, Technology & Engineering See More triangle-down Pages Liked by This Page SparkFun Electronics, Inc. Magzor Autodesk HackMIT Theta Tau at UCLA: Upsilon Delta Chapter Make: Magazine Hacktech MakeMIT Autodesk Fusion 360 Digi-Key Electronics Instructables LA Hacks Northrop Grumman Corporation Raspberry Pi MHacks Autodesk Inventor Android Fitbit Arduino Atmel See More triangle-down Pages Businesses Science, Technology & Engineering Information Technology Company Computer Company IDEA Hacks English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 Photos See All Posts IDEA Hacks November 15, 2020  ·  Due to popular demand, we've decided to extend applications to November 22nd @ 11:59PM! Make sure to get your apps in before then, good luck on midterms everyone!  Apply at:  www.ideahacks.la  Facebook Event:  https://www.facebook.com/events/778405236078217 IDEA Hacks  added an  event . October 28, 2020  ·  FRI, JAN 15 IDEA Hacks 2021 Online Event 74 people interested See All Videos T-minus 8 hours, until your hacks are due, (IDE)A hackers! \nThe judging rubric has been uploaded on www.ideahacks.la, and the presentation/exhibition will be in a science fair-like format, so please prepare accordingly and email if you have any questions!\n\nAlso, thank you to Autodesk for teaching hackers how to CAD on their awesome Autodesk Fusion 360 program, and for bringing their Ember 3D printer! Check it out here! 8 IDEA Hacks 2016 Trailer 21 2 The New IDEA Hacks Website 8 See All See More \n \n \n"
}