{
    "docno": "RJP81",
    "url": "https://www.facebook.com/gngmarketingagency/?ref=py_c",
    "text": "\n Gamea & Gamea - Branding and Digital Marketing Agency - Home | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home About Photos Services Reviews Community Posts See more of Gamea & Gamea - Branding and Digital Marketing Agency on Facebook Log In or Create New Account See more of Gamea & Gamea - Branding and Digital Marketing Agency on Facebook Log In Forgot account? or Create New Account Not Now Gamea & Gamea - Branding and Digital Marketing Agency Marketing Agency in New York, New York 5 5 out of 5 stars. Closes in 15 minutes Community See All 260 people like this 261 people follow this About See All (917) 607-8712 gngmarketing.org Marketing Agency  ·  Web Designer  ·  Graphic Designer Hours 9:00 AM - 8:00 PM Closes in 15 minutes Page Transparency See More Facebook is showing information to help you better understand the purpose of a Page. See actions taken by the people who manage and post content. Page created - June 1, 2020 People 260  likes Related Pages Muslims Giving Back - Brooklyn College Nonprofit Organization NY MSA Showdown Nonprofit Organization NextGear Media Product/Service MAHDI Interest The CSI Group Marketing Agency Lunar Digital Group Marketing Agency Amplifyer Advertising/Marketing Ask Local Experts Media Then There Were Five - Jehan Eltalbwa Blogger Saffron Catering Food & Beverage Company Hand made by diana Product/Service The Last Samarrai Podcast Storytime With Ms. Kora Education MYECo Digital Marketing Social Media Agency Dyker Heights Day Care Preschool Airahphotography Camera/Photo Nile Relief International Nonprofit Organization Elegant Camel Art MediaCrossing Inc. Advertising Agency Mohammed Almathil Business Consultant See More triangle-down Places New York, New York Business Service Graphic Designer Gamea & Gamea - Branding and Digital Marketing Agency English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 Photos See All Services Brand Identity Services You’ve got an awesome idea, a great product, and a cause everyone should get behind…but your message is boring, your logo is a hot mess, and your website looks like it was made in the 80’s. We know the 80’s is in right now, but some things are better left in the past, like elevator shoes. Speaking of elevators, we elevate your brand by crafting visual identities and narratives that leave your audience saying “WOW,”  your competitors screaming, “Oh no!”, and your parents feeling proud. \n\nIncludes: \nLogo Design, Naming & Taglines, Brand Strategy, Product Design, and Web Design/Development. Digital Marketing Services The world is quickly becoming more digital. If you’re not focusing on improving your online presence, then you were already late yesterday. Luckily, our robust digital marketing services will leave you a large enough digital footprint to make big-foot squeamish. With a combination of creative thinking, clever copy-writing, and lots of research, like a lot of research; we’ll improve your SEO, make you a social media mogul, and create an effective marketing strategy from concept to execution. \n\nIncludes: Marketing Campaigns, Copywriting, SEO, Social Media, Blogging, Market Research, and Ads Graphic Design Services Bad design is like showing up to an interview with your toe sticking out of the front of your shoe and calling it a makeshift sandal. It’s not fooling anyone, and you’re not getting that job. Good design can be the difference between your event having 50 attendees and 1000’s. We do weddings, fundraisers, small events, large events, movie screenings, the whole nine yards. You might think we sound like a catering company, and technically we are. We’re caterers of great design. \n\nIncludes: Flyers + Certificates, T-Shirts, Banners, Accessories, Ad Creatives, and Magazine and Book Covers See All Posts Gamea & Gamea - Branding and Digital Marketing Agency  updated their cover photo. March 6  ·  Gamea & Gamea - Branding and Digital Marketing Agency  updated their profile picture. December 4, 2020  ·  See All See More \n \n \n"
}