{
    "docno": "RJP85",
    "url": "https://www.facebook.com/SpeakeasyToastmastersUCR/?ref=py_c",
    "text": "\n Toastmasters Speakeasy 8704 at UCR - Home | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home About Events Photos Videos Community Reviews Posts See more of Toastmasters Speakeasy 8704 at UCR on Facebook Log In or Create New Account See more of Toastmasters Speakeasy 8704 at UCR on Facebook Log In Forgot account? or Create New Account Not Now Community See All 119 people like this 125 people follow this 4 check-ins About See All 1209 University Ave. (73.43 mi)  Riverside, CA, CA 92507 Get Directions speakeasy8704.toastmastersclubs.org Nonprofit Organization  ·  Community Organization  ·  Education Price Range $ Opens Tuesday Closed Now Page Transparency See More Facebook is showing information to help you better understand the purpose of a Page. See actions taken by the people who manage and post content. Page created - May 15, 2017 People 119  likes 4   visits Related Pages Knoxville Diocesan Council of Catholic Women Religious Organization UCR Dining Local Business Great Communicators Toastmasters Club Education Talisha Tolliver Comedian Toastmasters of Dana Point Community Organization Hair By Grisi Hair Salon DAD Foundation Nonprofit Organization Health Happy Toastmasters Nonprofit Organization Events Vocational Education Network Nonprofit Organization Missionary Life LIVE Nonprofit Organization Urban Literacy Project Education bToasty Toastmasters Club Social Club Michaela Blaney Personal Blog Jen's Hairstyle Files Hair Salon Studio 813 Podcast Sacred Sovereignty Health & Wellness Website Educating Others Entrepreneur Toys Trending Deals Games/Toys Sister's Fighting For A Change Charity Organization Bail Express Bail Bonds Bail Bondsmen See More triangle-down Pages Liked by This Page City of Riverside, CA - City Government Toastmasters International University of California, Riverside Undergraduate Admissions Riverside, California The Red Hare Personal Chef Ortho Healing, LLC Toastmasters for Leaders District 52 Toastmasters Toastmasters Breakfast Club 1348, Riverside California Riverside Unified School District Associated Students of UC Riverside (ASUCR) The Mission Inn Hotel & Spa Riverside Police Department Grow Riverside 9505 Crossroads Toastmasters Club The Coffee Shop School of Writing by The Literary Concierge Moreno Valley Motivators Toastmasters Grand Terrace Toastmasters Club 290 Riverside Community College REACH Leadership STEAM Academy See More triangle-down Places Riverside, California Toastmasters Speakeasy 8704 at UCR English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 Photos See All Videos Aces, Manuel! We loved your example of how to deliver a Sergeant-At-Arms report at an officers meeting. 6 Another stellar performance from our Sergeant at Arms, Manuel Urrizola! Bravo! 2 4 Toastmaster Mary Johnson shares how being a member of Speakeasy Club 8704 has challenged her to become a better speaker! 6 See All See More \n \n \n"
}