{
    "docno": "RJP87",
    "url": "https://www.facebook.com/analyticalspace/?ref=py_c",
    "text": "\n Analytical Space - Home | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home Posts Photos About Community Events See more of Analytical Space on Facebook Log In or Create New Account See more of Analytical Space on Facebook Log In Forgot account? or Create New Account Not Now Analytical Space Aerospace Company in Cambridge, Massachusetts Community See All 398 people like this 420 people follow this About See All 501 Massachusetts Ave (2,593.44 mi)  Cambridge, MA, MA 02139 Get Directions Contact Analytical Space on Messenger www.analyticalspace.com Aerospace Company Page Transparency See More Facebook is showing information to help you better understand the purpose of a Page. See actions taken by the people who manage and post content. Page created - March 12, 2016 People 398  likes Related Pages Telescopes by Waite Research Science, Technology & Engineering Space WorkBench Aerospace Company Color Full Aerodynamics - CFD for Aerospace Engineering Aerospace Company Night Sky Chicago Media/News Company Nestrom Internet Company Wonderwerk Science Website WLPZ 95.1 FM - Sports Night Sports Promoter Think Table Tutor/Teacher Natalie Grigorian, D.OM, L.Ac Medical & Health scriptr.io Software Company ArchSys.io Commercial & Industrial Accion Systems Aerospace Company SecretPlanets - AQUA Science Website Anawen App Page Screen Time Musician Astro Digital Aerospace Company Grandpa's Nocaster Music Video Aeronautical Systems Engineering, Inc. Engineering Service Astronomy with Bipradeep Saha Science Website Spacement Product/Service See More triangle-down Places Cambridge, Massachusetts Analytical Space English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 Posts Analytical Space November 21, 2018  ·  Our CEO and Co-Founder Justin Oliveira sat down with John Gilroy of the Constellations Podcast to talk Earth observation, data relay networks, and the new space economy. Hear the full interview below!    http://bit.ly/New-Space Justin Oliveira, CEO of Analytical Space explains how Small Sats, hyperspectral imaging and the use of optical networks are revolutionizing many aspects of the traditional satellite industry. kratoscomms.com Spectral Fingerprints, Laser Communications and the emerging Space Economy | Kratos Communications Justin Oliveira, CEO of Analytical Space explains how Small Sats, hyperspectral imaging and the use of optical networks are revolutionizing many aspects of the traditional satellite industry. Justin Oliveira, CEO of Analytical Space explains how Small Sats, hyperspectral imaging and the use of optical networks are revolutionizing many aspects of the traditional satellite industry. Analytical Space November 8, 2018  ·  Analytical Space will be hosting the first edition of the Downlink speaker series next week at the Engine in Cambridge. Join us for beer, wine and an educational talk on high power-density ultracapacitors for small satellite applications, presented by Wyatt Andree and Susheel Kalabathula from Nanoramic Laboratories. THU, NOV 15, 2018 The Downlink Speaker Series: Space-Grade Ultracapacitors The Engine  ·  Cambridge, MA 6 people went See All Photos See All See More \n \n \n"
}