{
    "docno": "RJP80",
    "url": "https://www.facebook.com/korbelsiecenter/?ref=py_c",
    "text": "\n Sié Chéou-Kang Center for International Security & Diplomacy - Home | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home About Events Posts Photos Reviews Community See more of Sié Chéou-Kang Center for International Security & Diplomacy on Facebook Log In or Create New Account See more of Sié Chéou-Kang Center for International Security & Diplomacy on Facebook Log In Forgot account? or Create New Account Not Now Sié Chéou-Kang Center for International Security & Diplomacy School in Denver, Colorado Community See All 477 people like this 512 people follow this 67 check-ins About See All 2201 South Gaylord Street (830.27 mi)  Denver, CO, CO 80208 Get Directions (303) 871-7713 www.du.edu/korbel/sie/index.html School Price Range $$$ Page Transparency See More Facebook is showing information to help you better understand the purpose of a Page. See actions taken by the people who manage and post content. Page created - June 4, 2015 People 477  likes 67   visits Related Pages Korbel Latin American Studies Association Education Students for Africa Organization KorbelCareers College & University Pardee Center for International Futures College & University Josef Korbel School Latin America Center College & University Humanitarian Assistance Program- Josef Korbel School College & University UCSB San Clemente Villages and Westgate Apartments College & University DU Model United Nations Organization International Student Organization - ISO at DU Organization Latin America Historical Society Education Georgetown United Against Police Aggression Political Organization Princeton Center for International Security Studies College & University SAIS Global Security and Conflict Management Club Organization Georgetown University Office of Fellowships College & University Society for Peace and Conflict Resolution College & University Center for Long-Term Cybersecurity College & University International Programs in Engineering - University of Michigan College & University John Chambers Public Figure International & Intercultural Communication Program at DU School Black Umbrella Brand See More triangle-down Pages Liked by This Page No Lost Generation - University of Denver Just Vision LIFE FORCE University of Denver-Political Science Department Colorado European Union Center of Excellence - CEUCE Josef Korbel School of International Studies, University of Denver One Earth Future - OEF Josef Korbel School of International Studies DU - Center for Community Engagement to advance Scholarship and Learning See More triangle-down Places Denver, Colorado Sié Chéou-Kang Center for International Security & Diplomacy English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 Posts Sié Chéou-Kang Center for International Security & Diplomacy June 11, 2020  ·  Deborah Avant and Kara Neu in  PVGlance , \"Military Dissent Could Curb Democratic Backsliding in the US\" politicalviolenceataglance.org Military Dissent Could Curb Democratic Backsliding in the US – Political Violence at a Glance Military Dissent Could Curb Democratic Backsliding in the US Former Secretary of Defense General Jim Mattis. Photo courtesy of US Secretary of Defense via Flickr. ByDeborah AvantJune 11, 2020 By Deborah Avant and guest contributor Kara Kingma Neu In the wake of increasing military dissent over its u... Military Dissent Could Curb Democratic Backsliding in the US Former Secretary of Defense General Jim Mattis. Photo courtesy of US Secretary of Defense via Flickr. ByDeborah AvantJune 11, 2020 By Deborah Avant and guest contributor Kara Kingma Neu In the wake of increasing military dissent over its u... Sié Chéou-Kang Center for International Security & Diplomacy April 15, 2020  ·  William Akoto, Joint Postdoctoral Fellow for the Sie Center and  One Earth Future - OEF  wrote a piece in  Medium .  # coupstudies   # militarycoup Political symbols can be powerful and successful coup plotters may take advantage of that. medium.com Seizing Symbolic Targets is Crucial to Coup Success Political symbols can be powerful and successful coup plotters may take advantage of that. Political symbols can be powerful and successful coup plotters may take advantage of that. See All Photos See All See More \n \n \n"
}