{
    "docno": "RJP88",
    "url": "https://www.facebook.com/CLTCBerkeley/?ref=py_c",
    "text": "\n Center for Long-Term Cybersecurity - Home | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home About Events Photos Community Reviews Posts Join the CLTC Email List See more of Center for Long-Term Cybersecurity on Facebook Log In or Create New Account See more of Center for Long-Term Cybersecurity on Facebook Log In Forgot account? or Create New Account Not Now Center for Long-Term Cybersecurity College & University  5 5 out of 5 stars. Community See All 328 people like this 370 people follow this 1 check-in About See All (510) 664-7506 cltc.berkeley.edu College & University Page Transparency See More Facebook is showing information to help you better understand the purpose of a Page. See actions taken by the people who manage and post content. Page created - October 22, 2016 People 328  likes Related Pages Machine Learning at Berkeley Computer Company FEMTech Science, Technology & Engineering Berkeley Institute for Data Science - BIDS Educational Research Center Stanford Energy Club Nonprofit Organization Berkeley Cyber Security Team Berke1337 Computers & Internet Website Women in Tech Law: Berkeley Law Organization UC Berkeley UPE Social Club Quantum Computing at UC Davis Science, Technology & Engineering Effective Altruists of Berkeley Nonprofit Organization PFP Cybersecurity Computer Company UC Berkeley Events and Conferences Wedding Venue SCET Student Association College & University Gradescope Education Berkeley Technology Law Journal Local Business Berkeley Technology Review Media/News Company she256 Nonprofit Organization Yale Society of Physics Students Science, Technology & Engineering Princeton Center for International Security Studies College & University Silicon Valley Artificial Intelligence Organization New Heights Communications Public Relations Agency See More triangle-down Pages Liked by This Page Startup Policy Lab iSchools UC Berkeley Division of Computing, Data Science, and Society Human Rights Center at UC Berkeley CITRIS InfoCamp Berkeley RSA Conference See More triangle-down Pages Businesses Education College & University Center for Long-Term Cybersecurity English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 Photos See All Posts Center for Long-Term Cybersecurity June 9 at 11:29 AM  ·  Alex Cohen June 7 at 7:45 PM I'm pleased to announce that  Driven Arts Collective 's upcoming project, CELSO (Community Emotional Light Sound Organism) has been selected to be among the winne ... rs of the CLTC Cybersecurity Arts Contest. Much gratitude to the  Center for Long-Term Cybersecurity  for selecting CELSO. So proud of our team at  Driven Arts Collective . Looking forward to the journey ahead.   See More The Center for Long-Term Cybersecurity (CLTC) is proud to announce the winners of our 2021 Cybersecurity Arts Contest. The five winning projects span a range of creative concepts, from a dance performance that integrates emotion-sensing masks, to a web-based game that illuminates online discriminati... cltc.berkeley.edu CLTC Announces Winners of 2021 Cybersecurity Arts Contest - CLTC UC Berkeley Center for Long-Term Cybersecurity The Center for Long-Term Cybersecurity (CLTC) is proud to announce the winners of our 2021 Cybersecurity Arts Contest. The five winning projects span a range of creative concepts, from a dance performance that integrates emotion-sensing masks, to a web-based game that illuminates online discriminati... The Center for Long-Term Cybersecurity (CLTC) is proud to announce the winners of our 2021 Cybersecurity Arts Contest. The five winning projects span a range of creative concepts, from a dance performance that integrates emotion-sensing masks, to a web-based game that illuminates online discriminati... Center for Long-Term Cybersecurity May 12 at 10:59 AM  ·  In the latest episode of the Business of Government Hour podcast,  UC Berkeley  researchers Alison Post and Alexandra Pan discuss  # SmartCity   # cybersecurity  risks and resources for local public agencies to make informed choices about adopting these technologies. Listen here or wherever you listen to podcasts! What is “smart cities” technology? Do all smart city technologies pose equivalent cybersecurity risks? What are some of the most prevalent cyber threats posed by these technologies? federalnewsnetwork.com A conversation on the cybersecurity risks of smart city technologies | Federal News Network What is “smart cities” technology? Do all smart city technologies pose equivalent cybersecurity risks? What are some of the most prevalent cyber threats posed by these technologies? What is “smart cities” technology? Do all smart city technologies pose equivalent cybersecurity risks? What are some of the most prevalent cyber threats posed by these technologies? See All See More \n \n \n"
}