{
    "docno": "RJP89",
    "url": "https://www.facebook.com/isu.ucr/?ref=py_c",
    "text": "\n International Student Union at UCR - Home | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home Events Posts Reviews Videos Photos About Community See more of International Student Union at UCR on Facebook Log In or Create New Account See more of International Student Union at UCR on Facebook Log In Forgot account? or Create New Account Not Now International Student Union at UCR College & University  5 5 out of 5 stars. Community See All 327 people like this 353 people follow this About See All highlanderlink.ucr.edu/organization/InternationalStudentUnion College & University Page Transparency See More Facebook is showing information to help you better understand the purpose of a Page. See actions taken by the people who manage and post content. Page created - January 21, 2018 People 327  likes Related Pages UC Riverside International Affairs College & University UCR Campus Apartments & Family Housing Apartment & Condo Building Bopomofo Cafe Cafe International Student in Japan College & University Nikkei Student Union at UC Riverside Community Organization International Student Union - ZUST College & University Humans of Temple City Organization Student Design Center Graphic Designer UC Riverside Student Workers Union UAW Local 2865 Political Organization Project RISHI at UCR Nonprofit Organization Outhrive Nonprofit Organization UCI Badminton Club Page Organization Florian Financial Aid Service Rose Hack Event Senryu Taiko Musician/Band PharmSci Alternative Careers Association - PACA at UCI Social Club Gamma Beta Phi Honor Society at UCR Nonprofit Organization Cal Badminton College & University UCR ITS College & University University of California, Riverside Bell Tower Landmark & Historical Place See More triangle-down Pages Businesses Education College & University International Student Union at UCR English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 Posts International Student Union at UCR February 8  ·  Is your name WiFi? Because I’m really feeling a connection. Come join us and make this connection stronger in our collaborated event with ASUCR (ISC) this Friday. We’re hosting a valentines special love languages event and you could be the special one to win a GIFT CARD from us!! Link to the event is below!   https://ucr.zoom.us/j/92077579880 International Student Union at UCR November 5, 2020  ·  Hi guys!! Good luck to everyone who have midterms coming up! We’re having a game night this Friday through Discord  😊  Let’s chat and play some Among Us!! Hope to see you all there! See All Videos As we draw closer to ISU’s First Ever International Night, we will be highlighting all of our performers as “Performance Spotlight”. Our first Performance Spotlight goes to Senryu Taiko!!! \n\nWe are Senryu Taiko, the premier Japanese drumming (taiko) group at UC Riverside. All of the members here at Senryu Taiko were drawn to the passion and intensity of taiko, and we enjoy playing and performing. We have performed all around campus and Southern California, and we are greatly involved in our local and greater community, being present in events such as the Riverside Lunar Festival, San Jose Obon, Anime Expo, Disneyland and much more. \n\nSenryu Taiko has many performances and workshops throughout the year and we greatly encourage you stay updated on our social media to learn about future events. You can follow us on social media on Facebook (Senryu Taiko), Instagram (@senryutaiko), and YouTube (Senryu Taiko). \n\nStay tuned also for our official announcement for our 12th Annual Spring Concert coming soon! 9 ISU Coffee Hour 11 Be You with Us 12 See All See More \n \n \n"
}