{
    "docno": "RJP84",
    "url": "https://www.facebook.com/BradanAccountants/?ref=py_c",
    "text": "\n Bradán Accountants - Home | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home Reviews Photos Posts About Community Welcome See more of Bradán Accountants on Facebook Log In or Create New Account See more of Bradán Accountants on Facebook Log In Forgot account? or Create New Account Not Now Bradán Accountants Accountant in Galway, Ireland Closed Now Community See All 179 people like this 213 people follow this About See All 21 Eyre Square (5,064.43 mi)  Galway, Ireland,   Get Directions +353 91 450 705 bradanaccountants.ie Accountant  ·  Business Consultant  ·  Tax Preparation Service Opens Monday Closed Now Page Transparency See More Facebook is showing information to help you better understand the purpose of a Page. See actions taken by the people who manage and post content. Page created - May 17, 2010 People 179  likes Related Pages Sarah Connolly Photography Photographer Butchers Storyland TV Show The Bogus Pogues Musician/Band O'Rourke & Co. Chartered Accountants Accountant Hats-Rebekah Patterson-Milliner Hat Store Ourside Consulting Agency Do My Books Online Accountants Accountant Activating Aphrodite Alternative & Holistic Health Service Syd Vestfyns el & Haarby VVS Local Business Connolly Building & Renovations Ltd Contractor Feroinvest Group Financial Service Gahan Local Business The Old Stone Barn Connemara Vacation Home Rental Create and Code Internet Company Beacon Computer Company GrokStyle Computer Company Insycle Internet Company Singing In The Rain Clothing (Brand) Wing Tsung Ireland Martial Arts School AMQ Accountants and Auditors Accountant See More triangle-down Pages Liked by This Page Ocean Fitness Galway Unison Gallery SpunOut.ie Pinch Seasonings Shane's on Chatsworth techbits.ie The Galway Advertiser ACCA Elite Personal Training Customised IT Solutions Connolly Building & Renovations Ltd Midas Select Mayo Advertiser Avoca String Quartet TweakYourBiz Dublin Poker Nights Online Business Marketing The Ardilaun Leisure Club johnnybeirne.com Sarah Lynch Swimming See More triangle-down Places Galway, Ireland Financial Service Tax Preparation Service Bradán Accountants English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 Photos See All Posts Bradán Accountants December 14, 2017  ·  https://bradanaccountants.ie/…/christmas-end-year-top-4-ta…/ We have just been in touch with our clients with our top 4 tax tips which might put a smile on your face for this Christmas / End of year 1. Gift Vouchers for Employees tax free You can give all employees (including directors) up to €500 in non-cash vouchers per annum. The main benefit […] bradanaccountants.ie Christmas and End of Year – Top 4 Tax Tips from Bradan Accountants We have just been in touch with our clients with our top 4 tax tips which might put a smile on your face for this Christmas / End of year 1. Gift Vouchers for Employees tax free You can give all employees (including directors) up to €500 in non-cash vouchers per annum. The main benefit […] Learn More We have just been in touch with our clients with our top 4 tax tips which might put a smile on your face for this Christmas / End of year 1. Gift Vouchers for Employees tax free You can give all employees (including directors) up to €500 in non-cash vouchers per annum. The main benefit […] Bradán Accountants September 22, 2017  ·  Bradán Accountants updated their website address. Learn More See All See More \n \n \n"
}