{
    "docno": "RJP90",
    "url": "https://www.facebook.com/rosehackucr/?ref=py_c",
    "text": "\n Rose Hack - Home | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home Posts Reviews Videos Photos Events About Community See more of Rose Hack on Facebook Log In or Create New Account See more of Rose Hack on Facebook Log In Forgot account? or Create New Account Not Now Community See All 516 people like this 535 people follow this 1 check-in About See All 900 University Avenue (73.81 mi)  Riverside, CA, CA 92521 Get Directions (510) 579-4476 rosehack.com Event Hours  Always Open Page Transparency See More Facebook is showing information to help you better understand the purpose of a Page. See actions taken by the people who manage and post content. Page created - May 20, 2018 People 516  likes 1   visit Related Pages Bourns Science and Engineering Day Event Cutie Hack Interest SHPE at UCR School Theta Tau at UCR: Sigma Delta Chapter Nonprofit Organization UCR Solar Car Science, Technology & Engineering GrizzHacks Computer Company Triton XR Social Club SD Hacks Nonprofit Organization HackTheU Science, Technology & Engineering Hack XX Interest Engineering R'Future Event UCSB Pre-Physician Assistant Association Organization Spectra Event Highlander Racing College & University Project RISHI at UCR Nonprofit Organization Riverside Surging Dragons Amateur Sports Team SacHacks Science, Technology & Engineering CruzHacks College & University IEEE at UCR Education UCI Badminton Club Page Organization See More triangle-down Places Riverside, California Rose Hack English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 Posts Rose Hack April 6  ·  Interested in planning a hackathon or helping underrepresented groups in tech build a strong network? Apply to be a Rose Hack 2022 Lead ASAP through the link in our flyer or through our website  rosehack.com.  Applications are due (end of Week 3) April 17th at 11:59 PM.  🌹 Rose Hack February 16  ·  Rose Hack 2021 would not have been possible without the help from our wonderful sponsors!   We would like to say a HUGE thank you to everyone who sponsored Rose Hack 2021 this year! We appreciate your constant support and for helping us promote our mission through our hackathon!  🥰 🎉 ❤️ See All Videos 😲Only 3 more days till our Leads Applications are due!  If you're interested in being a big part of making 🌹Rose Hack 2021🌹 amazing, scan the QR code or click here: https://forms.gle/Uf5AckEMuo3q6Vas8 to apply by April 17th 💕\n\nLearn more about us and our mission at rosehack.com :) 1 Rose Hack Lead Applications 2 7 2 See All Photos See All See More \n \n \n"
}