{
    "docno": "RJP97",
    "url": "https://www.facebook.com/DukeUniv/?fref=mentions",
    "text": "\n Duke University - Home | Facebook \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Jump to Sections of this page Accessibility Help Press  alt  +  /  to open this menu Facebook Email or Phone Password Forgot account? Home About Posts Photos Events YouTube Videos Virtual Experience Community See more of Duke University on Facebook Log In or Create New Account See more of Duke University on Facebook Log In Forgot account? or Create New Account Not Now Duke University College & University in Durham, North Carolina Community See All 362,548 people like this 364,411 people follow this 17,502 check-ins About See All 2080 Duke University Road (2,223.75 mi)  Durham, NC, NC 27708 Get Directions www.duke.edu College & University Page Transparency See More Facebook is showing information to help you better understand the purpose of a Page. See actions taken by the people who manage and post content. Page created - June 28, 2008 People 362,548  likes 17,502   visits Related Pages Honawolf Musician/Band Future Prospects Sports Event Jane Fleming Kleeb Public Figure Frozen Hobo Adventure Media Photography Videography Jackson Local Business Holly Stratton: LifeHurts Author So Delicious Kitchen/Cooking Duke Blue Devils on Fanatics Company Mike \"Coach K\" Krzyzewski Public Figure Jared Ellis Motivational Speaker PrepScholar Educational Consultant Deborah Montesano/thepoliticali Writer Local 294 Teamsters United Labor Union Brown University College & University Wharton Online Education Duke Football School Sports Team Duke Men's Basketball School Sports Team Yale University College & University Liberty Basketball School Sports Team Duke Undergraduate Admissions Campus Building See More triangle-down Pages Liked by This Page Duke Alumni Duke Athletics Duke Students Duke Health Working@Duke Art, Art History & Visual Studies @ Duke Lilly Library Duke University Duke Student Government North Carolina Biotechnology Center Duke Human Rights Center at the Franklin Humanities Institute Duke Men's Basketball Duke Kunshan University Duke Cancer Institute Duke University Dance Program Duke University Admissions Duke University Student Affairs University Center Activities & Events (UCAE) at Duke University Washington Duke Inn & Golf Club Duke BSA Duke Islamic Studies Center See More triangle-down Places Durham, North Carolina Duke University English (US)  ·  Español  ·  Português (Brasil)  ·  Français (France)  ·  Deutsch Privacy  ·  Terms  ·  Advertising  ·  Ad Choices  ·  Cookies  ·  More  Facebook © 2021 Posts Duke University 1 hr  ·  50 shades of sunsets  🌇 Duke University 8 hrs  ·  A Duke-developed artificial intelligence tool for toilets could give gastroenterologists important information to provide appropriate treatment for chronic issues. DURHAM, N.C. -- An artificial intelligence tool being developed by Duke scientists can be added to the standard toilet to help analyze patients’ stool and give gastroenterologists the information they need to provide appropriate treatment for chronic issues such as inflammatory bowel disease (IBD)... today.duke.edu ’Smart Toilet’ Uses Artificial Intelligence to Monitor Bowel Health DURHAM, N.C. -- An artificial intelligence tool being developed by Duke scientists can be added to the standard toilet to help analyze patients’ stool and give gastroenterologists the information they need to provide appropriate treatment for chronic issues such as inflammatory bowel disease (IBD)... DURHAM, N.C. -- An artificial intelligence tool being developed by Duke scientists can be added to the standard toilet to help analyze patients’ stool and give gastroenterologists the information they need to provide appropriate treatment for chronic issues such as inflammatory bowel disease (IBD)... See All Photos See All See More \n \n \n"
}