{
    "docno": "RJP99",
    "url": "https://vcpb.ucr.edu/",
    "text": "\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Planning, Budget & Administration | \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Coronavirus (COVID-19)  information and resources . UCR Campus is Closed. Instruction Delivered Remotely for Spring Quarter. \n \n \n \n \n \n \n \n \n \n \n \n \n \n Skip to main content \n \n \n A to Z Listing \n Campus Map \n Find People \n News \n \n \n \n \n Skip to main content \n \n University of California, Riverside \n \n \n \n \n Search \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n UC Riverside \n \n \n \n \n  Planning, Budget & Administration  \n \n \n \n  Planning, Budget & Administration  \n \n \n \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n Home \n \n \n People \n \n \n About Us \n \n \n VCPBA ORG Chart \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n            Welcome to Planning, Budget & Administration      \n            UCR Police Department     \n            Student Commons     \n            Hub and Bell Tower     \n            Genomics Walkway     Previous Next \n \n \n \n \n \n \n \n \n Breadcrumb \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Planning Budget and Administration contributes to the university’s mission by promoting student success, and enhancing the lives of our students, faculty and staff by providing innovative, cost effective, reliable, and vital operational and administrative services for our campus community.  By providing institution-wide leadership for capital and financial planning, budgeting, accounting and reporting; promoting stewardship of university resources and assets; ensuring public safety on and around campus; maintaining appropriate risk management controls; maintaining and enhancing university buildings and grounds; attracting, retaining, and developing inspiring university employees; providing our students with safe, convenient, student responsive housing and dining options and delivering other mission critical auxiliary and business support services, Planning Budget and Administration endeavors every day to create a sustainable future for our university and the greater Riverside Community. \n \n \n \n \n \n \n Departments \n \n \n \n \n \n \n Auxiliary Services \n Auxiliary Services provides a host of essential services that enhance campus life for students, faculty, staff and the local community. Each self-supporting unit strives to provide “best-in-class” performance in support of the university’s mission. \n Visit Auxiliary Services \n \n \n Business and Financial Services \n Business and Financial Services mission is to support research, instruction, and public service by providing prompt,reliable business and financial information and services while balancing compliance with applicable laws, regulations, and policies. \n   \n Visit BFS \n \n \n Emergency Management  \n Emergency Management strives to be 'event-ready' by taking a proactive \"all-hazards\" approach to prevent, mitigate, prepare for, respond to, and recover from any adverse events or disruptions, in conjunction with our system-wide Mission Continuity program. \n Visit Emergency mgmt \n \n \n Environmental Health & Safety \n The mission of EH&S is to provide leadership and services that enhance the research and educational process by integrating health, safety and environmental health and risk management practices into the campus culture and activities. \n   \n  Visit EH&S \n \n \n Facilities Services \n Facilities Services aims to provide exceptional service in maintaining an environment conducive to teaching, learning, living, working and research for the entire campus community. \n   \n   \n Visit Facilities Services \n \n \n Financial Planning & Analysis \n Financial Planning & Analysis administers the campus-wide budget process, including the annual Auxiliary and Self-Supporting Enterprise budget and rate review process. \n   \n   \n Visit FP&A \n \n \n Human Resources \n Human Resources provides HR leadership and expertise to create and support a high performing, inclusive workplace which advance UCR's mission and strategic objectives. \n   \n   \n VISIT HR \n \n \n Institutional Research \n Institutional Research supports UC Riverside with data analysis and reports designed to inform campus strategic planning and decision-making. They are the source of official statistics for the university related to students, faculty, and staff. \n   \n visit IR \n \n \n Planning, Design & Construction \n The Mission of PD&C is balanced between the responsibilities for the planning and design of the campus and the management of construction in a way that respects the overall vision of the Physical Design Framework and embodies a cohesive environment that is distinctly UCR \n visit PD&C \n \n \n Real Estate Services & Asset Management  \n Real Estate Services and Asset Management (REASM) provides real estate transactions (i.e. leases, licenses, etc.), public-private partnership (P3) real estate development, asset management services for UCR real property assets. REASM also oversees the UC Mortgage Origination Program (MOP) and UCR's Faculty & Staff Housing rental portfolio. \n visit resam \n \n \n R'Shared Services Center \n \n \n \n \n \n \n \n \n \n \n \n As a service organization, the R’SSC performs high-quality routine payroll, financial, and administrative transactional services. We are committed to providing a premier service experience for all clients that consistently exceeds their standards of service, quality, value and excellence . \n   \n \n \n \n \n \n \n \n \n \n \n \n visit R'SSC \n \n \n Space Management \n \n \n \n \n Space Management is responsible for tracking space, recommending space assignments, performing evaluations of space use, analyzing space utilization, and recommending reassignments of space.  Space Management also advises on best practices for effective utilization of space. \n   \n \n \n \n \n visit Space Management \n   \n \n \n Sustainability \n The Office of Sustainability supports UCR’s commitment to environmental and social sustainability by providing guidance for campus operations, academic endeavors, and service activities. \n visit Sustainability  \n \n \n UCPD \n \n \n \n \n \n \n \n \n \n \n \n The mission of the UCR Police Department is to heighten the quality of life by providing a secure and safe environment through professional service to the campus community. \n \n \n \n \n \n \n \n \n \n \n \n visit UCPD \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Search \n \n \n \n \n \n \n University of California, Riverside \n \n 900 University Ave. \n            Riverside, CA 92521 \n Tel: (951) 827-1012 \n \n \n UCR Library \n Campus Status \n Campus Store \n Career Opportunities \n Diversity \n Maps and Directions \n Visit UCR \n \n \n \n \n \n Planning, Budget & Administration  \n \n               4118 Hinderakar Hall \n             Riverside, CA 92521                          \n  tel: (951) 827-7310                         email:  milly.paredez@ucr.edu   \n \n \n \n \n \n Related Links \n \n \n Delegations of Authority \n \n UCOP Policies and Procedures \n \n UCR Policies and Procedures \n \n HR Focused Follow-up  Report \n \n \n \n \n \n \n \n \n \n \n \n \n \n Privacy Policy \n Terms and Conditions \n © 2021 Regents of the University of California \n \n \n \n \n \n \n \n \n \n \n × \n \n \n \n \n \n \n Let us help you with your search \n \n \n Enter your Search Criteria. \n \n \n \n Search \n \n \n Cancel \n \n \n \n \n \n \n \n \n \n \n \n \n"
}